MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                       PC v15.12.3.LTS *
       3            ;* Date/Time created: Mon Oct 17 14:32:59 2016                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../initClock.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 2003-2
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("D:\CodeComposerProj\CardReader001\src\Debug")
      12            $C$DW$1 .dwtag  DW_TAG_variable
      13                    .dwattr $C$DW$1, DW_AT_name("UCSCTL2")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("UCSCTL2")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$92)

      54            $C$DW$4 .dwtag  DW_TAG_formal_parameter
      55                    .dwattr $C$DW$4, DW_AT_name("clock_speed")
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE    2

      56                    .dwattr $C$DW$4, DW_AT_TI_symbol_name("clock_speed")
      57                    .dwattr $C$DW$4, DW_AT_type(*$C$DW$T$10)
      58                    .dwattr $C$DW$4, DW_AT_location[DW_OP_reg12]
      59            
      60            
      61            ;*****************************************************************************
      62            ;* FUNCTION NAME: set_clock                                                  *
      63            ;*                                                                           *
      64            ;*   Regs Modified     : SP,SR,r12                                           *
      65            ;*   Regs Used         : SP,SR,r12                                           *
      66            ;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
      67            ;*****************************************************************************
      68 000000       set_clock:
      69            ;* --------------------------------------------------------------------------*
      70                    .dwcfi  cfa_offset, 4
      71                    .dwcfi  save_reg_to_mem, 16, -4
      72            ;* r12   assigned to clock_speed
      73            $C$DW$5 .dwtag  DW_TAG_variable
      74                    .dwattr $C$DW$5, DW_AT_name("clock_speed")
      75                    .dwattr $C$DW$5, DW_AT_TI_symbol_name("clock_speed")
      76                    .dwattr $C$DW$5, DW_AT_type(*$C$DW$T$10)
      77                    .dwattr $C$DW$5, DW_AT_location[DW_OP_reg12]
      78            
      79                    .dwpsn  file "../initClock.c",line 11,column 2,is_stmt,isa 0
      80 000000 930C          TST.W     r12                   ; [] |11| 
      81 000002 2005          JNE       $C$L1                 ; [] |11| 
      82                                                      ; [] |11| 
      83            ;* --------------------------------------------------------------------------*
      84                    .dwpsn  file "../initClock.c",line 12,column 3,is_stmt,isa 0
      85 000004 4292          MOV.W     &UCSCTL2+0,&UCSCTL2+0 ; [] |12| 
         000006 0000!
         000008 0000!
      86                    .dwpsn  file "../initClock.c",line 15,column 3,is_stmt,isa 0
      87 00000a D2A2          OR.W      #4,&UCSCTL4+0         ; [] |15| 
         00000c 0000!
      88            ;* --------------------------------------------------------------------------*
      89 00000e       $C$L1:    
      90                    .dwpsn  file "../initClock.c",line 18,column 2,is_stmt,isa 0
      91 00000e 430C          MOV.W     #0,r12                ; [] |18| 
      92                    .dwpsn  file "../initClock.c",line 19,column 1,is_stmt,isa 0
      93            $C$DW$6 .dwtag  DW_TAG_TI_branch
      94                    .dwattr $C$DW$6, DW_AT_low_pc(0x00)
      95                    .dwattr $C$DW$6, DW_AT_TI_return
      96            
      97 000010 0110          RETA      ; [] 
      98                    ; [] 
      99                    .dwattr $C$DW$3, DW_AT_TI_end_file("../initClock.c")
     100                    .dwattr $C$DW$3, DW_AT_TI_end_line(0x13)
     101                    .dwattr $C$DW$3, DW_AT_TI_end_column(0x01)
     102                    .dwendentry
     103                    .dwendtag $C$DW$3
     104            
     105            ;*****************************************************************************
     106            ;* UNDEFINED EXTERNAL REFERENCES                                             *
     107            ;*****************************************************************************
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE    3

     108                    .global UCSCTL2
     109                    .global UCSCTL4
     110            
     111            ;******************************************************************************
     112            ;* BUILD ATTRIBUTES                                                           *
     113            ;******************************************************************************
     114                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
     115                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000001111000000000
     116                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
     117                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
     118                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
     119                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
     120            
     121            ;******************************************************************************
     122            ;* TYPE INFORMATION                                                           *
     123            ;******************************************************************************
     124            
     125            $C$DW$T$20      .dwtag  DW_TAG_structure_type
     126                    .dwattr $C$DW$T$20, DW_AT_name("ADC12_A_configureMemoryParam")
     127                    .dwattr $C$DW$T$20, DW_AT_byte_size(0x05)
     128            $C$DW$7 .dwtag  DW_TAG_member
     129                    .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     130                    .dwattr $C$DW$7, DW_AT_name("memoryBufferControlIndex")
     131                    .dwattr $C$DW$7, DW_AT_TI_symbol_name("memoryBufferControlIndex")
     132                    .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     133                    .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     134                    .dwattr $C$DW$7, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
     135                    .dwattr $C$DW$7, DW_AT_decl_line(0x53)
     136                    .dwattr $C$DW$7, DW_AT_decl_column(0x0d)
     137            
     138            $C$DW$8 .dwtag  DW_TAG_member
     139                    .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     140                    .dwattr $C$DW$8, DW_AT_name("inputSourceSelect")
     141                    .dwattr $C$DW$8, DW_AT_TI_symbol_name("inputSourceSelect")
     142                    .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     143                    .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     144                    .dwattr $C$DW$8, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
     145                    .dwattr $C$DW$8, DW_AT_decl_line(0x67)
     146                    .dwattr $C$DW$8, DW_AT_decl_column(0x0d)
     147            
     148            $C$DW$9 .dwtag  DW_TAG_member
     149                    .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     150                    .dwattr $C$DW$9, DW_AT_name("positiveRefVoltageSourceSelect")
     151                    .dwattr $C$DW$9, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
     152                    .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     153                    .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     154                    .dwattr $C$DW$9, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
     155                    .dwattr $C$DW$9, DW_AT_decl_line(0x6e)
     156                    .dwattr $C$DW$9, DW_AT_decl_column(0x0d)
     157            
     158            $C$DW$10        .dwtag  DW_TAG_member
     159                    .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     160                    .dwattr $C$DW$10, DW_AT_name("negativeRefVoltageSourceSelect")
     161                    .dwattr $C$DW$10, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
     162                    .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE    4

     163                    .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     164                    .dwattr $C$DW$10, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
     165                    .dwattr $C$DW$10, DW_AT_decl_line(0x74)
     166                    .dwattr $C$DW$10, DW_AT_decl_column(0x0d)
     167            
     168            $C$DW$11        .dwtag  DW_TAG_member
     169                    .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     170                    .dwattr $C$DW$11, DW_AT_name("endOfSequence")
     171                    .dwattr $C$DW$11, DW_AT_TI_symbol_name("endOfSequence")
     172                    .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     173                    .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     174                    .dwattr $C$DW$11, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
     175                    .dwattr $C$DW$11, DW_AT_decl_line(0x7d)
     176                    .dwattr $C$DW$11, DW_AT_decl_column(0x0d)
     177            
     178                    .dwattr $C$DW$T$20, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
     179                    .dwattr $C$DW$T$20, DW_AT_decl_line(0x3f)
     180                    .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
     181                    .dwendtag $C$DW$T$20
     182            
     183            $C$DW$T$57      .dwtag  DW_TAG_typedef
     184                    .dwattr $C$DW$T$57, DW_AT_name("ADC12_A_configureMemoryParam")
     185                    .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$20)
     186                    .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
     187                    .dwattr $C$DW$T$57, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
     188                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x7e)
     189                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x03)
     190            
     191            
     192            $C$DW$T$22      .dwtag  DW_TAG_structure_type
     193                    .dwattr $C$DW$T$22, DW_AT_name("Calendar")
     194                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
     195            $C$DW$12        .dwtag  DW_TAG_member
     196                    .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     197                    .dwattr $C$DW$12, DW_AT_name("Seconds")
     198                    .dwattr $C$DW$12, DW_AT_TI_symbol_name("Seconds")
     199                    .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     200                    .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     201                    .dwattr $C$DW$12, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     202                    .dwattr $C$DW$12, DW_AT_decl_line(0x5c)
     203                    .dwattr $C$DW$12, DW_AT_decl_column(0x0d)
     204            
     205            $C$DW$13        .dwtag  DW_TAG_member
     206                    .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     207                    .dwattr $C$DW$13, DW_AT_name("Minutes")
     208                    .dwattr $C$DW$13, DW_AT_TI_symbol_name("Minutes")
     209                    .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     210                    .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     211                    .dwattr $C$DW$13, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     212                    .dwattr $C$DW$13, DW_AT_decl_line(0x5e)
     213                    .dwattr $C$DW$13, DW_AT_decl_column(0x0d)
     214            
     215            $C$DW$14        .dwtag  DW_TAG_member
     216                    .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     217                    .dwattr $C$DW$14, DW_AT_name("Hours")
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE    5

     218                    .dwattr $C$DW$14, DW_AT_TI_symbol_name("Hours")
     219                    .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     220                    .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     221                    .dwattr $C$DW$14, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     222                    .dwattr $C$DW$14, DW_AT_decl_line(0x60)
     223                    .dwattr $C$DW$14, DW_AT_decl_column(0x0d)
     224            
     225            $C$DW$15        .dwtag  DW_TAG_member
     226                    .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     227                    .dwattr $C$DW$15, DW_AT_name("DayOfWeek")
     228                    .dwattr $C$DW$15, DW_AT_TI_symbol_name("DayOfWeek")
     229                    .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     230                    .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     231                    .dwattr $C$DW$15, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     232                    .dwattr $C$DW$15, DW_AT_decl_line(0x62)
     233                    .dwattr $C$DW$15, DW_AT_decl_column(0x0d)
     234            
     235            $C$DW$16        .dwtag  DW_TAG_member
     236                    .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     237                    .dwattr $C$DW$16, DW_AT_name("DayOfMonth")
     238                    .dwattr $C$DW$16, DW_AT_TI_symbol_name("DayOfMonth")
     239                    .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     240                    .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     241                    .dwattr $C$DW$16, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     242                    .dwattr $C$DW$16, DW_AT_decl_line(0x64)
     243                    .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
     244            
     245            $C$DW$17        .dwtag  DW_TAG_member
     246                    .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     247                    .dwattr $C$DW$17, DW_AT_name("Month")
     248                    .dwattr $C$DW$17, DW_AT_TI_symbol_name("Month")
     249                    .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     250                    .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     251                    .dwattr $C$DW$17, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     252                    .dwattr $C$DW$17, DW_AT_decl_line(0x66)
     253                    .dwattr $C$DW$17, DW_AT_decl_column(0x0d)
     254            
     255            $C$DW$18        .dwtag  DW_TAG_member
     256                    .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$21)
     257                    .dwattr $C$DW$18, DW_AT_name("Year")
     258                    .dwattr $C$DW$18, DW_AT_TI_symbol_name("Year")
     259                    .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     260                    .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     261                    .dwattr $C$DW$18, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     262                    .dwattr $C$DW$18, DW_AT_decl_line(0x68)
     263                    .dwattr $C$DW$18, DW_AT_decl_column(0x0e)
     264            
     265                    .dwattr $C$DW$T$22, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     266                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x59)
     267                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
     268                    .dwendtag $C$DW$T$22
     269            
     270            $C$DW$T$58      .dwtag  DW_TAG_typedef
     271                    .dwattr $C$DW$T$58, DW_AT_name("Calendar")
     272                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$22)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE    6

     273                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
     274                    .dwattr $C$DW$T$58, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     275                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x69)
     276                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
     277            
     278            
     279            $C$DW$T$23      .dwtag  DW_TAG_structure_type
     280                    .dwattr $C$DW$T$23, DW_AT_name("Comp_B_configureReferenceVoltageParam")
     281                    .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
     282            $C$DW$19        .dwtag  DW_TAG_member
     283                    .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$21)
     284                    .dwattr $C$DW$19, DW_AT_name("supplyVoltageReferenceBase")
     285                    .dwattr $C$DW$19, DW_AT_TI_symbol_name("supplyVoltageReferenceBase")
     286                    .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     287                    .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     288                    .dwattr $C$DW$19, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     289                    .dwattr $C$DW$19, DW_AT_decl_line(0x8e)
     290                    .dwattr $C$DW$19, DW_AT_decl_column(0x0e)
     291            
     292            $C$DW$20        .dwtag  DW_TAG_member
     293                    .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$21)
     294                    .dwattr $C$DW$20, DW_AT_name("lowerLimitSupplyVoltageFractionOf32")
     295                    .dwattr $C$DW$20, DW_AT_TI_symbol_name("lowerLimitSupplyVoltageFractionOf32")
     296                    .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     297                    .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     298                    .dwattr $C$DW$20, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     299                    .dwattr $C$DW$20, DW_AT_decl_line(0x91)
     300                    .dwattr $C$DW$20, DW_AT_decl_column(0x0e)
     301            
     302            $C$DW$21        .dwtag  DW_TAG_member
     303                    .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$21)
     304                    .dwattr $C$DW$21, DW_AT_name("upperLimitSupplyVoltageFractionOf32")
     305                    .dwattr $C$DW$21, DW_AT_TI_symbol_name("upperLimitSupplyVoltageFractionOf32")
     306                    .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     307                    .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     308                    .dwattr $C$DW$21, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     309                    .dwattr $C$DW$21, DW_AT_decl_line(0x94)
     310                    .dwattr $C$DW$21, DW_AT_decl_column(0x0e)
     311            
     312            $C$DW$22        .dwtag  DW_TAG_member
     313                    .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$21)
     314                    .dwattr $C$DW$22, DW_AT_name("referenceAccuracy")
     315                    .dwattr $C$DW$22, DW_AT_TI_symbol_name("referenceAccuracy")
     316                    .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     317                    .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     318                    .dwattr $C$DW$22, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     319                    .dwattr $C$DW$22, DW_AT_decl_line(0x9a)
     320                    .dwattr $C$DW$22, DW_AT_decl_column(0x0e)
     321            
     322                    .dwattr $C$DW$T$23, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     323                    .dwattr $C$DW$T$23, DW_AT_decl_line(0x85)
     324                    .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
     325                    .dwendtag $C$DW$T$23
     326            
     327            $C$DW$T$59      .dwtag  DW_TAG_typedef
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE    7

     328                    .dwattr $C$DW$T$59, DW_AT_name("Comp_B_configureReferenceVoltageParam")
     329                    .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$23)
     330                    .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
     331                    .dwattr $C$DW$T$59, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     332                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x9b)
     333                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x03)
     334            
     335            
     336            $C$DW$T$24      .dwtag  DW_TAG_structure_type
     337                    .dwattr $C$DW$T$24, DW_AT_name("Comp_B_initParam")
     338                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
     339            $C$DW$23        .dwtag  DW_TAG_member
     340                    .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     341                    .dwattr $C$DW$23, DW_AT_name("positiveTerminalInput")
     342                    .dwattr $C$DW$23, DW_AT_TI_symbol_name("positiveTerminalInput")
     343                    .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     344                    .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     345                    .dwattr $C$DW$23, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     346                    .dwattr $C$DW$23, DW_AT_decl_line(0x53)
     347                    .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
     348            
     349            $C$DW$24        .dwtag  DW_TAG_member
     350                    .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     351                    .dwattr $C$DW$24, DW_AT_name("negativeTerminalInput")
     352                    .dwattr $C$DW$24, DW_AT_TI_symbol_name("negativeTerminalInput")
     353                    .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     354                    .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     355                    .dwattr $C$DW$24, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     356                    .dwattr $C$DW$24, DW_AT_decl_line(0x67)
     357                    .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
     358            
     359            $C$DW$25        .dwtag  DW_TAG_member
     360                    .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$21)
     361                    .dwattr $C$DW$25, DW_AT_name("powerModeSelect")
     362                    .dwattr $C$DW$25, DW_AT_TI_symbol_name("powerModeSelect")
     363                    .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     364                    .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     365                    .dwattr $C$DW$25, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     366                    .dwattr $C$DW$25, DW_AT_decl_line(0x6d)
     367                    .dwattr $C$DW$25, DW_AT_decl_column(0x0e)
     368            
     369            $C$DW$26        .dwtag  DW_TAG_member
     370                    .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     371                    .dwattr $C$DW$26, DW_AT_name("outputFilterEnableAndDelayLevel")
     372                    .dwattr $C$DW$26, DW_AT_TI_symbol_name("outputFilterEnableAndDelayLevel")
     373                    .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     374                    .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     375                    .dwattr $C$DW$26, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     376                    .dwattr $C$DW$26, DW_AT_decl_line(0x77)
     377                    .dwattr $C$DW$26, DW_AT_decl_column(0x0d)
     378            
     379            $C$DW$27        .dwtag  DW_TAG_member
     380                    .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$21)
     381                    .dwattr $C$DW$27, DW_AT_name("invertedOutputPolarity")
     382                    .dwattr $C$DW$27, DW_AT_TI_symbol_name("invertedOutputPolarity")
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE    8

     383                    .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     384                    .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     385                    .dwattr $C$DW$27, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     386                    .dwattr $C$DW$27, DW_AT_decl_line(0x7c)
     387                    .dwattr $C$DW$27, DW_AT_decl_column(0x0e)
     388            
     389                    .dwattr $C$DW$T$24, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     390                    .dwattr $C$DW$T$24, DW_AT_decl_line(0x3e)
     391                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
     392                    .dwendtag $C$DW$T$24
     393            
     394            $C$DW$T$60      .dwtag  DW_TAG_typedef
     395                    .dwattr $C$DW$T$60, DW_AT_name("Comp_B_initParam")
     396                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$24)
     397                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
     398                    .dwattr $C$DW$T$60, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     399                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x7d)
     400                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
     401            
     402            
     403            $C$DW$T$25      .dwtag  DW_TAG_structure_type
     404                    .dwattr $C$DW$T$25, DW_AT_name("DMA_initParam")
     405                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x0a)
     406            $C$DW$28        .dwtag  DW_TAG_member
     407                    .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     408                    .dwattr $C$DW$28, DW_AT_name("channelSelect")
     409                    .dwattr $C$DW$28, DW_AT_TI_symbol_name("channelSelect")
     410                    .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     411                    .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     412                    .dwattr $C$DW$28, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     413                    .dwattr $C$DW$28, DW_AT_decl_line(0x4a)
     414                    .dwattr $C$DW$28, DW_AT_decl_column(0x0d)
     415            
     416            $C$DW$29        .dwtag  DW_TAG_member
     417                    .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$21)
     418                    .dwattr $C$DW$29, DW_AT_name("transferModeSelect")
     419                    .dwattr $C$DW$29, DW_AT_TI_symbol_name("transferModeSelect")
     420                    .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     421                    .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     422                    .dwattr $C$DW$29, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     423                    .dwattr $C$DW$29, DW_AT_decl_line(0x59)
     424                    .dwattr $C$DW$29, DW_AT_decl_column(0x0e)
     425            
     426            $C$DW$30        .dwtag  DW_TAG_member
     427                    .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$21)
     428                    .dwattr $C$DW$30, DW_AT_name("transferSize")
     429                    .dwattr $C$DW$30, DW_AT_TI_symbol_name("transferSize")
     430                    .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     431                    .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     432                    .dwattr $C$DW$30, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     433                    .dwattr $C$DW$30, DW_AT_decl_line(0x5d)
     434                    .dwattr $C$DW$30, DW_AT_decl_column(0x0e)
     435            
     436            $C$DW$31        .dwtag  DW_TAG_member
     437                    .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE    9

     438                    .dwattr $C$DW$31, DW_AT_name("triggerSourceSelect")
     439                    .dwattr $C$DW$31, DW_AT_TI_symbol_name("triggerSourceSelect")
     440                    .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     441                    .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     442                    .dwattr $C$DW$31, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     443                    .dwattr $C$DW$31, DW_AT_decl_line(0x81)
     444                    .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     445            
     446            $C$DW$32        .dwtag  DW_TAG_member
     447                    .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     448                    .dwattr $C$DW$32, DW_AT_name("transferUnitSelect")
     449                    .dwattr $C$DW$32, DW_AT_TI_symbol_name("transferUnitSelect")
     450                    .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     451                    .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     452                    .dwattr $C$DW$32, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     453                    .dwattr $C$DW$32, DW_AT_decl_line(0x88)
     454                    .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     455            
     456            $C$DW$33        .dwtag  DW_TAG_member
     457                    .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     458                    .dwattr $C$DW$33, DW_AT_name("triggerTypeSelect")
     459                    .dwattr $C$DW$33, DW_AT_TI_symbol_name("triggerTypeSelect")
     460                    .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     461                    .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     462                    .dwattr $C$DW$33, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     463                    .dwattr $C$DW$33, DW_AT_decl_line(0x90)
     464                    .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     465            
     466                    .dwattr $C$DW$T$25, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     467                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x3e)
     468                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
     469                    .dwendtag $C$DW$T$25
     470            
     471            $C$DW$T$61      .dwtag  DW_TAG_typedef
     472                    .dwattr $C$DW$T$61, DW_AT_name("DMA_initParam")
     473                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$25)
     474                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
     475                    .dwattr $C$DW$T$61, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     476                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x91)
     477                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
     478            
     479            
     480            $C$DW$T$29      .dwtag  DW_TAG_structure_type
     481                    .dwattr $C$DW$T$29, DW_AT_name("PMAP_initPortsParam")
     482                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x0a)
     483            $C$DW$34        .dwtag  DW_TAG_member
     484                    .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$27)
     485                    .dwattr $C$DW$34, DW_AT_name("portMapping")
     486                    .dwattr $C$DW$34, DW_AT_TI_symbol_name("portMapping")
     487                    .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     488                    .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     489                    .dwattr $C$DW$34, DW_AT_decl_file("..\MSP430F5xx_6xx\pmap.h")
     490                    .dwattr $C$DW$34, DW_AT_decl_line(0x41)
     491                    .dwattr $C$DW$34, DW_AT_decl_column(0x14)
     492            
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE   10

     493            $C$DW$35        .dwtag  DW_TAG_member
     494                    .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$28)
     495                    .dwattr $C$DW$35, DW_AT_name("PxMAPy")
     496                    .dwattr $C$DW$35, DW_AT_TI_symbol_name("PxMAPy")
     497                    .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     498                    .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     499                    .dwattr $C$DW$35, DW_AT_decl_file("..\MSP430F5xx_6xx\pmap.h")
     500                    .dwattr $C$DW$35, DW_AT_decl_line(0x43)
     501                    .dwattr $C$DW$35, DW_AT_decl_column(0x0e)
     502            
     503            $C$DW$36        .dwtag  DW_TAG_member
     504                    .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     505                    .dwattr $C$DW$36, DW_AT_name("numberOfPorts")
     506                    .dwattr $C$DW$36, DW_AT_TI_symbol_name("numberOfPorts")
     507                    .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     508                    .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     509                    .dwattr $C$DW$36, DW_AT_decl_file("..\MSP430F5xx_6xx\pmap.h")
     510                    .dwattr $C$DW$36, DW_AT_decl_line(0x45)
     511                    .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     512            
     513            $C$DW$37        .dwtag  DW_TAG_member
     514                    .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     515                    .dwattr $C$DW$37, DW_AT_name("portMapReconfigure")
     516                    .dwattr $C$DW$37, DW_AT_TI_symbol_name("portMapReconfigure")
     517                    .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     518                    .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     519                    .dwattr $C$DW$37, DW_AT_decl_file("..\MSP430F5xx_6xx\pmap.h")
     520                    .dwattr $C$DW$37, DW_AT_decl_line(0x4a)
     521                    .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     522            
     523                    .dwattr $C$DW$T$29, DW_AT_decl_file("..\MSP430F5xx_6xx\pmap.h")
     524                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x3e)
     525                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
     526                    .dwendtag $C$DW$T$29
     527            
     528            $C$DW$T$62      .dwtag  DW_TAG_typedef
     529                    .dwattr $C$DW$T$62, DW_AT_name("PMAP_initPortsParam")
     530                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$29)
     531                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
     532                    .dwattr $C$DW$T$62, DW_AT_decl_file("..\MSP430F5xx_6xx\pmap.h")
     533                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x4b)
     534                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
     535            
     536            
     537            $C$DW$T$30      .dwtag  DW_TAG_structure_type
     538                    .dwattr $C$DW$T$30, DW_AT_name("RTC_A_configureCalendarAlarmParam")
     539                    .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
     540            $C$DW$38        .dwtag  DW_TAG_member
     541                    .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     542                    .dwattr $C$DW$38, DW_AT_name("minutesAlarm")
     543                    .dwattr $C$DW$38, DW_AT_TI_symbol_name("minutesAlarm")
     544                    .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     545                    .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     546                    .dwattr $C$DW$38, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     547                    .dwattr $C$DW$38, DW_AT_decl_line(0x44)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE   11

     548                    .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     549            
     550            $C$DW$39        .dwtag  DW_TAG_member
     551                    .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     552                    .dwattr $C$DW$39, DW_AT_name("hoursAlarm")
     553                    .dwattr $C$DW$39, DW_AT_TI_symbol_name("hoursAlarm")
     554                    .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     555                    .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     556                    .dwattr $C$DW$39, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     557                    .dwattr $C$DW$39, DW_AT_decl_line(0x48)
     558                    .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     559            
     560            $C$DW$40        .dwtag  DW_TAG_member
     561                    .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     562                    .dwattr $C$DW$40, DW_AT_name("dayOfWeekAlarm")
     563                    .dwattr $C$DW$40, DW_AT_TI_symbol_name("dayOfWeekAlarm")
     564                    .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     565                    .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     566                    .dwattr $C$DW$40, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     567                    .dwattr $C$DW$40, DW_AT_decl_line(0x4c)
     568                    .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     569            
     570            $C$DW$41        .dwtag  DW_TAG_member
     571                    .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     572                    .dwattr $C$DW$41, DW_AT_name("dayOfMonthAlarm")
     573                    .dwattr $C$DW$41, DW_AT_TI_symbol_name("dayOfMonthAlarm")
     574                    .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     575                    .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     576                    .dwattr $C$DW$41, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     577                    .dwattr $C$DW$41, DW_AT_decl_line(0x50)
     578                    .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     579            
     580                    .dwattr $C$DW$T$30, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     581                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x3f)
     582                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
     583                    .dwendtag $C$DW$T$30
     584            
     585            $C$DW$T$63      .dwtag  DW_TAG_typedef
     586                    .dwattr $C$DW$T$63, DW_AT_name("RTC_A_configureCalendarAlarmParam")
     587                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$30)
     588                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
     589                    .dwattr $C$DW$T$63, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     590                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x51)
     591                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
     592            
     593            
     594            $C$DW$T$31      .dwtag  DW_TAG_structure_type
     595                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initCaptureModeParam")
     596                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0c)
     597            $C$DW$42        .dwtag  DW_TAG_member
     598                    .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$21)
     599                    .dwattr $C$DW$42, DW_AT_name("captureRegister")
     600                    .dwattr $C$DW$42, DW_AT_TI_symbol_name("captureRegister")
     601                    .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     602                    .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE   12

     603                    .dwattr $C$DW$42, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     604                    .dwattr $C$DW$42, DW_AT_decl_line(0x89)
     605                    .dwattr $C$DW$42, DW_AT_decl_column(0x0e)
     606            
     607            $C$DW$43        .dwtag  DW_TAG_member
     608                    .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$21)
     609                    .dwattr $C$DW$43, DW_AT_name("captureMode")
     610                    .dwattr $C$DW$43, DW_AT_TI_symbol_name("captureMode")
     611                    .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     612                    .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     613                    .dwattr $C$DW$43, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     614                    .dwattr $C$DW$43, DW_AT_decl_line(0x90)
     615                    .dwattr $C$DW$43, DW_AT_decl_column(0x0e)
     616            
     617            $C$DW$44        .dwtag  DW_TAG_member
     618                    .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$21)
     619                    .dwattr $C$DW$44, DW_AT_name("captureInputSelect")
     620                    .dwattr $C$DW$44, DW_AT_TI_symbol_name("captureInputSelect")
     621                    .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     622                    .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     623                    .dwattr $C$DW$44, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     624                    .dwattr $C$DW$44, DW_AT_decl_line(0x97)
     625                    .dwattr $C$DW$44, DW_AT_decl_column(0x0e)
     626            
     627            $C$DW$45        .dwtag  DW_TAG_member
     628                    .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$21)
     629                    .dwattr $C$DW$45, DW_AT_name("synchronizeCaptureSource")
     630                    .dwattr $C$DW$45, DW_AT_TI_symbol_name("synchronizeCaptureSource")
     631                    .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     632                    .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     633                    .dwattr $C$DW$45, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     634                    .dwattr $C$DW$45, DW_AT_decl_line(0x9c)
     635                    .dwattr $C$DW$45, DW_AT_decl_column(0x0e)
     636            
     637            $C$DW$46        .dwtag  DW_TAG_member
     638                    .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$21)
     639                    .dwattr $C$DW$46, DW_AT_name("captureInterruptEnable")
     640                    .dwattr $C$DW$46, DW_AT_TI_symbol_name("captureInterruptEnable")
     641                    .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     642                    .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     643                    .dwattr $C$DW$46, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     644                    .dwattr $C$DW$46, DW_AT_decl_line(0xa1)
     645                    .dwattr $C$DW$46, DW_AT_decl_column(0x0e)
     646            
     647            $C$DW$47        .dwtag  DW_TAG_member
     648                    .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$21)
     649                    .dwattr $C$DW$47, DW_AT_name("captureOutputMode")
     650                    .dwattr $C$DW$47, DW_AT_TI_symbol_name("captureOutputMode")
     651                    .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     652                    .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     653                    .dwattr $C$DW$47, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     654                    .dwattr $C$DW$47, DW_AT_decl_line(0xac)
     655                    .dwattr $C$DW$47, DW_AT_decl_column(0x0e)
     656            
     657                    .dwattr $C$DW$T$31, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE   13

     658                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x7d)
     659                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
     660                    .dwendtag $C$DW$T$31
     661            
     662            $C$DW$T$64      .dwtag  DW_TAG_typedef
     663                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCaptureModeParam")
     664                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$31)
     665                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
     666                    .dwattr $C$DW$T$64, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     667                    .dwattr $C$DW$T$64, DW_AT_decl_line(0xad)
     668                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
     669            
     670            
     671            $C$DW$T$32      .dwtag  DW_TAG_structure_type
     672                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initCompareModeParam")
     673                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x08)
     674            $C$DW$48        .dwtag  DW_TAG_member
     675                    .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$21)
     676                    .dwattr $C$DW$48, DW_AT_name("compareRegister")
     677                    .dwattr $C$DW$48, DW_AT_TI_symbol_name("compareRegister")
     678                    .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     679                    .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     680                    .dwattr $C$DW$48, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     681                    .dwattr $C$DW$48, DW_AT_decl_line(0x17a)
     682                    .dwattr $C$DW$48, DW_AT_decl_column(0x0e)
     683            
     684            $C$DW$49        .dwtag  DW_TAG_member
     685                    .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$21)
     686                    .dwattr $C$DW$49, DW_AT_name("compareInterruptEnable")
     687                    .dwattr $C$DW$49, DW_AT_TI_symbol_name("compareInterruptEnable")
     688                    .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     689                    .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     690                    .dwattr $C$DW$49, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     691                    .dwattr $C$DW$49, DW_AT_decl_line(0x17f)
     692                    .dwattr $C$DW$49, DW_AT_decl_column(0x0e)
     693            
     694            $C$DW$50        .dwtag  DW_TAG_member
     695                    .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$21)
     696                    .dwattr $C$DW$50, DW_AT_name("compareOutputMode")
     697                    .dwattr $C$DW$50, DW_AT_TI_symbol_name("compareOutputMode")
     698                    .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     699                    .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     700                    .dwattr $C$DW$50, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     701                    .dwattr $C$DW$50, DW_AT_decl_line(0x18a)
     702                    .dwattr $C$DW$50, DW_AT_decl_column(0x0e)
     703            
     704            $C$DW$51        .dwtag  DW_TAG_member
     705                    .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$21)
     706                    .dwattr $C$DW$51, DW_AT_name("compareValue")
     707                    .dwattr $C$DW$51, DW_AT_TI_symbol_name("compareValue")
     708                    .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     709                    .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     710                    .dwattr $C$DW$51, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     711                    .dwattr $C$DW$51, DW_AT_decl_line(0x18c)
     712                    .dwattr $C$DW$51, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE   14

     713            
     714                    .dwattr $C$DW$T$32, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     715                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x16e)
     716                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
     717                    .dwendtag $C$DW$T$32
     718            
     719            $C$DW$T$65      .dwtag  DW_TAG_typedef
     720                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initCompareModeParam")
     721                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$32)
     722                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
     723                    .dwattr $C$DW$T$65, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     724                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x18d)
     725                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
     726            
     727            
     728            $C$DW$T$34      .dwtag  DW_TAG_structure_type
     729                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_initContinuousModeParam")
     730                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
     731            $C$DW$52        .dwtag  DW_TAG_member
     732                    .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$21)
     733                    .dwattr $C$DW$52, DW_AT_name("clockSource")
     734                    .dwattr $C$DW$52, DW_AT_TI_symbol_name("clockSource")
     735                    .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     736                    .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     737                    .dwattr $C$DW$52, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     738                    .dwattr $C$DW$52, DW_AT_decl_line(0x50)
     739                    .dwattr $C$DW$52, DW_AT_decl_column(0x0e)
     740            
     741            $C$DW$53        .dwtag  DW_TAG_member
     742                    .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$21)
     743                    .dwattr $C$DW$53, DW_AT_name("clockSourceDivider")
     744                    .dwattr $C$DW$53, DW_AT_TI_symbol_name("clockSourceDivider")
     745                    .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     746                    .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     747                    .dwattr $C$DW$53, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     748                    .dwattr $C$DW$53, DW_AT_decl_line(0x67)
     749                    .dwattr $C$DW$53, DW_AT_decl_column(0x0e)
     750            
     751            $C$DW$54        .dwtag  DW_TAG_member
     752                    .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$21)
     753                    .dwattr $C$DW$54, DW_AT_name("timerInterruptEnable_TAIE")
     754                    .dwattr $C$DW$54, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
     755                    .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     756                    .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     757                    .dwattr $C$DW$54, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     758                    .dwattr $C$DW$54, DW_AT_decl_line(0x6c)
     759                    .dwattr $C$DW$54, DW_AT_decl_column(0x0e)
     760            
     761            $C$DW$55        .dwtag  DW_TAG_member
     762                    .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$21)
     763                    .dwattr $C$DW$55, DW_AT_name("timerClear")
     764                    .dwattr $C$DW$55, DW_AT_TI_symbol_name("timerClear")
     765                    .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     766                    .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     767                    .dwattr $C$DW$55, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE   15

     768                    .dwattr $C$DW$55, DW_AT_decl_line(0x72)
     769                    .dwattr $C$DW$55, DW_AT_decl_column(0x0e)
     770            
     771            $C$DW$56        .dwtag  DW_TAG_member
     772                    .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$33)
     773                    .dwattr $C$DW$56, DW_AT_name("startTimer")
     774                    .dwattr $C$DW$56, DW_AT_TI_symbol_name("startTimer")
     775                    .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     776                    .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     777                    .dwattr $C$DW$56, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     778                    .dwattr $C$DW$56, DW_AT_decl_line(0x74)
     779                    .dwattr $C$DW$56, DW_AT_decl_column(0x0a)
     780            
     781                    .dwattr $C$DW$T$34, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     782                    .dwattr $C$DW$T$34, DW_AT_decl_line(0x48)
     783                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
     784                    .dwendtag $C$DW$T$34
     785            
     786            $C$DW$T$66      .dwtag  DW_TAG_typedef
     787                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initContinuousModeParam")
     788                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$34)
     789                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
     790                    .dwattr $C$DW$T$66, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     791                    .dwattr $C$DW$T$66, DW_AT_decl_line(0x75)
     792                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
     793            
     794            
     795            $C$DW$T$35      .dwtag  DW_TAG_structure_type
     796                    .dwattr $C$DW$T$35, DW_AT_name("Timer_A_initUpDownModeParam")
     797                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0e)
     798            $C$DW$57        .dwtag  DW_TAG_member
     799                    .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$21)
     800                    .dwattr $C$DW$57, DW_AT_name("clockSource")
     801                    .dwattr $C$DW$57, DW_AT_TI_symbol_name("clockSource")
     802                    .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     803                    .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     804                    .dwattr $C$DW$57, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     805                    .dwattr $C$DW$57, DW_AT_decl_line(0xbd)
     806                    .dwattr $C$DW$57, DW_AT_decl_column(0x0e)
     807            
     808            $C$DW$58        .dwtag  DW_TAG_member
     809                    .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$21)
     810                    .dwattr $C$DW$58, DW_AT_name("clockSourceDivider")
     811                    .dwattr $C$DW$58, DW_AT_TI_symbol_name("clockSourceDivider")
     812                    .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     813                    .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     814                    .dwattr $C$DW$58, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     815                    .dwattr $C$DW$58, DW_AT_decl_line(0xd4)
     816                    .dwattr $C$DW$58, DW_AT_decl_column(0x0e)
     817            
     818            $C$DW$59        .dwtag  DW_TAG_member
     819                    .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$21)
     820                    .dwattr $C$DW$59, DW_AT_name("timerPeriod")
     821                    .dwattr $C$DW$59, DW_AT_TI_symbol_name("timerPeriod")
     822                    .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE   16

     823                    .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     824                    .dwattr $C$DW$59, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     825                    .dwattr $C$DW$59, DW_AT_decl_line(0xd6)
     826                    .dwattr $C$DW$59, DW_AT_decl_column(0x0e)
     827            
     828            $C$DW$60        .dwtag  DW_TAG_member
     829                    .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$21)
     830                    .dwattr $C$DW$60, DW_AT_name("timerInterruptEnable_TAIE")
     831                    .dwattr $C$DW$60, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
     832                    .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     833                    .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     834                    .dwattr $C$DW$60, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     835                    .dwattr $C$DW$60, DW_AT_decl_line(0xdb)
     836                    .dwattr $C$DW$60, DW_AT_decl_column(0x0e)
     837            
     838            $C$DW$61        .dwtag  DW_TAG_member
     839                    .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$21)
     840                    .dwattr $C$DW$61, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
     841                    .dwattr $C$DW$61, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
     842                    .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     843                    .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     844                    .dwattr $C$DW$61, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     845                    .dwattr $C$DW$61, DW_AT_decl_line(0xe0)
     846                    .dwattr $C$DW$61, DW_AT_decl_column(0x0e)
     847            
     848            $C$DW$62        .dwtag  DW_TAG_member
     849                    .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$21)
     850                    .dwattr $C$DW$62, DW_AT_name("timerClear")
     851                    .dwattr $C$DW$62, DW_AT_TI_symbol_name("timerClear")
     852                    .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     853                    .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     854                    .dwattr $C$DW$62, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     855                    .dwattr $C$DW$62, DW_AT_decl_line(0xe6)
     856                    .dwattr $C$DW$62, DW_AT_decl_column(0x0e)
     857            
     858            $C$DW$63        .dwtag  DW_TAG_member
     859                    .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$33)
     860                    .dwattr $C$DW$63, DW_AT_name("startTimer")
     861                    .dwattr $C$DW$63, DW_AT_TI_symbol_name("startTimer")
     862                    .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     863                    .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     864                    .dwattr $C$DW$63, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     865                    .dwattr $C$DW$63, DW_AT_decl_line(0xe8)
     866                    .dwattr $C$DW$63, DW_AT_decl_column(0x0a)
     867            
     868                    .dwattr $C$DW$T$35, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     869                    .dwattr $C$DW$T$35, DW_AT_decl_line(0xb5)
     870                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
     871                    .dwendtag $C$DW$T$35
     872            
     873            $C$DW$T$67      .dwtag  DW_TAG_typedef
     874                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpDownModeParam")
     875                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$35)
     876                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     877                    .dwattr $C$DW$T$67, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE   17

     878                    .dwattr $C$DW$T$67, DW_AT_decl_line(0xe9)
     879                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
     880            
     881            
     882            $C$DW$T$36      .dwtag  DW_TAG_structure_type
     883                    .dwattr $C$DW$T$36, DW_AT_name("Timer_A_initUpModeParam")
     884                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x0e)
     885            $C$DW$64        .dwtag  DW_TAG_member
     886                    .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$21)
     887                    .dwattr $C$DW$64, DW_AT_name("clockSource")
     888                    .dwattr $C$DW$64, DW_AT_TI_symbol_name("clockSource")
     889                    .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     890                    .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     891                    .dwattr $C$DW$64, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     892                    .dwattr $C$DW$64, DW_AT_decl_line(0x139)
     893                    .dwattr $C$DW$64, DW_AT_decl_column(0x0e)
     894            
     895            $C$DW$65        .dwtag  DW_TAG_member
     896                    .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$21)
     897                    .dwattr $C$DW$65, DW_AT_name("clockSourceDivider")
     898                    .dwattr $C$DW$65, DW_AT_TI_symbol_name("clockSourceDivider")
     899                    .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     900                    .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     901                    .dwattr $C$DW$65, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     902                    .dwattr $C$DW$65, DW_AT_decl_line(0x150)
     903                    .dwattr $C$DW$65, DW_AT_decl_column(0x0e)
     904            
     905            $C$DW$66        .dwtag  DW_TAG_member
     906                    .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$21)
     907                    .dwattr $C$DW$66, DW_AT_name("timerPeriod")
     908                    .dwattr $C$DW$66, DW_AT_TI_symbol_name("timerPeriod")
     909                    .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     910                    .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     911                    .dwattr $C$DW$66, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     912                    .dwattr $C$DW$66, DW_AT_decl_line(0x153)
     913                    .dwattr $C$DW$66, DW_AT_decl_column(0x0e)
     914            
     915            $C$DW$67        .dwtag  DW_TAG_member
     916                    .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$21)
     917                    .dwattr $C$DW$67, DW_AT_name("timerInterruptEnable_TAIE")
     918                    .dwattr $C$DW$67, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
     919                    .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     920                    .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     921                    .dwattr $C$DW$67, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     922                    .dwattr $C$DW$67, DW_AT_decl_line(0x158)
     923                    .dwattr $C$DW$67, DW_AT_decl_column(0x0e)
     924            
     925            $C$DW$68        .dwtag  DW_TAG_member
     926                    .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$21)
     927                    .dwattr $C$DW$68, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
     928                    .dwattr $C$DW$68, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
     929                    .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     930                    .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     931                    .dwattr $C$DW$68, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     932                    .dwattr $C$DW$68, DW_AT_decl_line(0x15d)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE   18

     933                    .dwattr $C$DW$68, DW_AT_decl_column(0x0e)
     934            
     935            $C$DW$69        .dwtag  DW_TAG_member
     936                    .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$21)
     937                    .dwattr $C$DW$69, DW_AT_name("timerClear")
     938                    .dwattr $C$DW$69, DW_AT_TI_symbol_name("timerClear")
     939                    .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     940                    .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     941                    .dwattr $C$DW$69, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     942                    .dwattr $C$DW$69, DW_AT_decl_line(0x163)
     943                    .dwattr $C$DW$69, DW_AT_decl_column(0x0e)
     944            
     945            $C$DW$70        .dwtag  DW_TAG_member
     946                    .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$33)
     947                    .dwattr $C$DW$70, DW_AT_name("startTimer")
     948                    .dwattr $C$DW$70, DW_AT_TI_symbol_name("startTimer")
     949                    .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     950                    .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     951                    .dwattr $C$DW$70, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     952                    .dwattr $C$DW$70, DW_AT_decl_line(0x165)
     953                    .dwattr $C$DW$70, DW_AT_decl_column(0x0a)
     954            
     955                    .dwattr $C$DW$T$36, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     956                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x131)
     957                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
     958                    .dwendtag $C$DW$T$36
     959            
     960            $C$DW$T$68      .dwtag  DW_TAG_typedef
     961                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_initUpModeParam")
     962                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$36)
     963                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
     964                    .dwattr $C$DW$T$68, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     965                    .dwattr $C$DW$T$68, DW_AT_decl_line(0x166)
     966                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
     967            
     968            
     969            $C$DW$T$37      .dwtag  DW_TAG_structure_type
     970                    .dwattr $C$DW$T$37, DW_AT_name("Timer_A_outputPWMParam")
     971                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0c)
     972            $C$DW$71        .dwtag  DW_TAG_member
     973                    .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$21)
     974                    .dwattr $C$DW$71, DW_AT_name("clockSource")
     975                    .dwattr $C$DW$71, DW_AT_TI_symbol_name("clockSource")
     976                    .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     977                    .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     978                    .dwattr $C$DW$71, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     979                    .dwattr $C$DW$71, DW_AT_decl_line(0xf8)
     980                    .dwattr $C$DW$71, DW_AT_decl_column(0x0e)
     981            
     982            $C$DW$72        .dwtag  DW_TAG_member
     983                    .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$21)
     984                    .dwattr $C$DW$72, DW_AT_name("clockSourceDivider")
     985                    .dwattr $C$DW$72, DW_AT_TI_symbol_name("clockSourceDivider")
     986                    .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     987                    .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE   19

     988                    .dwattr $C$DW$72, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     989                    .dwattr $C$DW$72, DW_AT_decl_line(0x10f)
     990                    .dwattr $C$DW$72, DW_AT_decl_column(0x0e)
     991            
     992            $C$DW$73        .dwtag  DW_TAG_member
     993                    .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$21)
     994                    .dwattr $C$DW$73, DW_AT_name("timerPeriod")
     995                    .dwattr $C$DW$73, DW_AT_TI_symbol_name("timerPeriod")
     996                    .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     997                    .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     998                    .dwattr $C$DW$73, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     999                    .dwattr $C$DW$73, DW_AT_decl_line(0x111)
    1000                    .dwattr $C$DW$73, DW_AT_decl_column(0x0e)
    1001            
    1002            $C$DW$74        .dwtag  DW_TAG_member
    1003                    .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
    1004                    .dwattr $C$DW$74, DW_AT_name("compareRegister")
    1005                    .dwattr $C$DW$74, DW_AT_TI_symbol_name("compareRegister")
    1006                    .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1007                    .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1008                    .dwattr $C$DW$74, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1009                    .dwattr $C$DW$74, DW_AT_decl_line(0x11c)
    1010                    .dwattr $C$DW$74, DW_AT_decl_column(0x0e)
    1011            
    1012            $C$DW$75        .dwtag  DW_TAG_member
    1013                    .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$21)
    1014                    .dwattr $C$DW$75, DW_AT_name("compareOutputMode")
    1015                    .dwattr $C$DW$75, DW_AT_TI_symbol_name("compareOutputMode")
    1016                    .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1017                    .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1018                    .dwattr $C$DW$75, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1019                    .dwattr $C$DW$75, DW_AT_decl_line(0x127)
    1020                    .dwattr $C$DW$75, DW_AT_decl_column(0x0e)
    1021            
    1022            $C$DW$76        .dwtag  DW_TAG_member
    1023                    .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$21)
    1024                    .dwattr $C$DW$76, DW_AT_name("dutyCycle")
    1025                    .dwattr $C$DW$76, DW_AT_TI_symbol_name("dutyCycle")
    1026                    .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1027                    .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1028                    .dwattr $C$DW$76, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1029                    .dwattr $C$DW$76, DW_AT_decl_line(0x129)
    1030                    .dwattr $C$DW$76, DW_AT_decl_column(0x0e)
    1031            
    1032                    .dwattr $C$DW$T$37, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1033                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xf0)
    1034                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    1035                    .dwendtag $C$DW$T$37
    1036            
    1037            $C$DW$T$69      .dwtag  DW_TAG_typedef
    1038                    .dwattr $C$DW$T$69, DW_AT_name("Timer_A_outputPWMParam")
    1039                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$37)
    1040                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1041                    .dwattr $C$DW$T$69, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1042                    .dwattr $C$DW$T$69, DW_AT_decl_line(0x12a)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE   20

    1043                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    1044            
    1045            
    1046            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1047                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initCaptureModeParam")
    1048                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0c)
    1049            $C$DW$77        .dwtag  DW_TAG_member
    1050                    .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$21)
    1051                    .dwattr $C$DW$77, DW_AT_name("captureRegister")
    1052                    .dwattr $C$DW$77, DW_AT_TI_symbol_name("captureRegister")
    1053                    .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1054                    .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1055                    .dwattr $C$DW$77, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1056                    .dwattr $C$DW$77, DW_AT_decl_line(0xd1)
    1057                    .dwattr $C$DW$77, DW_AT_decl_column(0x0e)
    1058            
    1059            $C$DW$78        .dwtag  DW_TAG_member
    1060                    .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$21)
    1061                    .dwattr $C$DW$78, DW_AT_name("captureMode")
    1062                    .dwattr $C$DW$78, DW_AT_TI_symbol_name("captureMode")
    1063                    .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1064                    .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1065                    .dwattr $C$DW$78, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1066                    .dwattr $C$DW$78, DW_AT_decl_line(0xd8)
    1067                    .dwattr $C$DW$78, DW_AT_decl_column(0x0e)
    1068            
    1069            $C$DW$79        .dwtag  DW_TAG_member
    1070                    .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$21)
    1071                    .dwattr $C$DW$79, DW_AT_name("captureInputSelect")
    1072                    .dwattr $C$DW$79, DW_AT_TI_symbol_name("captureInputSelect")
    1073                    .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1074                    .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1075                    .dwattr $C$DW$79, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1076                    .dwattr $C$DW$79, DW_AT_decl_line(0xdf)
    1077                    .dwattr $C$DW$79, DW_AT_decl_column(0x0e)
    1078            
    1079            $C$DW$80        .dwtag  DW_TAG_member
    1080                    .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$21)
    1081                    .dwattr $C$DW$80, DW_AT_name("synchronizeCaptureSource")
    1082                    .dwattr $C$DW$80, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    1083                    .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1084                    .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1085                    .dwattr $C$DW$80, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1086                    .dwattr $C$DW$80, DW_AT_decl_line(0xe4)
    1087                    .dwattr $C$DW$80, DW_AT_decl_column(0x0e)
    1088            
    1089            $C$DW$81        .dwtag  DW_TAG_member
    1090                    .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$21)
    1091                    .dwattr $C$DW$81, DW_AT_name("captureInterruptEnable")
    1092                    .dwattr $C$DW$81, DW_AT_TI_symbol_name("captureInterruptEnable")
    1093                    .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1094                    .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1095                    .dwattr $C$DW$81, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1096                    .dwattr $C$DW$81, DW_AT_decl_line(0xe9)
    1097                    .dwattr $C$DW$81, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE   21

    1098            
    1099            $C$DW$82        .dwtag  DW_TAG_member
    1100                    .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$21)
    1101                    .dwattr $C$DW$82, DW_AT_name("captureOutputMode")
    1102                    .dwattr $C$DW$82, DW_AT_TI_symbol_name("captureOutputMode")
    1103                    .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1104                    .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1105                    .dwattr $C$DW$82, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1106                    .dwattr $C$DW$82, DW_AT_decl_line(0xf4)
    1107                    .dwattr $C$DW$82, DW_AT_decl_column(0x0e)
    1108            
    1109                    .dwattr $C$DW$T$38, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1110                    .dwattr $C$DW$T$38, DW_AT_decl_line(0xc5)
    1111                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    1112                    .dwendtag $C$DW$T$38
    1113            
    1114            $C$DW$T$70      .dwtag  DW_TAG_typedef
    1115                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCaptureModeParam")
    1116                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$38)
    1117                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1118                    .dwattr $C$DW$T$70, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1119                    .dwattr $C$DW$T$70, DW_AT_decl_line(0xf5)
    1120                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    1121            
    1122            
    1123            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1124                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initCompareModeParam")
    1125                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    1126            $C$DW$83        .dwtag  DW_TAG_member
    1127                    .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
    1128                    .dwattr $C$DW$83, DW_AT_name("compareRegister")
    1129                    .dwattr $C$DW$83, DW_AT_TI_symbol_name("compareRegister")
    1130                    .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1131                    .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1132                    .dwattr $C$DW$83, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1133                    .dwattr $C$DW$83, DW_AT_decl_line(0x17a)
    1134                    .dwattr $C$DW$83, DW_AT_decl_column(0x0e)
    1135            
    1136            $C$DW$84        .dwtag  DW_TAG_member
    1137                    .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    1138                    .dwattr $C$DW$84, DW_AT_name("compareInterruptEnable")
    1139                    .dwattr $C$DW$84, DW_AT_TI_symbol_name("compareInterruptEnable")
    1140                    .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1141                    .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1142                    .dwattr $C$DW$84, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1143                    .dwattr $C$DW$84, DW_AT_decl_line(0x17f)
    1144                    .dwattr $C$DW$84, DW_AT_decl_column(0x0e)
    1145            
    1146            $C$DW$85        .dwtag  DW_TAG_member
    1147                    .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$21)
    1148                    .dwattr $C$DW$85, DW_AT_name("compareOutputMode")
    1149                    .dwattr $C$DW$85, DW_AT_TI_symbol_name("compareOutputMode")
    1150                    .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1151                    .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1152                    .dwattr $C$DW$85, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE   22

    1153                    .dwattr $C$DW$85, DW_AT_decl_line(0x18a)
    1154                    .dwattr $C$DW$85, DW_AT_decl_column(0x0e)
    1155            
    1156            $C$DW$86        .dwtag  DW_TAG_member
    1157                    .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
    1158                    .dwattr $C$DW$86, DW_AT_name("compareValue")
    1159                    .dwattr $C$DW$86, DW_AT_TI_symbol_name("compareValue")
    1160                    .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1161                    .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1162                    .dwattr $C$DW$86, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1163                    .dwattr $C$DW$86, DW_AT_decl_line(0x18c)
    1164                    .dwattr $C$DW$86, DW_AT_decl_column(0x0e)
    1165            
    1166                    .dwattr $C$DW$T$39, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1167                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x16e)
    1168                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    1169                    .dwendtag $C$DW$T$39
    1170            
    1171            $C$DW$T$71      .dwtag  DW_TAG_typedef
    1172                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initCompareModeParam")
    1173                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$39)
    1174                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1175                    .dwattr $C$DW$T$71, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1176                    .dwattr $C$DW$T$71, DW_AT_decl_line(0x18d)
    1177                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    1178            
    1179            
    1180            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1181                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_initContinuousModeParam")
    1182                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
    1183            $C$DW$87        .dwtag  DW_TAG_member
    1184                    .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$21)
    1185                    .dwattr $C$DW$87, DW_AT_name("clockSource")
    1186                    .dwattr $C$DW$87, DW_AT_TI_symbol_name("clockSource")
    1187                    .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1188                    .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1189                    .dwattr $C$DW$87, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1190                    .dwattr $C$DW$87, DW_AT_decl_line(0x105)
    1191                    .dwattr $C$DW$87, DW_AT_decl_column(0x0e)
    1192            
    1193            $C$DW$88        .dwtag  DW_TAG_member
    1194                    .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$21)
    1195                    .dwattr $C$DW$88, DW_AT_name("clockSourceDivider")
    1196                    .dwattr $C$DW$88, DW_AT_TI_symbol_name("clockSourceDivider")
    1197                    .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1198                    .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1199                    .dwattr $C$DW$88, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1200                    .dwattr $C$DW$88, DW_AT_decl_line(0x11c)
    1201                    .dwattr $C$DW$88, DW_AT_decl_column(0x0e)
    1202            
    1203            $C$DW$89        .dwtag  DW_TAG_member
    1204                    .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$21)
    1205                    .dwattr $C$DW$89, DW_AT_name("timerInterruptEnable_TBIE")
    1206                    .dwattr $C$DW$89, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    1207                    .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE   23

    1208                    .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1209                    .dwattr $C$DW$89, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1210                    .dwattr $C$DW$89, DW_AT_decl_line(0x121)
    1211                    .dwattr $C$DW$89, DW_AT_decl_column(0x0e)
    1212            
    1213            $C$DW$90        .dwtag  DW_TAG_member
    1214                    .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$21)
    1215                    .dwattr $C$DW$90, DW_AT_name("timerClear")
    1216                    .dwattr $C$DW$90, DW_AT_TI_symbol_name("timerClear")
    1217                    .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1218                    .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1219                    .dwattr $C$DW$90, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1220                    .dwattr $C$DW$90, DW_AT_decl_line(0x127)
    1221                    .dwattr $C$DW$90, DW_AT_decl_column(0x0e)
    1222            
    1223            $C$DW$91        .dwtag  DW_TAG_member
    1224                    .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$33)
    1225                    .dwattr $C$DW$91, DW_AT_name("startTimer")
    1226                    .dwattr $C$DW$91, DW_AT_TI_symbol_name("startTimer")
    1227                    .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1228                    .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1229                    .dwattr $C$DW$91, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1230                    .dwattr $C$DW$91, DW_AT_decl_line(0x129)
    1231                    .dwattr $C$DW$91, DW_AT_decl_column(0x0a)
    1232            
    1233                    .dwattr $C$DW$T$40, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1234                    .dwattr $C$DW$T$40, DW_AT_decl_line(0xfd)
    1235                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    1236                    .dwendtag $C$DW$T$40
    1237            
    1238            $C$DW$T$72      .dwtag  DW_TAG_typedef
    1239                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initContinuousModeParam")
    1240                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$40)
    1241                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1242                    .dwattr $C$DW$T$72, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1243                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x12a)
    1244                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    1245            
    1246            
    1247            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1248                    .dwattr $C$DW$T$41, DW_AT_name("Timer_B_initUpDownModeParam")
    1249                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0e)
    1250            $C$DW$92        .dwtag  DW_TAG_member
    1251                    .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$21)
    1252                    .dwattr $C$DW$92, DW_AT_name("clockSource")
    1253                    .dwattr $C$DW$92, DW_AT_TI_symbol_name("clockSource")
    1254                    .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1255                    .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1256                    .dwattr $C$DW$92, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1257                    .dwattr $C$DW$92, DW_AT_decl_line(0x13a)
    1258                    .dwattr $C$DW$92, DW_AT_decl_column(0x0e)
    1259            
    1260            $C$DW$93        .dwtag  DW_TAG_member
    1261                    .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$21)
    1262                    .dwattr $C$DW$93, DW_AT_name("clockSourceDivider")
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE   24

    1263                    .dwattr $C$DW$93, DW_AT_TI_symbol_name("clockSourceDivider")
    1264                    .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1265                    .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1266                    .dwattr $C$DW$93, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1267                    .dwattr $C$DW$93, DW_AT_decl_line(0x151)
    1268                    .dwattr $C$DW$93, DW_AT_decl_column(0x0e)
    1269            
    1270            $C$DW$94        .dwtag  DW_TAG_member
    1271                    .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$21)
    1272                    .dwattr $C$DW$94, DW_AT_name("timerPeriod")
    1273                    .dwattr $C$DW$94, DW_AT_TI_symbol_name("timerPeriod")
    1274                    .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1275                    .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1276                    .dwattr $C$DW$94, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1277                    .dwattr $C$DW$94, DW_AT_decl_line(0x153)
    1278                    .dwattr $C$DW$94, DW_AT_decl_column(0x0e)
    1279            
    1280            $C$DW$95        .dwtag  DW_TAG_member
    1281                    .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$21)
    1282                    .dwattr $C$DW$95, DW_AT_name("timerInterruptEnable_TBIE")
    1283                    .dwattr $C$DW$95, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    1284                    .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1285                    .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1286                    .dwattr $C$DW$95, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1287                    .dwattr $C$DW$95, DW_AT_decl_line(0x158)
    1288                    .dwattr $C$DW$95, DW_AT_decl_column(0x0e)
    1289            
    1290            $C$DW$96        .dwtag  DW_TAG_member
    1291                    .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$21)
    1292                    .dwattr $C$DW$96, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    1293                    .dwattr $C$DW$96, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    1294                    .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1295                    .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1296                    .dwattr $C$DW$96, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1297                    .dwattr $C$DW$96, DW_AT_decl_line(0x15d)
    1298                    .dwattr $C$DW$96, DW_AT_decl_column(0x0e)
    1299            
    1300            $C$DW$97        .dwtag  DW_TAG_member
    1301                    .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$21)
    1302                    .dwattr $C$DW$97, DW_AT_name("timerClear")
    1303                    .dwattr $C$DW$97, DW_AT_TI_symbol_name("timerClear")
    1304                    .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1305                    .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1306                    .dwattr $C$DW$97, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1307                    .dwattr $C$DW$97, DW_AT_decl_line(0x163)
    1308                    .dwattr $C$DW$97, DW_AT_decl_column(0x0e)
    1309            
    1310            $C$DW$98        .dwtag  DW_TAG_member
    1311                    .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$33)
    1312                    .dwattr $C$DW$98, DW_AT_name("startTimer")
    1313                    .dwattr $C$DW$98, DW_AT_TI_symbol_name("startTimer")
    1314                    .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1315                    .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1316                    .dwattr $C$DW$98, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1317                    .dwattr $C$DW$98, DW_AT_decl_line(0x165)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE   25

    1318                    .dwattr $C$DW$98, DW_AT_decl_column(0x0a)
    1319            
    1320                    .dwattr $C$DW$T$41, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1321                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x132)
    1322                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    1323                    .dwendtag $C$DW$T$41
    1324            
    1325            $C$DW$T$73      .dwtag  DW_TAG_typedef
    1326                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpDownModeParam")
    1327                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$41)
    1328                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1329                    .dwattr $C$DW$T$73, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1330                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x166)
    1331                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    1332            
    1333            
    1334            $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1335                    .dwattr $C$DW$T$42, DW_AT_name("Timer_B_initUpModeParam")
    1336                    .dwattr $C$DW$T$42, DW_AT_byte_size(0x0e)
    1337            $C$DW$99        .dwtag  DW_TAG_member
    1338                    .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$21)
    1339                    .dwattr $C$DW$99, DW_AT_name("clockSource")
    1340                    .dwattr $C$DW$99, DW_AT_TI_symbol_name("clockSource")
    1341                    .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1342                    .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1343                    .dwattr $C$DW$99, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1344                    .dwattr $C$DW$99, DW_AT_decl_line(0x90)
    1345                    .dwattr $C$DW$99, DW_AT_decl_column(0x0e)
    1346            
    1347            $C$DW$100       .dwtag  DW_TAG_member
    1348                    .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$21)
    1349                    .dwattr $C$DW$100, DW_AT_name("clockSourceDivider")
    1350                    .dwattr $C$DW$100, DW_AT_TI_symbol_name("clockSourceDivider")
    1351                    .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1352                    .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1353                    .dwattr $C$DW$100, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1354                    .dwattr $C$DW$100, DW_AT_decl_line(0xa7)
    1355                    .dwattr $C$DW$100, DW_AT_decl_column(0x0e)
    1356            
    1357            $C$DW$101       .dwtag  DW_TAG_member
    1358                    .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$21)
    1359                    .dwattr $C$DW$101, DW_AT_name("timerPeriod")
    1360                    .dwattr $C$DW$101, DW_AT_TI_symbol_name("timerPeriod")
    1361                    .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1362                    .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1363                    .dwattr $C$DW$101, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1364                    .dwattr $C$DW$101, DW_AT_decl_line(0xaa)
    1365                    .dwattr $C$DW$101, DW_AT_decl_column(0x0e)
    1366            
    1367            $C$DW$102       .dwtag  DW_TAG_member
    1368                    .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$21)
    1369                    .dwattr $C$DW$102, DW_AT_name("timerInterruptEnable_TBIE")
    1370                    .dwattr $C$DW$102, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    1371                    .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1372                    .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:32:59 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\036442                             PAGE   26

    1373                    .dwattr $C$DW$102, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1374                    .dwattr $C$DW$102, DW_AT_decl_line(0xaf)
    1375                    .dwattr $C$DW$102, DW_AT_decl_column(0x0e)
    1376            
