MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                       PC v15.12.3.LTS *
       3            ;* Date/Time created: Wed Oct 12 11:17:26 2016                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../initGpio.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 2003-2
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Programmeerimine\Code Composer WS\CardReader\src\Debug")
      12            
      13            $C$DW$1 .dwtag  DW_TAG_subprogram
      14                    .dwattr $C$DW$1, DW_AT_name("GPIO_setAsOutputPin")
      15                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("GPIO_setAsOutputPin")
      16                    .dwattr $C$DW$1, DW_AT_declaration

     274 000036 2407          JEQ       $C$L3                 ; [] |23| 
     275                                                      ; [] |23| 
     276            ;* --------------------------------------------------------------------------*
     277                    .dwpsn  file "../initGpio.c",line 26,column 8,is_stmt,isa 0
     278 000038 931A          CMP.W     #1,r10                ; [] |26| 
     279 00003a 2009          JNE       $C$L4                 ; [] |26| 
     280                                                      ; [] |26| 
     281            ;* --------------------------------------------------------------------------*
     282                    .dwpsn  file "../initGpio.c",line 27,column 4,is_stmt,isa 0
     283 00003c 08CC          MOVA      r8,r12                ; [] |27| 
     284 00003e 09CD          MOVA      r9,r13                ; [] |27| 
     285            $C$DW$32        .dwtag  DW_TAG_TI_branch
     286                    .dwattr $C$DW$32, DW_AT_low_pc(0x00)
     287                    .dwattr $C$DW$32, DW_AT_name("GPIO_setOutputHighOnPin")
     288                    .dwattr $C$DW$32, DW_AT_TI_call
     289            
     290 000040 13B0!         CALLA     #GPIO_setOutputHighOnPin ; [] |27| 
         000042 0000 
     291                                                      ; [] |27| 
     292 000044 3C04          JMP       $C$L4                 ; [] |27| 
     293                                                      ; [] |27| 
     294            ;* --------------------------------------------------------------------------*
     295 000046       $C$L3:    
     296                    .dwpsn  file "../initGpio.c",line 24,column 4,is_stmt,isa 0
     297 000046 08CC          MOVA      r8,r12                ; [] |24| 
     298 000048 09CD          MOVA      r9,r13                ; [] |24| 
     299            $C$DW$33        .dwtag  DW_TAG_TI_branch
     300                    .dwattr $C$DW$33, DW_AT_low_pc(0x00)
     301                    .dwattr $C$DW$33, DW_AT_name("GPIO_setOutputLowOnPin")
     302                    .dwattr $C$DW$33, DW_AT_TI_call
     303            
     304 00004a 13B0!         CALLA     #GPIO_setOutputLowOnPin ; [] |24| 
         00004c 0000 
     305                                                      ; [] |24| 
     306            ;* --------------------------------------------------------------------------*
     307 00004e       $C$L4:    
     308                    .dwpsn  file "../initGpio.c",line 30,column 1,is_stmt,isa 0
     309 00004e 1628          POPM.A    #3,r10                ; [] 
     310                    .dwcfi  restore_reg, 8
     311                    .dwcfi  restore_reg, 9
     312                    .dwcfi  restore_reg, 10
     313                    .dwcfi  cfa_offset, 4
     314            $C$DW$34        .dwtag  DW_TAG_TI_branch
     315                    .dwattr $C$DW$34, DW_AT_low_pc(0x00)
     316                    .dwattr $C$DW$34, DW_AT_TI_return
     317            
     318 000050 0110          RETA      ; [] 
     319                    ; [] 
     320                    .dwattr $C$DW$19, DW_AT_TI_end_file("../initGpio.c")
     321                    .dwattr $C$DW$19, DW_AT_TI_end_line(0x1e)
     322                    .dwattr $C$DW$19, DW_AT_TI_end_column(0x01)
     323                    .dwendentry
     324                    .dwendtag $C$DW$19
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE    7

     325            
     326            ;*****************************************************************************
     327            ;* UNDEFINED EXTERNAL REFERENCES                                             *
     328            ;*****************************************************************************
     329                    .global GPIO_setAsOutputPin
     330                    .global GPIO_setAsInputPin
     331                    .global GPIO_setOutputHighOnPin
     332                    .global GPIO_setOutputLowOnPin
     333                    .global GPIO_setAsInputPinWithPullDownResistor
     334                    .global GPIO_setAsInputPinWithPullUpResistor
     335            
     336            ;******************************************************************************
     337            ;* BUILD ATTRIBUTES                                                           *
     338            ;******************************************************************************
     339                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
     340                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000001111000000000
     341                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
     342                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
     343                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
     344                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
     345            
     346            ;******************************************************************************
     347            ;* TYPE INFORMATION                                                           *
     348            ;******************************************************************************
     349            
     350            $C$DW$T$20      .dwtag  DW_TAG_structure_type
     351                    .dwattr $C$DW$T$20, DW_AT_name("ADC12_A_configureMemoryParam")
     352                    .dwattr $C$DW$T$20, DW_AT_byte_size(0x05)
     353            $C$DW$35        .dwtag  DW_TAG_member
     354                    .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     355                    .dwattr $C$DW$35, DW_AT_name("memoryBufferControlIndex")
     356                    .dwattr $C$DW$35, DW_AT_TI_symbol_name("memoryBufferControlIndex")
     357                    .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     358                    .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     359                    .dwattr $C$DW$35, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
     360                    .dwattr $C$DW$35, DW_AT_decl_line(0x53)
     361                    .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     362            
     363            $C$DW$36        .dwtag  DW_TAG_member
     364                    .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     365                    .dwattr $C$DW$36, DW_AT_name("inputSourceSelect")
     366                    .dwattr $C$DW$36, DW_AT_TI_symbol_name("inputSourceSelect")
     367                    .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     368                    .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     369                    .dwattr $C$DW$36, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
     370                    .dwattr $C$DW$36, DW_AT_decl_line(0x67)
     371                    .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     372            
     373            $C$DW$37        .dwtag  DW_TAG_member
     374                    .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     375                    .dwattr $C$DW$37, DW_AT_name("positiveRefVoltageSourceSelect")
     376                    .dwattr $C$DW$37, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
     377                    .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     378                    .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     379                    .dwattr $C$DW$37, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE    8

     380                    .dwattr $C$DW$37, DW_AT_decl_line(0x6e)
     381                    .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     382            
     383            $C$DW$38        .dwtag  DW_TAG_member
     384                    .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     385                    .dwattr $C$DW$38, DW_AT_name("negativeRefVoltageSourceSelect")
     386                    .dwattr $C$DW$38, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
     387                    .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     388                    .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     389                    .dwattr $C$DW$38, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
     390                    .dwattr $C$DW$38, DW_AT_decl_line(0x74)
     391                    .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     392            
     393            $C$DW$39        .dwtag  DW_TAG_member
     394                    .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     395                    .dwattr $C$DW$39, DW_AT_name("endOfSequence")
     396                    .dwattr $C$DW$39, DW_AT_TI_symbol_name("endOfSequence")
     397                    .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     398                    .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     399                    .dwattr $C$DW$39, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
     400                    .dwattr $C$DW$39, DW_AT_decl_line(0x7d)
     401                    .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     402            
     403                    .dwattr $C$DW$T$20, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
     404                    .dwattr $C$DW$T$20, DW_AT_decl_line(0x3f)
     405                    .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
     406                    .dwendtag $C$DW$T$20
     407            
     408            $C$DW$T$57      .dwtag  DW_TAG_typedef
     409                    .dwattr $C$DW$T$57, DW_AT_name("ADC12_A_configureMemoryParam")
     410                    .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$20)
     411                    .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
     412                    .dwattr $C$DW$T$57, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
     413                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x7e)
     414                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x03)
     415            
     416            
     417            $C$DW$T$22      .dwtag  DW_TAG_structure_type
     418                    .dwattr $C$DW$T$22, DW_AT_name("Calendar")
     419                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
     420            $C$DW$40        .dwtag  DW_TAG_member
     421                    .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     422                    .dwattr $C$DW$40, DW_AT_name("Seconds")
     423                    .dwattr $C$DW$40, DW_AT_TI_symbol_name("Seconds")
     424                    .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     425                    .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     426                    .dwattr $C$DW$40, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     427                    .dwattr $C$DW$40, DW_AT_decl_line(0x5c)
     428                    .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     429            
     430            $C$DW$41        .dwtag  DW_TAG_member
     431                    .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     432                    .dwattr $C$DW$41, DW_AT_name("Minutes")
     433                    .dwattr $C$DW$41, DW_AT_TI_symbol_name("Minutes")
     434                    .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE    9

     435                    .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     436                    .dwattr $C$DW$41, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     437                    .dwattr $C$DW$41, DW_AT_decl_line(0x5e)
     438                    .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     439            
     440            $C$DW$42        .dwtag  DW_TAG_member
     441                    .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     442                    .dwattr $C$DW$42, DW_AT_name("Hours")
     443                    .dwattr $C$DW$42, DW_AT_TI_symbol_name("Hours")
     444                    .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     445                    .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     446                    .dwattr $C$DW$42, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     447                    .dwattr $C$DW$42, DW_AT_decl_line(0x60)
     448                    .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     449            
     450            $C$DW$43        .dwtag  DW_TAG_member
     451                    .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     452                    .dwattr $C$DW$43, DW_AT_name("DayOfWeek")
     453                    .dwattr $C$DW$43, DW_AT_TI_symbol_name("DayOfWeek")
     454                    .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     455                    .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     456                    .dwattr $C$DW$43, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     457                    .dwattr $C$DW$43, DW_AT_decl_line(0x62)
     458                    .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     459            
     460            $C$DW$44        .dwtag  DW_TAG_member
     461                    .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     462                    .dwattr $C$DW$44, DW_AT_name("DayOfMonth")
     463                    .dwattr $C$DW$44, DW_AT_TI_symbol_name("DayOfMonth")
     464                    .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     465                    .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     466                    .dwattr $C$DW$44, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     467                    .dwattr $C$DW$44, DW_AT_decl_line(0x64)
     468                    .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     469            
     470            $C$DW$45        .dwtag  DW_TAG_member
     471                    .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     472                    .dwattr $C$DW$45, DW_AT_name("Month")
     473                    .dwattr $C$DW$45, DW_AT_TI_symbol_name("Month")
     474                    .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     475                    .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     476                    .dwattr $C$DW$45, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     477                    .dwattr $C$DW$45, DW_AT_decl_line(0x66)
     478                    .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     479            
     480            $C$DW$46        .dwtag  DW_TAG_member
     481                    .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$21)
     482                    .dwattr $C$DW$46, DW_AT_name("Year")
     483                    .dwattr $C$DW$46, DW_AT_TI_symbol_name("Year")
     484                    .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     485                    .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     486                    .dwattr $C$DW$46, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     487                    .dwattr $C$DW$46, DW_AT_decl_line(0x68)
     488                    .dwattr $C$DW$46, DW_AT_decl_column(0x0e)
     489            
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   10

     490                    .dwattr $C$DW$T$22, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     491                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x59)
     492                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
     493                    .dwendtag $C$DW$T$22
     494            
     495            $C$DW$T$58      .dwtag  DW_TAG_typedef
     496                    .dwattr $C$DW$T$58, DW_AT_name("Calendar")
     497                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$22)
     498                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
     499                    .dwattr $C$DW$T$58, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     500                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x69)
     501                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
     502            
     503            
     504            $C$DW$T$23      .dwtag  DW_TAG_structure_type
     505                    .dwattr $C$DW$T$23, DW_AT_name("Comp_B_configureReferenceVoltageParam")
     506                    .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
     507            $C$DW$47        .dwtag  DW_TAG_member
     508                    .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$21)
     509                    .dwattr $C$DW$47, DW_AT_name("supplyVoltageReferenceBase")
     510                    .dwattr $C$DW$47, DW_AT_TI_symbol_name("supplyVoltageReferenceBase")
     511                    .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     512                    .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     513                    .dwattr $C$DW$47, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     514                    .dwattr $C$DW$47, DW_AT_decl_line(0x8e)
     515                    .dwattr $C$DW$47, DW_AT_decl_column(0x0e)
     516            
     517            $C$DW$48        .dwtag  DW_TAG_member
     518                    .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$21)
     519                    .dwattr $C$DW$48, DW_AT_name("lowerLimitSupplyVoltageFractionOf32")
     520                    .dwattr $C$DW$48, DW_AT_TI_symbol_name("lowerLimitSupplyVoltageFractionOf32")
     521                    .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     522                    .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     523                    .dwattr $C$DW$48, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     524                    .dwattr $C$DW$48, DW_AT_decl_line(0x91)
     525                    .dwattr $C$DW$48, DW_AT_decl_column(0x0e)
     526            
     527            $C$DW$49        .dwtag  DW_TAG_member
     528                    .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$21)
     529                    .dwattr $C$DW$49, DW_AT_name("upperLimitSupplyVoltageFractionOf32")
     530                    .dwattr $C$DW$49, DW_AT_TI_symbol_name("upperLimitSupplyVoltageFractionOf32")
     531                    .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     532                    .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     533                    .dwattr $C$DW$49, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     534                    .dwattr $C$DW$49, DW_AT_decl_line(0x94)
     535                    .dwattr $C$DW$49, DW_AT_decl_column(0x0e)
     536            
     537            $C$DW$50        .dwtag  DW_TAG_member
     538                    .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$21)
     539                    .dwattr $C$DW$50, DW_AT_name("referenceAccuracy")
     540                    .dwattr $C$DW$50, DW_AT_TI_symbol_name("referenceAccuracy")
     541                    .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     542                    .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     543                    .dwattr $C$DW$50, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     544                    .dwattr $C$DW$50, DW_AT_decl_line(0x9a)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   11

     545                    .dwattr $C$DW$50, DW_AT_decl_column(0x0e)
     546            
     547                    .dwattr $C$DW$T$23, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     548                    .dwattr $C$DW$T$23, DW_AT_decl_line(0x85)
     549                    .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
     550                    .dwendtag $C$DW$T$23
     551            
     552            $C$DW$T$59      .dwtag  DW_TAG_typedef
     553                    .dwattr $C$DW$T$59, DW_AT_name("Comp_B_configureReferenceVoltageParam")
     554                    .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$23)
     555                    .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
     556                    .dwattr $C$DW$T$59, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     557                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x9b)
     558                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x03)
     559            
     560            
     561            $C$DW$T$24      .dwtag  DW_TAG_structure_type
     562                    .dwattr $C$DW$T$24, DW_AT_name("Comp_B_initParam")
     563                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
     564            $C$DW$51        .dwtag  DW_TAG_member
     565                    .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     566                    .dwattr $C$DW$51, DW_AT_name("positiveTerminalInput")
     567                    .dwattr $C$DW$51, DW_AT_TI_symbol_name("positiveTerminalInput")
     568                    .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     569                    .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     570                    .dwattr $C$DW$51, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     571                    .dwattr $C$DW$51, DW_AT_decl_line(0x53)
     572                    .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     573            
     574            $C$DW$52        .dwtag  DW_TAG_member
     575                    .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     576                    .dwattr $C$DW$52, DW_AT_name("negativeTerminalInput")
     577                    .dwattr $C$DW$52, DW_AT_TI_symbol_name("negativeTerminalInput")
     578                    .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     579                    .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     580                    .dwattr $C$DW$52, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     581                    .dwattr $C$DW$52, DW_AT_decl_line(0x67)
     582                    .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     583            
     584            $C$DW$53        .dwtag  DW_TAG_member
     585                    .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$21)
     586                    .dwattr $C$DW$53, DW_AT_name("powerModeSelect")
     587                    .dwattr $C$DW$53, DW_AT_TI_symbol_name("powerModeSelect")
     588                    .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     589                    .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     590                    .dwattr $C$DW$53, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     591                    .dwattr $C$DW$53, DW_AT_decl_line(0x6d)
     592                    .dwattr $C$DW$53, DW_AT_decl_column(0x0e)
     593            
     594            $C$DW$54        .dwtag  DW_TAG_member
     595                    .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     596                    .dwattr $C$DW$54, DW_AT_name("outputFilterEnableAndDelayLevel")
     597                    .dwattr $C$DW$54, DW_AT_TI_symbol_name("outputFilterEnableAndDelayLevel")
     598                    .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     599                    .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   12

     600                    .dwattr $C$DW$54, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     601                    .dwattr $C$DW$54, DW_AT_decl_line(0x77)
     602                    .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
     603            
     604            $C$DW$55        .dwtag  DW_TAG_member
     605                    .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$21)
     606                    .dwattr $C$DW$55, DW_AT_name("invertedOutputPolarity")
     607                    .dwattr $C$DW$55, DW_AT_TI_symbol_name("invertedOutputPolarity")
     608                    .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     609                    .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     610                    .dwattr $C$DW$55, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     611                    .dwattr $C$DW$55, DW_AT_decl_line(0x7c)
     612                    .dwattr $C$DW$55, DW_AT_decl_column(0x0e)
     613            
     614                    .dwattr $C$DW$T$24, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     615                    .dwattr $C$DW$T$24, DW_AT_decl_line(0x3e)
     616                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
     617                    .dwendtag $C$DW$T$24
     618            
     619            $C$DW$T$60      .dwtag  DW_TAG_typedef
     620                    .dwattr $C$DW$T$60, DW_AT_name("Comp_B_initParam")
     621                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$24)
     622                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
     623                    .dwattr $C$DW$T$60, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     624                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x7d)
     625                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
     626            
     627            
     628            $C$DW$T$25      .dwtag  DW_TAG_structure_type
     629                    .dwattr $C$DW$T$25, DW_AT_name("DMA_initParam")
     630                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x0a)
     631            $C$DW$56        .dwtag  DW_TAG_member
     632                    .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     633                    .dwattr $C$DW$56, DW_AT_name("channelSelect")
     634                    .dwattr $C$DW$56, DW_AT_TI_symbol_name("channelSelect")
     635                    .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     636                    .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     637                    .dwattr $C$DW$56, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     638                    .dwattr $C$DW$56, DW_AT_decl_line(0x4a)
     639                    .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     640            
     641            $C$DW$57        .dwtag  DW_TAG_member
     642                    .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$21)
     643                    .dwattr $C$DW$57, DW_AT_name("transferModeSelect")
     644                    .dwattr $C$DW$57, DW_AT_TI_symbol_name("transferModeSelect")
     645                    .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     646                    .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     647                    .dwattr $C$DW$57, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     648                    .dwattr $C$DW$57, DW_AT_decl_line(0x59)
     649                    .dwattr $C$DW$57, DW_AT_decl_column(0x0e)
     650            
     651            $C$DW$58        .dwtag  DW_TAG_member
     652                    .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$21)
     653                    .dwattr $C$DW$58, DW_AT_name("transferSize")
     654                    .dwattr $C$DW$58, DW_AT_TI_symbol_name("transferSize")
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   13

     655                    .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     656                    .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     657                    .dwattr $C$DW$58, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     658                    .dwattr $C$DW$58, DW_AT_decl_line(0x5d)
     659                    .dwattr $C$DW$58, DW_AT_decl_column(0x0e)
     660            
     661            $C$DW$59        .dwtag  DW_TAG_member
     662                    .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     663                    .dwattr $C$DW$59, DW_AT_name("triggerSourceSelect")
     664                    .dwattr $C$DW$59, DW_AT_TI_symbol_name("triggerSourceSelect")
     665                    .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     666                    .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     667                    .dwattr $C$DW$59, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     668                    .dwattr $C$DW$59, DW_AT_decl_line(0x81)
     669                    .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     670            
     671            $C$DW$60        .dwtag  DW_TAG_member
     672                    .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     673                    .dwattr $C$DW$60, DW_AT_name("transferUnitSelect")
     674                    .dwattr $C$DW$60, DW_AT_TI_symbol_name("transferUnitSelect")
     675                    .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     676                    .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     677                    .dwattr $C$DW$60, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     678                    .dwattr $C$DW$60, DW_AT_decl_line(0x88)
     679                    .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     680            
     681            $C$DW$61        .dwtag  DW_TAG_member
     682                    .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     683                    .dwattr $C$DW$61, DW_AT_name("triggerTypeSelect")
     684                    .dwattr $C$DW$61, DW_AT_TI_symbol_name("triggerTypeSelect")
     685                    .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     686                    .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     687                    .dwattr $C$DW$61, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     688                    .dwattr $C$DW$61, DW_AT_decl_line(0x90)
     689                    .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     690            
     691                    .dwattr $C$DW$T$25, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     692                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x3e)
     693                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
     694                    .dwendtag $C$DW$T$25
     695            
     696            $C$DW$T$61      .dwtag  DW_TAG_typedef
     697                    .dwattr $C$DW$T$61, DW_AT_name("DMA_initParam")
     698                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$25)
     699                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
     700                    .dwattr $C$DW$T$61, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     701                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x91)
     702                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
     703            
     704            
     705            $C$DW$T$29      .dwtag  DW_TAG_structure_type
     706                    .dwattr $C$DW$T$29, DW_AT_name("PMAP_initPortsParam")
     707                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x0a)
     708            $C$DW$62        .dwtag  DW_TAG_member
     709                    .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   14

     710                    .dwattr $C$DW$62, DW_AT_name("portMapping")
     711                    .dwattr $C$DW$62, DW_AT_TI_symbol_name("portMapping")
     712                    .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     713                    .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     714                    .dwattr $C$DW$62, DW_AT_decl_file("..\MSP430F5xx_6xx\pmap.h")
     715                    .dwattr $C$DW$62, DW_AT_decl_line(0x41)
     716                    .dwattr $C$DW$62, DW_AT_decl_column(0x14)
     717            
     718            $C$DW$63        .dwtag  DW_TAG_member
     719                    .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$28)
     720                    .dwattr $C$DW$63, DW_AT_name("PxMAPy")
     721                    .dwattr $C$DW$63, DW_AT_TI_symbol_name("PxMAPy")
     722                    .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     723                    .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     724                    .dwattr $C$DW$63, DW_AT_decl_file("..\MSP430F5xx_6xx\pmap.h")
     725                    .dwattr $C$DW$63, DW_AT_decl_line(0x43)
     726                    .dwattr $C$DW$63, DW_AT_decl_column(0x0e)
     727            
     728            $C$DW$64        .dwtag  DW_TAG_member
     729                    .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     730                    .dwattr $C$DW$64, DW_AT_name("numberOfPorts")
     731                    .dwattr $C$DW$64, DW_AT_TI_symbol_name("numberOfPorts")
     732                    .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     733                    .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     734                    .dwattr $C$DW$64, DW_AT_decl_file("..\MSP430F5xx_6xx\pmap.h")
     735                    .dwattr $C$DW$64, DW_AT_decl_line(0x45)
     736                    .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     737            
     738            $C$DW$65        .dwtag  DW_TAG_member
     739                    .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     740                    .dwattr $C$DW$65, DW_AT_name("portMapReconfigure")
     741                    .dwattr $C$DW$65, DW_AT_TI_symbol_name("portMapReconfigure")
     742                    .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     743                    .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     744                    .dwattr $C$DW$65, DW_AT_decl_file("..\MSP430F5xx_6xx\pmap.h")
     745                    .dwattr $C$DW$65, DW_AT_decl_line(0x4a)
     746                    .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     747            
     748                    .dwattr $C$DW$T$29, DW_AT_decl_file("..\MSP430F5xx_6xx\pmap.h")
     749                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x3e)
     750                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
     751                    .dwendtag $C$DW$T$29
     752            
     753            $C$DW$T$62      .dwtag  DW_TAG_typedef
     754                    .dwattr $C$DW$T$62, DW_AT_name("PMAP_initPortsParam")
     755                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$29)
     756                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
     757                    .dwattr $C$DW$T$62, DW_AT_decl_file("..\MSP430F5xx_6xx\pmap.h")
     758                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x4b)
     759                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
     760            
     761            
     762            $C$DW$T$30      .dwtag  DW_TAG_structure_type
     763                    .dwattr $C$DW$T$30, DW_AT_name("RTC_A_configureCalendarAlarmParam")
     764                    .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   15

     765            $C$DW$66        .dwtag  DW_TAG_member
     766                    .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     767                    .dwattr $C$DW$66, DW_AT_name("minutesAlarm")
     768                    .dwattr $C$DW$66, DW_AT_TI_symbol_name("minutesAlarm")
     769                    .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     770                    .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     771                    .dwattr $C$DW$66, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     772                    .dwattr $C$DW$66, DW_AT_decl_line(0x44)
     773                    .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     774            
     775            $C$DW$67        .dwtag  DW_TAG_member
     776                    .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     777                    .dwattr $C$DW$67, DW_AT_name("hoursAlarm")
     778                    .dwattr $C$DW$67, DW_AT_TI_symbol_name("hoursAlarm")
     779                    .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     780                    .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     781                    .dwattr $C$DW$67, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     782                    .dwattr $C$DW$67, DW_AT_decl_line(0x48)
     783                    .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     784            
     785            $C$DW$68        .dwtag  DW_TAG_member
     786                    .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     787                    .dwattr $C$DW$68, DW_AT_name("dayOfWeekAlarm")
     788                    .dwattr $C$DW$68, DW_AT_TI_symbol_name("dayOfWeekAlarm")
     789                    .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     790                    .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     791                    .dwattr $C$DW$68, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     792                    .dwattr $C$DW$68, DW_AT_decl_line(0x4c)
     793                    .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     794            
     795            $C$DW$69        .dwtag  DW_TAG_member
     796                    .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     797                    .dwattr $C$DW$69, DW_AT_name("dayOfMonthAlarm")
     798                    .dwattr $C$DW$69, DW_AT_TI_symbol_name("dayOfMonthAlarm")
     799                    .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     800                    .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     801                    .dwattr $C$DW$69, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     802                    .dwattr $C$DW$69, DW_AT_decl_line(0x50)
     803                    .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     804            
     805                    .dwattr $C$DW$T$30, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     806                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x3f)
     807                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
     808                    .dwendtag $C$DW$T$30
     809            
     810            $C$DW$T$63      .dwtag  DW_TAG_typedef
     811                    .dwattr $C$DW$T$63, DW_AT_name("RTC_A_configureCalendarAlarmParam")
     812                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$30)
     813                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
     814                    .dwattr $C$DW$T$63, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     815                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x51)
     816                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
     817            
     818            
     819            $C$DW$T$31      .dwtag  DW_TAG_structure_type
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   16

     820                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initCaptureModeParam")
     821                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0c)
     822            $C$DW$70        .dwtag  DW_TAG_member
     823                    .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$21)
     824                    .dwattr $C$DW$70, DW_AT_name("captureRegister")
     825                    .dwattr $C$DW$70, DW_AT_TI_symbol_name("captureRegister")
     826                    .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     827                    .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     828                    .dwattr $C$DW$70, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     829                    .dwattr $C$DW$70, DW_AT_decl_line(0x89)
     830                    .dwattr $C$DW$70, DW_AT_decl_column(0x0e)
     831            
     832            $C$DW$71        .dwtag  DW_TAG_member
     833                    .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$21)
     834                    .dwattr $C$DW$71, DW_AT_name("captureMode")
     835                    .dwattr $C$DW$71, DW_AT_TI_symbol_name("captureMode")
     836                    .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     837                    .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     838                    .dwattr $C$DW$71, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     839                    .dwattr $C$DW$71, DW_AT_decl_line(0x90)
     840                    .dwattr $C$DW$71, DW_AT_decl_column(0x0e)
     841            
     842            $C$DW$72        .dwtag  DW_TAG_member
     843                    .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$21)
     844                    .dwattr $C$DW$72, DW_AT_name("captureInputSelect")
     845                    .dwattr $C$DW$72, DW_AT_TI_symbol_name("captureInputSelect")
     846                    .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     847                    .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     848                    .dwattr $C$DW$72, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     849                    .dwattr $C$DW$72, DW_AT_decl_line(0x97)
     850                    .dwattr $C$DW$72, DW_AT_decl_column(0x0e)
     851            
     852            $C$DW$73        .dwtag  DW_TAG_member
     853                    .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$21)
     854                    .dwattr $C$DW$73, DW_AT_name("synchronizeCaptureSource")
     855                    .dwattr $C$DW$73, DW_AT_TI_symbol_name("synchronizeCaptureSource")
     856                    .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     857                    .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     858                    .dwattr $C$DW$73, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     859                    .dwattr $C$DW$73, DW_AT_decl_line(0x9c)
     860                    .dwattr $C$DW$73, DW_AT_decl_column(0x0e)
     861            
     862            $C$DW$74        .dwtag  DW_TAG_member
     863                    .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
     864                    .dwattr $C$DW$74, DW_AT_name("captureInterruptEnable")
     865                    .dwattr $C$DW$74, DW_AT_TI_symbol_name("captureInterruptEnable")
     866                    .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     867                    .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     868                    .dwattr $C$DW$74, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     869                    .dwattr $C$DW$74, DW_AT_decl_line(0xa1)
     870                    .dwattr $C$DW$74, DW_AT_decl_column(0x0e)
     871            
     872            $C$DW$75        .dwtag  DW_TAG_member
     873                    .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$21)
     874                    .dwattr $C$DW$75, DW_AT_name("captureOutputMode")
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   17

     875                    .dwattr $C$DW$75, DW_AT_TI_symbol_name("captureOutputMode")
     876                    .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     877                    .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     878                    .dwattr $C$DW$75, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     879                    .dwattr $C$DW$75, DW_AT_decl_line(0xac)
     880                    .dwattr $C$DW$75, DW_AT_decl_column(0x0e)
     881            
     882                    .dwattr $C$DW$T$31, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     883                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x7d)
     884                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
     885                    .dwendtag $C$DW$T$31
     886            
     887            $C$DW$T$64      .dwtag  DW_TAG_typedef
     888                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCaptureModeParam")
     889                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$31)
     890                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
     891                    .dwattr $C$DW$T$64, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     892                    .dwattr $C$DW$T$64, DW_AT_decl_line(0xad)
     893                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
     894            
     895            
     896            $C$DW$T$32      .dwtag  DW_TAG_structure_type
     897                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initCompareModeParam")
     898                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x08)
     899            $C$DW$76        .dwtag  DW_TAG_member
     900                    .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$21)
     901                    .dwattr $C$DW$76, DW_AT_name("compareRegister")
     902                    .dwattr $C$DW$76, DW_AT_TI_symbol_name("compareRegister")
     903                    .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     904                    .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     905                    .dwattr $C$DW$76, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     906                    .dwattr $C$DW$76, DW_AT_decl_line(0x17a)
     907                    .dwattr $C$DW$76, DW_AT_decl_column(0x0e)
     908            
     909            $C$DW$77        .dwtag  DW_TAG_member
     910                    .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$21)
     911                    .dwattr $C$DW$77, DW_AT_name("compareInterruptEnable")
     912                    .dwattr $C$DW$77, DW_AT_TI_symbol_name("compareInterruptEnable")
     913                    .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     914                    .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     915                    .dwattr $C$DW$77, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     916                    .dwattr $C$DW$77, DW_AT_decl_line(0x17f)
     917                    .dwattr $C$DW$77, DW_AT_decl_column(0x0e)
     918            
     919            $C$DW$78        .dwtag  DW_TAG_member
     920                    .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$21)
     921                    .dwattr $C$DW$78, DW_AT_name("compareOutputMode")
     922                    .dwattr $C$DW$78, DW_AT_TI_symbol_name("compareOutputMode")
     923                    .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     924                    .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     925                    .dwattr $C$DW$78, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     926                    .dwattr $C$DW$78, DW_AT_decl_line(0x18a)
     927                    .dwattr $C$DW$78, DW_AT_decl_column(0x0e)
     928            
     929            $C$DW$79        .dwtag  DW_TAG_member
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   18

     930                    .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$21)
     931                    .dwattr $C$DW$79, DW_AT_name("compareValue")
     932                    .dwattr $C$DW$79, DW_AT_TI_symbol_name("compareValue")
     933                    .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     934                    .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     935                    .dwattr $C$DW$79, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     936                    .dwattr $C$DW$79, DW_AT_decl_line(0x18c)
     937                    .dwattr $C$DW$79, DW_AT_decl_column(0x0e)
     938            
     939                    .dwattr $C$DW$T$32, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     940                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x16e)
     941                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
     942                    .dwendtag $C$DW$T$32
     943            
     944            $C$DW$T$65      .dwtag  DW_TAG_typedef
     945                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initCompareModeParam")
     946                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$32)
     947                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
     948                    .dwattr $C$DW$T$65, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     949                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x18d)
     950                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
     951            
     952            
     953            $C$DW$T$34      .dwtag  DW_TAG_structure_type
     954                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_initContinuousModeParam")
     955                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
     956            $C$DW$80        .dwtag  DW_TAG_member
     957                    .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$21)
     958                    .dwattr $C$DW$80, DW_AT_name("clockSource")
     959                    .dwattr $C$DW$80, DW_AT_TI_symbol_name("clockSource")
     960                    .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     961                    .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     962                    .dwattr $C$DW$80, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     963                    .dwattr $C$DW$80, DW_AT_decl_line(0x50)
     964                    .dwattr $C$DW$80, DW_AT_decl_column(0x0e)
     965            
     966            $C$DW$81        .dwtag  DW_TAG_member
     967                    .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$21)
     968                    .dwattr $C$DW$81, DW_AT_name("clockSourceDivider")
     969                    .dwattr $C$DW$81, DW_AT_TI_symbol_name("clockSourceDivider")
     970                    .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     971                    .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     972                    .dwattr $C$DW$81, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     973                    .dwattr $C$DW$81, DW_AT_decl_line(0x67)
     974                    .dwattr $C$DW$81, DW_AT_decl_column(0x0e)
     975            
     976            $C$DW$82        .dwtag  DW_TAG_member
     977                    .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$21)
     978                    .dwattr $C$DW$82, DW_AT_name("timerInterruptEnable_TAIE")
     979                    .dwattr $C$DW$82, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
     980                    .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     981                    .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     982                    .dwattr $C$DW$82, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     983                    .dwattr $C$DW$82, DW_AT_decl_line(0x6c)
     984                    .dwattr $C$DW$82, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   19

     985            
     986            $C$DW$83        .dwtag  DW_TAG_member
     987                    .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
     988                    .dwattr $C$DW$83, DW_AT_name("timerClear")
     989                    .dwattr $C$DW$83, DW_AT_TI_symbol_name("timerClear")
     990                    .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     991                    .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     992                    .dwattr $C$DW$83, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     993                    .dwattr $C$DW$83, DW_AT_decl_line(0x72)
     994                    .dwattr $C$DW$83, DW_AT_decl_column(0x0e)
     995            
     996            $C$DW$84        .dwtag  DW_TAG_member
     997                    .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$33)
     998                    .dwattr $C$DW$84, DW_AT_name("startTimer")
     999                    .dwattr $C$DW$84, DW_AT_TI_symbol_name("startTimer")
    1000                    .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1001                    .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1002                    .dwattr $C$DW$84, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1003                    .dwattr $C$DW$84, DW_AT_decl_line(0x74)
    1004                    .dwattr $C$DW$84, DW_AT_decl_column(0x0a)
    1005            
    1006                    .dwattr $C$DW$T$34, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1007                    .dwattr $C$DW$T$34, DW_AT_decl_line(0x48)
    1008                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    1009                    .dwendtag $C$DW$T$34
    1010            
    1011            $C$DW$T$66      .dwtag  DW_TAG_typedef
    1012                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initContinuousModeParam")
    1013                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$34)
    1014                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    1015                    .dwattr $C$DW$T$66, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1016                    .dwattr $C$DW$T$66, DW_AT_decl_line(0x75)
    1017                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    1018            
    1019            
    1020            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1021                    .dwattr $C$DW$T$35, DW_AT_name("Timer_A_initUpDownModeParam")
    1022                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0e)
    1023            $C$DW$85        .dwtag  DW_TAG_member
    1024                    .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$21)
    1025                    .dwattr $C$DW$85, DW_AT_name("clockSource")
    1026                    .dwattr $C$DW$85, DW_AT_TI_symbol_name("clockSource")
    1027                    .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1028                    .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1029                    .dwattr $C$DW$85, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1030                    .dwattr $C$DW$85, DW_AT_decl_line(0xbd)
    1031                    .dwattr $C$DW$85, DW_AT_decl_column(0x0e)
    1032            
    1033            $C$DW$86        .dwtag  DW_TAG_member
    1034                    .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
    1035                    .dwattr $C$DW$86, DW_AT_name("clockSourceDivider")
    1036                    .dwattr $C$DW$86, DW_AT_TI_symbol_name("clockSourceDivider")
    1037                    .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1038                    .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1039                    .dwattr $C$DW$86, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   20

    1040                    .dwattr $C$DW$86, DW_AT_decl_line(0xd4)
    1041                    .dwattr $C$DW$86, DW_AT_decl_column(0x0e)
    1042            
    1043            $C$DW$87        .dwtag  DW_TAG_member
    1044                    .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$21)
    1045                    .dwattr $C$DW$87, DW_AT_name("timerPeriod")
    1046                    .dwattr $C$DW$87, DW_AT_TI_symbol_name("timerPeriod")
    1047                    .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1048                    .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1049                    .dwattr $C$DW$87, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1050                    .dwattr $C$DW$87, DW_AT_decl_line(0xd6)
    1051                    .dwattr $C$DW$87, DW_AT_decl_column(0x0e)
    1052            
    1053            $C$DW$88        .dwtag  DW_TAG_member
    1054                    .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$21)
    1055                    .dwattr $C$DW$88, DW_AT_name("timerInterruptEnable_TAIE")
    1056                    .dwattr $C$DW$88, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    1057                    .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1058                    .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1059                    .dwattr $C$DW$88, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1060                    .dwattr $C$DW$88, DW_AT_decl_line(0xdb)
    1061                    .dwattr $C$DW$88, DW_AT_decl_column(0x0e)
    1062            
    1063            $C$DW$89        .dwtag  DW_TAG_member
    1064                    .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$21)
    1065                    .dwattr $C$DW$89, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    1066                    .dwattr $C$DW$89, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    1067                    .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1068                    .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1069                    .dwattr $C$DW$89, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1070                    .dwattr $C$DW$89, DW_AT_decl_line(0xe0)
    1071                    .dwattr $C$DW$89, DW_AT_decl_column(0x0e)
    1072            
    1073            $C$DW$90        .dwtag  DW_TAG_member
    1074                    .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$21)
    1075                    .dwattr $C$DW$90, DW_AT_name("timerClear")
    1076                    .dwattr $C$DW$90, DW_AT_TI_symbol_name("timerClear")
    1077                    .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1078                    .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1079                    .dwattr $C$DW$90, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1080                    .dwattr $C$DW$90, DW_AT_decl_line(0xe6)
    1081                    .dwattr $C$DW$90, DW_AT_decl_column(0x0e)
    1082            
    1083            $C$DW$91        .dwtag  DW_TAG_member
    1084                    .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$33)
    1085                    .dwattr $C$DW$91, DW_AT_name("startTimer")
    1086                    .dwattr $C$DW$91, DW_AT_TI_symbol_name("startTimer")
    1087                    .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1088                    .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1089                    .dwattr $C$DW$91, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1090                    .dwattr $C$DW$91, DW_AT_decl_line(0xe8)
    1091                    .dwattr $C$DW$91, DW_AT_decl_column(0x0a)
    1092            
    1093                    .dwattr $C$DW$T$35, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1094                    .dwattr $C$DW$T$35, DW_AT_decl_line(0xb5)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   21

    1095                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1096                    .dwendtag $C$DW$T$35
    1097            
    1098            $C$DW$T$67      .dwtag  DW_TAG_typedef
    1099                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpDownModeParam")
    1100                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$35)
    1101                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    1102                    .dwattr $C$DW$T$67, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1103                    .dwattr $C$DW$T$67, DW_AT_decl_line(0xe9)
    1104                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
    1105            
    1106            
    1107            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1108                    .dwattr $C$DW$T$36, DW_AT_name("Timer_A_initUpModeParam")
    1109                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x0e)
    1110            $C$DW$92        .dwtag  DW_TAG_member
    1111                    .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$21)
    1112                    .dwattr $C$DW$92, DW_AT_name("clockSource")
    1113                    .dwattr $C$DW$92, DW_AT_TI_symbol_name("clockSource")
    1114                    .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1115                    .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1116                    .dwattr $C$DW$92, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1117                    .dwattr $C$DW$92, DW_AT_decl_line(0x139)
    1118                    .dwattr $C$DW$92, DW_AT_decl_column(0x0e)
    1119            
    1120            $C$DW$93        .dwtag  DW_TAG_member
    1121                    .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$21)
    1122                    .dwattr $C$DW$93, DW_AT_name("clockSourceDivider")
    1123                    .dwattr $C$DW$93, DW_AT_TI_symbol_name("clockSourceDivider")
    1124                    .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1125                    .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1126                    .dwattr $C$DW$93, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1127                    .dwattr $C$DW$93, DW_AT_decl_line(0x150)
    1128                    .dwattr $C$DW$93, DW_AT_decl_column(0x0e)
    1129            
    1130            $C$DW$94        .dwtag  DW_TAG_member
    1131                    .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$21)
    1132                    .dwattr $C$DW$94, DW_AT_name("timerPeriod")
    1133                    .dwattr $C$DW$94, DW_AT_TI_symbol_name("timerPeriod")
    1134                    .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1135                    .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1136                    .dwattr $C$DW$94, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1137                    .dwattr $C$DW$94, DW_AT_decl_line(0x153)
    1138                    .dwattr $C$DW$94, DW_AT_decl_column(0x0e)
    1139            
    1140            $C$DW$95        .dwtag  DW_TAG_member
    1141                    .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$21)
    1142                    .dwattr $C$DW$95, DW_AT_name("timerInterruptEnable_TAIE")
    1143                    .dwattr $C$DW$95, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    1144                    .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1145                    .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1146                    .dwattr $C$DW$95, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1147                    .dwattr $C$DW$95, DW_AT_decl_line(0x158)
    1148                    .dwattr $C$DW$95, DW_AT_decl_column(0x0e)
    1149            
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   22

    1150            $C$DW$96        .dwtag  DW_TAG_member
    1151                    .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$21)
    1152                    .dwattr $C$DW$96, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    1153                    .dwattr $C$DW$96, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    1154                    .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1155                    .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1156                    .dwattr $C$DW$96, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1157                    .dwattr $C$DW$96, DW_AT_decl_line(0x15d)
    1158                    .dwattr $C$DW$96, DW_AT_decl_column(0x0e)
    1159            
    1160            $C$DW$97        .dwtag  DW_TAG_member
    1161                    .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$21)
    1162                    .dwattr $C$DW$97, DW_AT_name("timerClear")
    1163                    .dwattr $C$DW$97, DW_AT_TI_symbol_name("timerClear")
    1164                    .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1165                    .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1166                    .dwattr $C$DW$97, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1167                    .dwattr $C$DW$97, DW_AT_decl_line(0x163)
    1168                    .dwattr $C$DW$97, DW_AT_decl_column(0x0e)
    1169            
    1170            $C$DW$98        .dwtag  DW_TAG_member
    1171                    .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$33)
    1172                    .dwattr $C$DW$98, DW_AT_name("startTimer")
    1173                    .dwattr $C$DW$98, DW_AT_TI_symbol_name("startTimer")
    1174                    .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1175                    .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1176                    .dwattr $C$DW$98, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1177                    .dwattr $C$DW$98, DW_AT_decl_line(0x165)
    1178                    .dwattr $C$DW$98, DW_AT_decl_column(0x0a)
    1179            
    1180                    .dwattr $C$DW$T$36, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1181                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x131)
    1182                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    1183                    .dwendtag $C$DW$T$36
    1184            
    1185            $C$DW$T$68      .dwtag  DW_TAG_typedef
    1186                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_initUpModeParam")
    1187                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$36)
    1188                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1189                    .dwattr $C$DW$T$68, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1190                    .dwattr $C$DW$T$68, DW_AT_decl_line(0x166)
    1191                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    1192            
    1193            
    1194            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1195                    .dwattr $C$DW$T$37, DW_AT_name("Timer_A_outputPWMParam")
    1196                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0c)
    1197            $C$DW$99        .dwtag  DW_TAG_member
    1198                    .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$21)
    1199                    .dwattr $C$DW$99, DW_AT_name("clockSource")
    1200                    .dwattr $C$DW$99, DW_AT_TI_symbol_name("clockSource")
    1201                    .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1202                    .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1203                    .dwattr $C$DW$99, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1204                    .dwattr $C$DW$99, DW_AT_decl_line(0xf8)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   23

    1205                    .dwattr $C$DW$99, DW_AT_decl_column(0x0e)
    1206            
    1207            $C$DW$100       .dwtag  DW_TAG_member
    1208                    .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$21)
    1209                    .dwattr $C$DW$100, DW_AT_name("clockSourceDivider")
    1210                    .dwattr $C$DW$100, DW_AT_TI_symbol_name("clockSourceDivider")
    1211                    .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1212                    .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1213                    .dwattr $C$DW$100, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1214                    .dwattr $C$DW$100, DW_AT_decl_line(0x10f)
    1215                    .dwattr $C$DW$100, DW_AT_decl_column(0x0e)
    1216            
    1217            $C$DW$101       .dwtag  DW_TAG_member
    1218                    .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$21)
    1219                    .dwattr $C$DW$101, DW_AT_name("timerPeriod")
    1220                    .dwattr $C$DW$101, DW_AT_TI_symbol_name("timerPeriod")
    1221                    .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1222                    .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1223                    .dwattr $C$DW$101, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1224                    .dwattr $C$DW$101, DW_AT_decl_line(0x111)
    1225                    .dwattr $C$DW$101, DW_AT_decl_column(0x0e)
    1226            
    1227            $C$DW$102       .dwtag  DW_TAG_member
    1228                    .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$21)
    1229                    .dwattr $C$DW$102, DW_AT_name("compareRegister")
    1230                    .dwattr $C$DW$102, DW_AT_TI_symbol_name("compareRegister")
    1231                    .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1232                    .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1233                    .dwattr $C$DW$102, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1234                    .dwattr $C$DW$102, DW_AT_decl_line(0x11c)
    1235                    .dwattr $C$DW$102, DW_AT_decl_column(0x0e)
    1236            
    1237            $C$DW$103       .dwtag  DW_TAG_member
    1238                    .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$21)
    1239                    .dwattr $C$DW$103, DW_AT_name("compareOutputMode")
    1240                    .dwattr $C$DW$103, DW_AT_TI_symbol_name("compareOutputMode")
    1241                    .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1242                    .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1243                    .dwattr $C$DW$103, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1244                    .dwattr $C$DW$103, DW_AT_decl_line(0x127)
    1245                    .dwattr $C$DW$103, DW_AT_decl_column(0x0e)
    1246            
    1247            $C$DW$104       .dwtag  DW_TAG_member
    1248                    .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$21)
    1249                    .dwattr $C$DW$104, DW_AT_name("dutyCycle")
    1250                    .dwattr $C$DW$104, DW_AT_TI_symbol_name("dutyCycle")
    1251                    .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1252                    .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1253                    .dwattr $C$DW$104, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1254                    .dwattr $C$DW$104, DW_AT_decl_line(0x129)
    1255                    .dwattr $C$DW$104, DW_AT_decl_column(0x0e)
    1256            
    1257                    .dwattr $C$DW$T$37, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1258                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xf0)
    1259                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   24

    1260                    .dwendtag $C$DW$T$37
    1261            
    1262            $C$DW$T$69      .dwtag  DW_TAG_typedef
    1263                    .dwattr $C$DW$T$69, DW_AT_name("Timer_A_outputPWMParam")
    1264                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$37)
    1265                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1266                    .dwattr $C$DW$T$69, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1267                    .dwattr $C$DW$T$69, DW_AT_decl_line(0x12a)
    1268                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    1269            
    1270            
    1271            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1272                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initCaptureModeParam")
    1273                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0c)
    1274            $C$DW$105       .dwtag  DW_TAG_member
    1275                    .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$21)
    1276                    .dwattr $C$DW$105, DW_AT_name("captureRegister")
    1277                    .dwattr $C$DW$105, DW_AT_TI_symbol_name("captureRegister")
    1278                    .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1279                    .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1280                    .dwattr $C$DW$105, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1281                    .dwattr $C$DW$105, DW_AT_decl_line(0xd1)
    1282                    .dwattr $C$DW$105, DW_AT_decl_column(0x0e)
    1283            
    1284            $C$DW$106       .dwtag  DW_TAG_member
    1285                    .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$21)
    1286                    .dwattr $C$DW$106, DW_AT_name("captureMode")
    1287                    .dwattr $C$DW$106, DW_AT_TI_symbol_name("captureMode")
    1288                    .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1289                    .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1290                    .dwattr $C$DW$106, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1291                    .dwattr $C$DW$106, DW_AT_decl_line(0xd8)
    1292                    .dwattr $C$DW$106, DW_AT_decl_column(0x0e)
    1293            
    1294            $C$DW$107       .dwtag  DW_TAG_member
    1295                    .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$21)
    1296                    .dwattr $C$DW$107, DW_AT_name("captureInputSelect")
    1297                    .dwattr $C$DW$107, DW_AT_TI_symbol_name("captureInputSelect")
    1298                    .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1299                    .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1300                    .dwattr $C$DW$107, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1301                    .dwattr $C$DW$107, DW_AT_decl_line(0xdf)
    1302                    .dwattr $C$DW$107, DW_AT_decl_column(0x0e)
    1303            
    1304            $C$DW$108       .dwtag  DW_TAG_member
    1305                    .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$21)
    1306                    .dwattr $C$DW$108, DW_AT_name("synchronizeCaptureSource")
    1307                    .dwattr $C$DW$108, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    1308                    .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1309                    .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1310                    .dwattr $C$DW$108, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1311                    .dwattr $C$DW$108, DW_AT_decl_line(0xe4)
    1312                    .dwattr $C$DW$108, DW_AT_decl_column(0x0e)
    1313            
    1314            $C$DW$109       .dwtag  DW_TAG_member
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   25

    1315                    .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$21)
    1316                    .dwattr $C$DW$109, DW_AT_name("captureInterruptEnable")
    1317                    .dwattr $C$DW$109, DW_AT_TI_symbol_name("captureInterruptEnable")
    1318                    .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1319                    .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1320                    .dwattr $C$DW$109, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1321                    .dwattr $C$DW$109, DW_AT_decl_line(0xe9)
    1322                    .dwattr $C$DW$109, DW_AT_decl_column(0x0e)
    1323            
    1324            $C$DW$110       .dwtag  DW_TAG_member
    1325                    .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$21)
    1326                    .dwattr $C$DW$110, DW_AT_name("captureOutputMode")
    1327                    .dwattr $C$DW$110, DW_AT_TI_symbol_name("captureOutputMode")
    1328                    .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1329                    .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1330                    .dwattr $C$DW$110, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1331                    .dwattr $C$DW$110, DW_AT_decl_line(0xf4)
    1332                    .dwattr $C$DW$110, DW_AT_decl_column(0x0e)
    1333            
    1334                    .dwattr $C$DW$T$38, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1335                    .dwattr $C$DW$T$38, DW_AT_decl_line(0xc5)
    1336                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    1337                    .dwendtag $C$DW$T$38
    1338            
    1339            $C$DW$T$70      .dwtag  DW_TAG_typedef
    1340                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCaptureModeParam")
    1341                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$38)
    1342                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1343                    .dwattr $C$DW$T$70, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1344                    .dwattr $C$DW$T$70, DW_AT_decl_line(0xf5)
    1345                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    1346            
    1347            
    1348            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1349                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initCompareModeParam")
    1350                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    1351            $C$DW$111       .dwtag  DW_TAG_member
    1352                    .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$21)
    1353                    .dwattr $C$DW$111, DW_AT_name("compareRegister")
    1354                    .dwattr $C$DW$111, DW_AT_TI_symbol_name("compareRegister")
    1355                    .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1356                    .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1357                    .dwattr $C$DW$111, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1358                    .dwattr $C$DW$111, DW_AT_decl_line(0x17a)
    1359                    .dwattr $C$DW$111, DW_AT_decl_column(0x0e)
    1360            
    1361            $C$DW$112       .dwtag  DW_TAG_member
    1362                    .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$21)
    1363                    .dwattr $C$DW$112, DW_AT_name("compareInterruptEnable")
    1364                    .dwattr $C$DW$112, DW_AT_TI_symbol_name("compareInterruptEnable")
    1365                    .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1366                    .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1367                    .dwattr $C$DW$112, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1368                    .dwattr $C$DW$112, DW_AT_decl_line(0x17f)
    1369                    .dwattr $C$DW$112, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   26

    1370            
    1371            $C$DW$113       .dwtag  DW_TAG_member
    1372                    .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$21)
    1373                    .dwattr $C$DW$113, DW_AT_name("compareOutputMode")
    1374                    .dwattr $C$DW$113, DW_AT_TI_symbol_name("compareOutputMode")
    1375                    .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1376                    .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1377                    .dwattr $C$DW$113, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1378                    .dwattr $C$DW$113, DW_AT_decl_line(0x18a)
    1379                    .dwattr $C$DW$113, DW_AT_decl_column(0x0e)
    1380            
    1381            $C$DW$114       .dwtag  DW_TAG_member
    1382                    .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$21)
    1383                    .dwattr $C$DW$114, DW_AT_name("compareValue")
    1384                    .dwattr $C$DW$114, DW_AT_TI_symbol_name("compareValue")
    1385                    .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1386                    .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1387                    .dwattr $C$DW$114, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1388                    .dwattr $C$DW$114, DW_AT_decl_line(0x18c)
    1389                    .dwattr $C$DW$114, DW_AT_decl_column(0x0e)
    1390            
    1391                    .dwattr $C$DW$T$39, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1392                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x16e)
    1393                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    1394                    .dwendtag $C$DW$T$39
    1395            
    1396            $C$DW$T$71      .dwtag  DW_TAG_typedef
    1397                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initCompareModeParam")
    1398                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$39)
    1399                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1400                    .dwattr $C$DW$T$71, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1401                    .dwattr $C$DW$T$71, DW_AT_decl_line(0x18d)
    1402                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    1403            
    1404            
    1405            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1406                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_initContinuousModeParam")
    1407                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
    1408            $C$DW$115       .dwtag  DW_TAG_member
    1409                    .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$21)
    1410                    .dwattr $C$DW$115, DW_AT_name("clockSource")
    1411                    .dwattr $C$DW$115, DW_AT_TI_symbol_name("clockSource")
    1412                    .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1413                    .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1414                    .dwattr $C$DW$115, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1415                    .dwattr $C$DW$115, DW_AT_decl_line(0x105)
    1416                    .dwattr $C$DW$115, DW_AT_decl_column(0x0e)
    1417            
    1418            $C$DW$116       .dwtag  DW_TAG_member
    1419                    .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$21)
    1420                    .dwattr $C$DW$116, DW_AT_name("clockSourceDivider")
    1421                    .dwattr $C$DW$116, DW_AT_TI_symbol_name("clockSourceDivider")
    1422                    .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1423                    .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1424                    .dwattr $C$DW$116, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   27

    1425                    .dwattr $C$DW$116, DW_AT_decl_line(0x11c)
    1426                    .dwattr $C$DW$116, DW_AT_decl_column(0x0e)
    1427            
    1428            $C$DW$117       .dwtag  DW_TAG_member
    1429                    .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$21)
    1430                    .dwattr $C$DW$117, DW_AT_name("timerInterruptEnable_TBIE")
    1431                    .dwattr $C$DW$117, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    1432                    .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1433                    .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1434                    .dwattr $C$DW$117, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1435                    .dwattr $C$DW$117, DW_AT_decl_line(0x121)
    1436                    .dwattr $C$DW$117, DW_AT_decl_column(0x0e)
    1437            
    1438            $C$DW$118       .dwtag  DW_TAG_member
    1439                    .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$21)
    1440                    .dwattr $C$DW$118, DW_AT_name("timerClear")
    1441                    .dwattr $C$DW$118, DW_AT_TI_symbol_name("timerClear")
    1442                    .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1443                    .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1444                    .dwattr $C$DW$118, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1445                    .dwattr $C$DW$118, DW_AT_decl_line(0x127)
    1446                    .dwattr $C$DW$118, DW_AT_decl_column(0x0e)
    1447            
    1448            $C$DW$119       .dwtag  DW_TAG_member
    1449                    .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$33)
    1450                    .dwattr $C$DW$119, DW_AT_name("startTimer")
    1451                    .dwattr $C$DW$119, DW_AT_TI_symbol_name("startTimer")
    1452                    .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1453                    .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1454                    .dwattr $C$DW$119, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1455                    .dwattr $C$DW$119, DW_AT_decl_line(0x129)
    1456                    .dwattr $C$DW$119, DW_AT_decl_column(0x0a)
    1457            
    1458                    .dwattr $C$DW$T$40, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1459                    .dwattr $C$DW$T$40, DW_AT_decl_line(0xfd)
    1460                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    1461                    .dwendtag $C$DW$T$40
    1462            
    1463            $C$DW$T$72      .dwtag  DW_TAG_typedef
    1464                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initContinuousModeParam")
    1465                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$40)
    1466                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1467                    .dwattr $C$DW$T$72, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1468                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x12a)
    1469                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    1470            
    1471            
    1472            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1473                    .dwattr $C$DW$T$41, DW_AT_name("Timer_B_initUpDownModeParam")
    1474                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0e)
    1475            $C$DW$120       .dwtag  DW_TAG_member
    1476                    .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$21)
    1477                    .dwattr $C$DW$120, DW_AT_name("clockSource")
    1478                    .dwattr $C$DW$120, DW_AT_TI_symbol_name("clockSource")
    1479                    .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   28

    1480                    .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1481                    .dwattr $C$DW$120, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1482                    .dwattr $C$DW$120, DW_AT_decl_line(0x13a)
    1483                    .dwattr $C$DW$120, DW_AT_decl_column(0x0e)
    1484            
    1485            $C$DW$121       .dwtag  DW_TAG_member
    1486                    .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$21)
    1487                    .dwattr $C$DW$121, DW_AT_name("clockSourceDivider")
    1488                    .dwattr $C$DW$121, DW_AT_TI_symbol_name("clockSourceDivider")
    1489                    .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1490                    .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1491                    .dwattr $C$DW$121, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1492                    .dwattr $C$DW$121, DW_AT_decl_line(0x151)
    1493                    .dwattr $C$DW$121, DW_AT_decl_column(0x0e)
    1494            
    1495            $C$DW$122       .dwtag  DW_TAG_member
    1496                    .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$21)
    1497                    .dwattr $C$DW$122, DW_AT_name("timerPeriod")
    1498                    .dwattr $C$DW$122, DW_AT_TI_symbol_name("timerPeriod")
    1499                    .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1500                    .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1501                    .dwattr $C$DW$122, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1502                    .dwattr $C$DW$122, DW_AT_decl_line(0x153)
    1503                    .dwattr $C$DW$122, DW_AT_decl_column(0x0e)
    1504            
    1505            $C$DW$123       .dwtag  DW_TAG_member
    1506                    .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$21)
    1507                    .dwattr $C$DW$123, DW_AT_name("timerInterruptEnable_TBIE")
    1508                    .dwattr $C$DW$123, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    1509                    .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1510                    .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1511                    .dwattr $C$DW$123, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1512                    .dwattr $C$DW$123, DW_AT_decl_line(0x158)
    1513                    .dwattr $C$DW$123, DW_AT_decl_column(0x0e)
    1514            
    1515            $C$DW$124       .dwtag  DW_TAG_member
    1516                    .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$21)
    1517                    .dwattr $C$DW$124, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    1518                    .dwattr $C$DW$124, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    1519                    .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1520                    .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1521                    .dwattr $C$DW$124, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1522                    .dwattr $C$DW$124, DW_AT_decl_line(0x15d)
    1523                    .dwattr $C$DW$124, DW_AT_decl_column(0x0e)
    1524            
    1525            $C$DW$125       .dwtag  DW_TAG_member
    1526                    .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$21)
    1527                    .dwattr $C$DW$125, DW_AT_name("timerClear")
    1528                    .dwattr $C$DW$125, DW_AT_TI_symbol_name("timerClear")
    1529                    .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1530                    .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1531                    .dwattr $C$DW$125, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1532                    .dwattr $C$DW$125, DW_AT_decl_line(0x163)
    1533                    .dwattr $C$DW$125, DW_AT_decl_column(0x0e)
    1534            
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   29

    1535            $C$DW$126       .dwtag  DW_TAG_member
    1536                    .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$33)
    1537                    .dwattr $C$DW$126, DW_AT_name("startTimer")
    1538                    .dwattr $C$DW$126, DW_AT_TI_symbol_name("startTimer")
    1539                    .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1540                    .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1541                    .dwattr $C$DW$126, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1542                    .dwattr $C$DW$126, DW_AT_decl_line(0x165)
    1543                    .dwattr $C$DW$126, DW_AT_decl_column(0x0a)
    1544            
    1545                    .dwattr $C$DW$T$41, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1546                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x132)
    1547                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    1548                    .dwendtag $C$DW$T$41
    1549            
    1550            $C$DW$T$73      .dwtag  DW_TAG_typedef
    1551                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpDownModeParam")
    1552                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$41)
    1553                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1554                    .dwattr $C$DW$T$73, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1555                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x166)
    1556                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    1557            
    1558            
    1559            $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1560                    .dwattr $C$DW$T$42, DW_AT_name("Timer_B_initUpModeParam")
    1561                    .dwattr $C$DW$T$42, DW_AT_byte_size(0x0e)
    1562            $C$DW$127       .dwtag  DW_TAG_member
    1563                    .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$21)
    1564                    .dwattr $C$DW$127, DW_AT_name("clockSource")
    1565                    .dwattr $C$DW$127, DW_AT_TI_symbol_name("clockSource")
    1566                    .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1567                    .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1568                    .dwattr $C$DW$127, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1569                    .dwattr $C$DW$127, DW_AT_decl_line(0x90)
    1570                    .dwattr $C$DW$127, DW_AT_decl_column(0x0e)
    1571            
    1572            $C$DW$128       .dwtag  DW_TAG_member
    1573                    .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$21)
    1574                    .dwattr $C$DW$128, DW_AT_name("clockSourceDivider")
    1575                    .dwattr $C$DW$128, DW_AT_TI_symbol_name("clockSourceDivider")
    1576                    .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1577                    .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1578                    .dwattr $C$DW$128, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1579                    .dwattr $C$DW$128, DW_AT_decl_line(0xa7)
    1580                    .dwattr $C$DW$128, DW_AT_decl_column(0x0e)
    1581            
    1582            $C$DW$129       .dwtag  DW_TAG_member
    1583                    .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$21)
    1584                    .dwattr $C$DW$129, DW_AT_name("timerPeriod")
    1585                    .dwattr $C$DW$129, DW_AT_TI_symbol_name("timerPeriod")
    1586                    .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1587                    .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1588                    .dwattr $C$DW$129, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1589                    .dwattr $C$DW$129, DW_AT_decl_line(0xaa)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:17:26 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\097882                            PAGE   30

    1590                    .dwattr $C$DW$129, DW_AT_decl_column(0x0e)
    1591            
    1592            $C$DW$130       .dwtag  DW_TAG_member
    1593                    .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$21)
    1594                    .dwattr $C$DW$130, DW_AT_name("timerInterruptEnable_TBIE")
    1595                    .dwattr $C$DW$130, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    1596                    .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
