MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                       PC v15.12.3.LTS *
       3            ;* Date/Time created: Mon Oct 17 14:33:00 2016                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../main.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 2003-2
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("D:\CodeComposerProj\CardReader001\src\Debug")
      12            
      13            $C$DW$1 .dwtag  DW_TAG_subprogram
      14                    .dwattr $C$DW$1, DW_AT_name("set_clock")
      15                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("set_clock")
      16                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$10)

      91            ;* --------------------------------------------------------------------------*
      92                    .dwcfi  cfa_offset, 4
      93                    .dwcfi  save_reg_to_mem, 16, -4
      94                    .dwpsn  file "../main.c",line 13,column 5,is_stmt,isa 0
      95 000000 40B2          MOV.W     #23168,&WDTCTL+0      ; [] |13| 
         000002 5A80 
         000004 0000!
      96                    .dwpsn  file "../main.c",line 14,column 5,is_stmt,isa 0
      97 000006 430C          MOV.W     #0,r12                ; [] |14| 
      98            $C$DW$10        .dwtag  DW_TAG_TI_branch
      99                    .dwattr $C$DW$10, DW_AT_low_pc(0x00)
     100                    .dwattr $C$DW$10, DW_AT_name("set_clock")
     101                    .dwattr $C$DW$10, DW_AT_TI_call
     102            
     103 000008 13B0!         CALLA     #set_clock            ; [] |14| 
         00000a 0000 
     104                                                      ; [] |14| 
     105                    .dwpsn  file "../main.c",line 18,column 2,is_stmt,isa 0
     106 00000c 431C          MOV.W     #1,r12                ; [] |18| 
     107 00000e 431D          MOV.W     #1,r13                ; [] |18| 
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE    3

     108 000010 435E          MOV.B     #1,r14                ; [] |18| 
     109 000012 431F          MOV.W     #1,r15                ; [] |18| 
     110            $C$DW$11        .dwtag  DW_TAG_TI_branch
     111                    .dwattr $C$DW$11, DW_AT_low_pc(0x00)
     112                    .dwattr $C$DW$11, DW_AT_name("set_gpio")
     113                    .dwattr $C$DW$11, DW_AT_TI_call
     114            
     115 000014 13B0!         CALLA     #set_gpio             ; [] |18| 
         000016 0000 
     116                                                      ; [] |18| 
     117                    .dwpsn  file "../main.c",line 19,column 2,is_stmt,isa 0
     118 000018 422C          MOV.W     #4,r12                ; [] |19| 
     119 00001a 403D          MOV.W     #128,r13              ; [] |19| 
         00001c 0080 
     120 00001e 435E          MOV.B     #1,r14                ; [] |19| 
     121 000020 430F          MOV.W     #0,r15                ; [] |19| 
     122            $C$DW$12        .dwtag  DW_TAG_TI_branch
     123                    .dwattr $C$DW$12, DW_AT_low_pc(0x00)
     124                    .dwattr $C$DW$12, DW_AT_name("set_gpio")
     125                    .dwattr $C$DW$12, DW_AT_TI_call
     126            
     127 000022 13B0!         CALLA     #set_gpio             ; [] |19| 
         000024 0000 
     128                                                      ; [] |19| 
     129                    .dwpsn  file "../main.c",line 34,column 2,is_stmt,isa 0
     130 000026 430C          MOV.W     #0,r12                ; [] |34| 
     131                    .dwpsn  file "../main.c",line 35,column 1,is_stmt,isa 0
     132            $C$DW$13        .dwtag  DW_TAG_TI_branch
     133                    .dwattr $C$DW$13, DW_AT_low_pc(0x00)
     134                    .dwattr $C$DW$13, DW_AT_TI_return
     135            
     136 000028 0110          RETA      ; [] 
     137                    ; [] 
     138                    .dwattr $C$DW$9, DW_AT_TI_end_file("../main.c")
     139                    .dwattr $C$DW$9, DW_AT_TI_end_line(0x23)
     140                    .dwattr $C$DW$9, DW_AT_TI_end_column(0x01)
     141                    .dwendentry
     142                    .dwendtag $C$DW$9
     143            
     144            ;*****************************************************************************
     145            ;* UNDEFINED EXTERNAL REFERENCES                                             *
     146            ;*****************************************************************************
     147                    .global set_clock
     148                    .global set_gpio
     149                    .global WDTCTL
     150            
     151            ;******************************************************************************
     152            ;* BUILD ATTRIBUTES                                                           *
     153            ;******************************************************************************
     154                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
     155                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000001111000000000
     156                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
     157                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
     158                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
     159                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE    4

     160            
     161            ;******************************************************************************
     162            ;* TYPE INFORMATION                                                           *
     163            ;******************************************************************************
     164            
     165            $C$DW$T$20      .dwtag  DW_TAG_structure_type
     166                    .dwattr $C$DW$T$20, DW_AT_name("ADC12_A_configureMemoryParam")
     167                    .dwattr $C$DW$T$20, DW_AT_byte_size(0x05)
     168            $C$DW$14        .dwtag  DW_TAG_member
     169                    .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     170                    .dwattr $C$DW$14, DW_AT_name("memoryBufferControlIndex")
     171                    .dwattr $C$DW$14, DW_AT_TI_symbol_name("memoryBufferControlIndex")
     172                    .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     173                    .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     174                    .dwattr $C$DW$14, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
     175                    .dwattr $C$DW$14, DW_AT_decl_line(0x53)
     176                    .dwattr $C$DW$14, DW_AT_decl_column(0x0d)
     177            
     178            $C$DW$15        .dwtag  DW_TAG_member
     179                    .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     180                    .dwattr $C$DW$15, DW_AT_name("inputSourceSelect")
     181                    .dwattr $C$DW$15, DW_AT_TI_symbol_name("inputSourceSelect")
     182                    .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     183                    .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     184                    .dwattr $C$DW$15, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
     185                    .dwattr $C$DW$15, DW_AT_decl_line(0x67)
     186                    .dwattr $C$DW$15, DW_AT_decl_column(0x0d)
     187            
     188            $C$DW$16        .dwtag  DW_TAG_member
     189                    .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     190                    .dwattr $C$DW$16, DW_AT_name("positiveRefVoltageSourceSelect")
     191                    .dwattr $C$DW$16, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
     192                    .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     193                    .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     194                    .dwattr $C$DW$16, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
     195                    .dwattr $C$DW$16, DW_AT_decl_line(0x6e)
     196                    .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
     197            
     198            $C$DW$17        .dwtag  DW_TAG_member
     199                    .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     200                    .dwattr $C$DW$17, DW_AT_name("negativeRefVoltageSourceSelect")
     201                    .dwattr $C$DW$17, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
     202                    .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     203                    .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     204                    .dwattr $C$DW$17, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
     205                    .dwattr $C$DW$17, DW_AT_decl_line(0x74)
     206                    .dwattr $C$DW$17, DW_AT_decl_column(0x0d)
     207            
     208            $C$DW$18        .dwtag  DW_TAG_member
     209                    .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     210                    .dwattr $C$DW$18, DW_AT_name("endOfSequence")
     211                    .dwattr $C$DW$18, DW_AT_TI_symbol_name("endOfSequence")
     212                    .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     213                    .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     214                    .dwattr $C$DW$18, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE    5

     215                    .dwattr $C$DW$18, DW_AT_decl_line(0x7d)
     216                    .dwattr $C$DW$18, DW_AT_decl_column(0x0d)
     217            
     218                    .dwattr $C$DW$T$20, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
     219                    .dwattr $C$DW$T$20, DW_AT_decl_line(0x3f)
     220                    .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
     221                    .dwendtag $C$DW$T$20
     222            
     223            $C$DW$T$57      .dwtag  DW_TAG_typedef
     224                    .dwattr $C$DW$T$57, DW_AT_name("ADC12_A_configureMemoryParam")
     225                    .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$20)
     226                    .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
     227                    .dwattr $C$DW$T$57, DW_AT_decl_file("..\MSP430F5xx_6xx\adc12_a.h")
     228                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x7e)
     229                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x03)
     230            
     231            
     232            $C$DW$T$22      .dwtag  DW_TAG_structure_type
     233                    .dwattr $C$DW$T$22, DW_AT_name("Calendar")
     234                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
     235            $C$DW$19        .dwtag  DW_TAG_member
     236                    .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     237                    .dwattr $C$DW$19, DW_AT_name("Seconds")
     238                    .dwattr $C$DW$19, DW_AT_TI_symbol_name("Seconds")
     239                    .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     240                    .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     241                    .dwattr $C$DW$19, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     242                    .dwattr $C$DW$19, DW_AT_decl_line(0x5c)
     243                    .dwattr $C$DW$19, DW_AT_decl_column(0x0d)
     244            
     245            $C$DW$20        .dwtag  DW_TAG_member
     246                    .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     247                    .dwattr $C$DW$20, DW_AT_name("Minutes")
     248                    .dwattr $C$DW$20, DW_AT_TI_symbol_name("Minutes")
     249                    .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     250                    .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     251                    .dwattr $C$DW$20, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     252                    .dwattr $C$DW$20, DW_AT_decl_line(0x5e)
     253                    .dwattr $C$DW$20, DW_AT_decl_column(0x0d)
     254            
     255            $C$DW$21        .dwtag  DW_TAG_member
     256                    .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     257                    .dwattr $C$DW$21, DW_AT_name("Hours")
     258                    .dwattr $C$DW$21, DW_AT_TI_symbol_name("Hours")
     259                    .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     260                    .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     261                    .dwattr $C$DW$21, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     262                    .dwattr $C$DW$21, DW_AT_decl_line(0x60)
     263                    .dwattr $C$DW$21, DW_AT_decl_column(0x0d)
     264            
     265            $C$DW$22        .dwtag  DW_TAG_member
     266                    .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     267                    .dwattr $C$DW$22, DW_AT_name("DayOfWeek")
     268                    .dwattr $C$DW$22, DW_AT_TI_symbol_name("DayOfWeek")
     269                    .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE    6

     270                    .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     271                    .dwattr $C$DW$22, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     272                    .dwattr $C$DW$22, DW_AT_decl_line(0x62)
     273                    .dwattr $C$DW$22, DW_AT_decl_column(0x0d)
     274            
     275            $C$DW$23        .dwtag  DW_TAG_member
     276                    .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     277                    .dwattr $C$DW$23, DW_AT_name("DayOfMonth")
     278                    .dwattr $C$DW$23, DW_AT_TI_symbol_name("DayOfMonth")
     279                    .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     280                    .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     281                    .dwattr $C$DW$23, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     282                    .dwattr $C$DW$23, DW_AT_decl_line(0x64)
     283                    .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
     284            
     285            $C$DW$24        .dwtag  DW_TAG_member
     286                    .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     287                    .dwattr $C$DW$24, DW_AT_name("Month")
     288                    .dwattr $C$DW$24, DW_AT_TI_symbol_name("Month")
     289                    .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     290                    .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     291                    .dwattr $C$DW$24, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     292                    .dwattr $C$DW$24, DW_AT_decl_line(0x66)
     293                    .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
     294            
     295            $C$DW$25        .dwtag  DW_TAG_member
     296                    .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$21)
     297                    .dwattr $C$DW$25, DW_AT_name("Year")
     298                    .dwattr $C$DW$25, DW_AT_TI_symbol_name("Year")
     299                    .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     300                    .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     301                    .dwattr $C$DW$25, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     302                    .dwattr $C$DW$25, DW_AT_decl_line(0x68)
     303                    .dwattr $C$DW$25, DW_AT_decl_column(0x0e)
     304            
     305                    .dwattr $C$DW$T$22, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     306                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x59)
     307                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
     308                    .dwendtag $C$DW$T$22
     309            
     310            $C$DW$T$58      .dwtag  DW_TAG_typedef
     311                    .dwattr $C$DW$T$58, DW_AT_name("Calendar")
     312                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$22)
     313                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
     314                    .dwattr $C$DW$T$58, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     315                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x69)
     316                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
     317            
     318            
     319            $C$DW$T$23      .dwtag  DW_TAG_structure_type
     320                    .dwattr $C$DW$T$23, DW_AT_name("Comp_B_configureReferenceVoltageParam")
     321                    .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
     322            $C$DW$26        .dwtag  DW_TAG_member
     323                    .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$21)
     324                    .dwattr $C$DW$26, DW_AT_name("supplyVoltageReferenceBase")
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE    7

     325                    .dwattr $C$DW$26, DW_AT_TI_symbol_name("supplyVoltageReferenceBase")
     326                    .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     327                    .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     328                    .dwattr $C$DW$26, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     329                    .dwattr $C$DW$26, DW_AT_decl_line(0x8e)
     330                    .dwattr $C$DW$26, DW_AT_decl_column(0x0e)
     331            
     332            $C$DW$27        .dwtag  DW_TAG_member
     333                    .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$21)
     334                    .dwattr $C$DW$27, DW_AT_name("lowerLimitSupplyVoltageFractionOf32")
     335                    .dwattr $C$DW$27, DW_AT_TI_symbol_name("lowerLimitSupplyVoltageFractionOf32")
     336                    .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     337                    .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     338                    .dwattr $C$DW$27, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     339                    .dwattr $C$DW$27, DW_AT_decl_line(0x91)
     340                    .dwattr $C$DW$27, DW_AT_decl_column(0x0e)
     341            
     342            $C$DW$28        .dwtag  DW_TAG_member
     343                    .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$21)
     344                    .dwattr $C$DW$28, DW_AT_name("upperLimitSupplyVoltageFractionOf32")
     345                    .dwattr $C$DW$28, DW_AT_TI_symbol_name("upperLimitSupplyVoltageFractionOf32")
     346                    .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     347                    .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     348                    .dwattr $C$DW$28, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     349                    .dwattr $C$DW$28, DW_AT_decl_line(0x94)
     350                    .dwattr $C$DW$28, DW_AT_decl_column(0x0e)
     351            
     352            $C$DW$29        .dwtag  DW_TAG_member
     353                    .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$21)
     354                    .dwattr $C$DW$29, DW_AT_name("referenceAccuracy")
     355                    .dwattr $C$DW$29, DW_AT_TI_symbol_name("referenceAccuracy")
     356                    .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     357                    .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     358                    .dwattr $C$DW$29, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     359                    .dwattr $C$DW$29, DW_AT_decl_line(0x9a)
     360                    .dwattr $C$DW$29, DW_AT_decl_column(0x0e)
     361            
     362                    .dwattr $C$DW$T$23, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     363                    .dwattr $C$DW$T$23, DW_AT_decl_line(0x85)
     364                    .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
     365                    .dwendtag $C$DW$T$23
     366            
     367            $C$DW$T$59      .dwtag  DW_TAG_typedef
     368                    .dwattr $C$DW$T$59, DW_AT_name("Comp_B_configureReferenceVoltageParam")
     369                    .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$23)
     370                    .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
     371                    .dwattr $C$DW$T$59, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     372                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x9b)
     373                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x03)
     374            
     375            
     376            $C$DW$T$24      .dwtag  DW_TAG_structure_type
     377                    .dwattr $C$DW$T$24, DW_AT_name("Comp_B_initParam")
     378                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
     379            $C$DW$30        .dwtag  DW_TAG_member
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE    8

     380                    .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     381                    .dwattr $C$DW$30, DW_AT_name("positiveTerminalInput")
     382                    .dwattr $C$DW$30, DW_AT_TI_symbol_name("positiveTerminalInput")
     383                    .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     384                    .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     385                    .dwattr $C$DW$30, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     386                    .dwattr $C$DW$30, DW_AT_decl_line(0x53)
     387                    .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     388            
     389            $C$DW$31        .dwtag  DW_TAG_member
     390                    .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     391                    .dwattr $C$DW$31, DW_AT_name("negativeTerminalInput")
     392                    .dwattr $C$DW$31, DW_AT_TI_symbol_name("negativeTerminalInput")
     393                    .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     394                    .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     395                    .dwattr $C$DW$31, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     396                    .dwattr $C$DW$31, DW_AT_decl_line(0x67)
     397                    .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     398            
     399            $C$DW$32        .dwtag  DW_TAG_member
     400                    .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$21)
     401                    .dwattr $C$DW$32, DW_AT_name("powerModeSelect")
     402                    .dwattr $C$DW$32, DW_AT_TI_symbol_name("powerModeSelect")
     403                    .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     404                    .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     405                    .dwattr $C$DW$32, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     406                    .dwattr $C$DW$32, DW_AT_decl_line(0x6d)
     407                    .dwattr $C$DW$32, DW_AT_decl_column(0x0e)
     408            
     409            $C$DW$33        .dwtag  DW_TAG_member
     410                    .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     411                    .dwattr $C$DW$33, DW_AT_name("outputFilterEnableAndDelayLevel")
     412                    .dwattr $C$DW$33, DW_AT_TI_symbol_name("outputFilterEnableAndDelayLevel")
     413                    .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     414                    .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     415                    .dwattr $C$DW$33, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     416                    .dwattr $C$DW$33, DW_AT_decl_line(0x77)
     417                    .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     418            
     419            $C$DW$34        .dwtag  DW_TAG_member
     420                    .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$21)
     421                    .dwattr $C$DW$34, DW_AT_name("invertedOutputPolarity")
     422                    .dwattr $C$DW$34, DW_AT_TI_symbol_name("invertedOutputPolarity")
     423                    .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     424                    .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     425                    .dwattr $C$DW$34, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     426                    .dwattr $C$DW$34, DW_AT_decl_line(0x7c)
     427                    .dwattr $C$DW$34, DW_AT_decl_column(0x0e)
     428            
     429                    .dwattr $C$DW$T$24, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     430                    .dwattr $C$DW$T$24, DW_AT_decl_line(0x3e)
     431                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
     432                    .dwendtag $C$DW$T$24
     433            
     434            $C$DW$T$60      .dwtag  DW_TAG_typedef
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE    9

     435                    .dwattr $C$DW$T$60, DW_AT_name("Comp_B_initParam")
     436                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$24)
     437                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
     438                    .dwattr $C$DW$T$60, DW_AT_decl_file("..\MSP430F5xx_6xx\comp_b.h")
     439                    .dwattr $C$DW$T$60, DW_AT_decl_line(0x7d)
     440                    .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
     441            
     442            
     443            $C$DW$T$25      .dwtag  DW_TAG_structure_type
     444                    .dwattr $C$DW$T$25, DW_AT_name("DMA_initParam")
     445                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x0a)
     446            $C$DW$35        .dwtag  DW_TAG_member
     447                    .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     448                    .dwattr $C$DW$35, DW_AT_name("channelSelect")
     449                    .dwattr $C$DW$35, DW_AT_TI_symbol_name("channelSelect")
     450                    .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     451                    .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     452                    .dwattr $C$DW$35, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     453                    .dwattr $C$DW$35, DW_AT_decl_line(0x4a)
     454                    .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     455            
     456            $C$DW$36        .dwtag  DW_TAG_member
     457                    .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$21)
     458                    .dwattr $C$DW$36, DW_AT_name("transferModeSelect")
     459                    .dwattr $C$DW$36, DW_AT_TI_symbol_name("transferModeSelect")
     460                    .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     461                    .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     462                    .dwattr $C$DW$36, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     463                    .dwattr $C$DW$36, DW_AT_decl_line(0x59)
     464                    .dwattr $C$DW$36, DW_AT_decl_column(0x0e)
     465            
     466            $C$DW$37        .dwtag  DW_TAG_member
     467                    .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$21)
     468                    .dwattr $C$DW$37, DW_AT_name("transferSize")
     469                    .dwattr $C$DW$37, DW_AT_TI_symbol_name("transferSize")
     470                    .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     471                    .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     472                    .dwattr $C$DW$37, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     473                    .dwattr $C$DW$37, DW_AT_decl_line(0x5d)
     474                    .dwattr $C$DW$37, DW_AT_decl_column(0x0e)
     475            
     476            $C$DW$38        .dwtag  DW_TAG_member
     477                    .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     478                    .dwattr $C$DW$38, DW_AT_name("triggerSourceSelect")
     479                    .dwattr $C$DW$38, DW_AT_TI_symbol_name("triggerSourceSelect")
     480                    .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     481                    .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     482                    .dwattr $C$DW$38, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     483                    .dwattr $C$DW$38, DW_AT_decl_line(0x81)
     484                    .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     485            
     486            $C$DW$39        .dwtag  DW_TAG_member
     487                    .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     488                    .dwattr $C$DW$39, DW_AT_name("transferUnitSelect")
     489                    .dwattr $C$DW$39, DW_AT_TI_symbol_name("transferUnitSelect")
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE   10

     490                    .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     491                    .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     492                    .dwattr $C$DW$39, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     493                    .dwattr $C$DW$39, DW_AT_decl_line(0x88)
     494                    .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     495            
     496            $C$DW$40        .dwtag  DW_TAG_member
     497                    .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     498                    .dwattr $C$DW$40, DW_AT_name("triggerTypeSelect")
     499                    .dwattr $C$DW$40, DW_AT_TI_symbol_name("triggerTypeSelect")
     500                    .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     501                    .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     502                    .dwattr $C$DW$40, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     503                    .dwattr $C$DW$40, DW_AT_decl_line(0x90)
     504                    .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     505            
     506                    .dwattr $C$DW$T$25, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     507                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x3e)
     508                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
     509                    .dwendtag $C$DW$T$25
     510            
     511            $C$DW$T$61      .dwtag  DW_TAG_typedef
     512                    .dwattr $C$DW$T$61, DW_AT_name("DMA_initParam")
     513                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$25)
     514                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
     515                    .dwattr $C$DW$T$61, DW_AT_decl_file("..\MSP430F5xx_6xx\dma.h")
     516                    .dwattr $C$DW$T$61, DW_AT_decl_line(0x91)
     517                    .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
     518            
     519            
     520            $C$DW$T$29      .dwtag  DW_TAG_structure_type
     521                    .dwattr $C$DW$T$29, DW_AT_name("PMAP_initPortsParam")
     522                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x0a)
     523            $C$DW$41        .dwtag  DW_TAG_member
     524                    .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$27)
     525                    .dwattr $C$DW$41, DW_AT_name("portMapping")
     526                    .dwattr $C$DW$41, DW_AT_TI_symbol_name("portMapping")
     527                    .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     528                    .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     529                    .dwattr $C$DW$41, DW_AT_decl_file("..\MSP430F5xx_6xx\pmap.h")
     530                    .dwattr $C$DW$41, DW_AT_decl_line(0x41)
     531                    .dwattr $C$DW$41, DW_AT_decl_column(0x14)
     532            
     533            $C$DW$42        .dwtag  DW_TAG_member
     534                    .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$28)
     535                    .dwattr $C$DW$42, DW_AT_name("PxMAPy")
     536                    .dwattr $C$DW$42, DW_AT_TI_symbol_name("PxMAPy")
     537                    .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     538                    .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     539                    .dwattr $C$DW$42, DW_AT_decl_file("..\MSP430F5xx_6xx\pmap.h")
     540                    .dwattr $C$DW$42, DW_AT_decl_line(0x43)
     541                    .dwattr $C$DW$42, DW_AT_decl_column(0x0e)
     542            
     543            $C$DW$43        .dwtag  DW_TAG_member
     544                    .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE   11

     545                    .dwattr $C$DW$43, DW_AT_name("numberOfPorts")
     546                    .dwattr $C$DW$43, DW_AT_TI_symbol_name("numberOfPorts")
     547                    .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     548                    .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     549                    .dwattr $C$DW$43, DW_AT_decl_file("..\MSP430F5xx_6xx\pmap.h")
     550                    .dwattr $C$DW$43, DW_AT_decl_line(0x45)
     551                    .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     552            
     553            $C$DW$44        .dwtag  DW_TAG_member
     554                    .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     555                    .dwattr $C$DW$44, DW_AT_name("portMapReconfigure")
     556                    .dwattr $C$DW$44, DW_AT_TI_symbol_name("portMapReconfigure")
     557                    .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     558                    .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     559                    .dwattr $C$DW$44, DW_AT_decl_file("..\MSP430F5xx_6xx\pmap.h")
     560                    .dwattr $C$DW$44, DW_AT_decl_line(0x4a)
     561                    .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     562            
     563                    .dwattr $C$DW$T$29, DW_AT_decl_file("..\MSP430F5xx_6xx\pmap.h")
     564                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x3e)
     565                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
     566                    .dwendtag $C$DW$T$29
     567            
     568            $C$DW$T$62      .dwtag  DW_TAG_typedef
     569                    .dwattr $C$DW$T$62, DW_AT_name("PMAP_initPortsParam")
     570                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$29)
     571                    .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
     572                    .dwattr $C$DW$T$62, DW_AT_decl_file("..\MSP430F5xx_6xx\pmap.h")
     573                    .dwattr $C$DW$T$62, DW_AT_decl_line(0x4b)
     574                    .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
     575            
     576            
     577            $C$DW$T$30      .dwtag  DW_TAG_structure_type
     578                    .dwattr $C$DW$T$30, DW_AT_name("RTC_A_configureCalendarAlarmParam")
     579                    .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
     580            $C$DW$45        .dwtag  DW_TAG_member
     581                    .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     582                    .dwattr $C$DW$45, DW_AT_name("minutesAlarm")
     583                    .dwattr $C$DW$45, DW_AT_TI_symbol_name("minutesAlarm")
     584                    .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     585                    .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     586                    .dwattr $C$DW$45, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     587                    .dwattr $C$DW$45, DW_AT_decl_line(0x44)
     588                    .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     589            
     590            $C$DW$46        .dwtag  DW_TAG_member
     591                    .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     592                    .dwattr $C$DW$46, DW_AT_name("hoursAlarm")
     593                    .dwattr $C$DW$46, DW_AT_TI_symbol_name("hoursAlarm")
     594                    .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     595                    .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     596                    .dwattr $C$DW$46, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     597                    .dwattr $C$DW$46, DW_AT_decl_line(0x48)
     598                    .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     599            
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE   12

     600            $C$DW$47        .dwtag  DW_TAG_member
     601                    .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     602                    .dwattr $C$DW$47, DW_AT_name("dayOfWeekAlarm")
     603                    .dwattr $C$DW$47, DW_AT_TI_symbol_name("dayOfWeekAlarm")
     604                    .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     605                    .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     606                    .dwattr $C$DW$47, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     607                    .dwattr $C$DW$47, DW_AT_decl_line(0x4c)
     608                    .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     609            
     610            $C$DW$48        .dwtag  DW_TAG_member
     611                    .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     612                    .dwattr $C$DW$48, DW_AT_name("dayOfMonthAlarm")
     613                    .dwattr $C$DW$48, DW_AT_TI_symbol_name("dayOfMonthAlarm")
     614                    .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     615                    .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     616                    .dwattr $C$DW$48, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     617                    .dwattr $C$DW$48, DW_AT_decl_line(0x50)
     618                    .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     619            
     620                    .dwattr $C$DW$T$30, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     621                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x3f)
     622                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
     623                    .dwendtag $C$DW$T$30
     624            
     625            $C$DW$T$63      .dwtag  DW_TAG_typedef
     626                    .dwattr $C$DW$T$63, DW_AT_name("RTC_A_configureCalendarAlarmParam")
     627                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$30)
     628                    .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
     629                    .dwattr $C$DW$T$63, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
     630                    .dwattr $C$DW$T$63, DW_AT_decl_line(0x51)
     631                    .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
     632            
     633            
     634            $C$DW$T$31      .dwtag  DW_TAG_structure_type
     635                    .dwattr $C$DW$T$31, DW_AT_name("Timer_A_initCaptureModeParam")
     636                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x0c)
     637            $C$DW$49        .dwtag  DW_TAG_member
     638                    .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$21)
     639                    .dwattr $C$DW$49, DW_AT_name("captureRegister")
     640                    .dwattr $C$DW$49, DW_AT_TI_symbol_name("captureRegister")
     641                    .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     642                    .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     643                    .dwattr $C$DW$49, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     644                    .dwattr $C$DW$49, DW_AT_decl_line(0x89)
     645                    .dwattr $C$DW$49, DW_AT_decl_column(0x0e)
     646            
     647            $C$DW$50        .dwtag  DW_TAG_member
     648                    .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$21)
     649                    .dwattr $C$DW$50, DW_AT_name("captureMode")
     650                    .dwattr $C$DW$50, DW_AT_TI_symbol_name("captureMode")
     651                    .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     652                    .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     653                    .dwattr $C$DW$50, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     654                    .dwattr $C$DW$50, DW_AT_decl_line(0x90)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE   13

     655                    .dwattr $C$DW$50, DW_AT_decl_column(0x0e)
     656            
     657            $C$DW$51        .dwtag  DW_TAG_member
     658                    .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$21)
     659                    .dwattr $C$DW$51, DW_AT_name("captureInputSelect")
     660                    .dwattr $C$DW$51, DW_AT_TI_symbol_name("captureInputSelect")
     661                    .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     662                    .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     663                    .dwattr $C$DW$51, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     664                    .dwattr $C$DW$51, DW_AT_decl_line(0x97)
     665                    .dwattr $C$DW$51, DW_AT_decl_column(0x0e)
     666            
     667            $C$DW$52        .dwtag  DW_TAG_member
     668                    .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$21)
     669                    .dwattr $C$DW$52, DW_AT_name("synchronizeCaptureSource")
     670                    .dwattr $C$DW$52, DW_AT_TI_symbol_name("synchronizeCaptureSource")
     671                    .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     672                    .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     673                    .dwattr $C$DW$52, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     674                    .dwattr $C$DW$52, DW_AT_decl_line(0x9c)
     675                    .dwattr $C$DW$52, DW_AT_decl_column(0x0e)
     676            
     677            $C$DW$53        .dwtag  DW_TAG_member
     678                    .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$21)
     679                    .dwattr $C$DW$53, DW_AT_name("captureInterruptEnable")
     680                    .dwattr $C$DW$53, DW_AT_TI_symbol_name("captureInterruptEnable")
     681                    .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     682                    .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     683                    .dwattr $C$DW$53, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     684                    .dwattr $C$DW$53, DW_AT_decl_line(0xa1)
     685                    .dwattr $C$DW$53, DW_AT_decl_column(0x0e)
     686            
     687            $C$DW$54        .dwtag  DW_TAG_member
     688                    .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$21)
     689                    .dwattr $C$DW$54, DW_AT_name("captureOutputMode")
     690                    .dwattr $C$DW$54, DW_AT_TI_symbol_name("captureOutputMode")
     691                    .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     692                    .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     693                    .dwattr $C$DW$54, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     694                    .dwattr $C$DW$54, DW_AT_decl_line(0xac)
     695                    .dwattr $C$DW$54, DW_AT_decl_column(0x0e)
     696            
     697                    .dwattr $C$DW$T$31, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     698                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x7d)
     699                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
     700                    .dwendtag $C$DW$T$31
     701            
     702            $C$DW$T$64      .dwtag  DW_TAG_typedef
     703                    .dwattr $C$DW$T$64, DW_AT_name("Timer_A_initCaptureModeParam")
     704                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$31)
     705                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
     706                    .dwattr $C$DW$T$64, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     707                    .dwattr $C$DW$T$64, DW_AT_decl_line(0xad)
     708                    .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
     709            
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE   14

     710            
     711            $C$DW$T$32      .dwtag  DW_TAG_structure_type
     712                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initCompareModeParam")
     713                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x08)
     714            $C$DW$55        .dwtag  DW_TAG_member
     715                    .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$21)
     716                    .dwattr $C$DW$55, DW_AT_name("compareRegister")
     717                    .dwattr $C$DW$55, DW_AT_TI_symbol_name("compareRegister")
     718                    .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     719                    .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     720                    .dwattr $C$DW$55, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     721                    .dwattr $C$DW$55, DW_AT_decl_line(0x17a)
     722                    .dwattr $C$DW$55, DW_AT_decl_column(0x0e)
     723            
     724            $C$DW$56        .dwtag  DW_TAG_member
     725                    .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$21)
     726                    .dwattr $C$DW$56, DW_AT_name("compareInterruptEnable")
     727                    .dwattr $C$DW$56, DW_AT_TI_symbol_name("compareInterruptEnable")
     728                    .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     729                    .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     730                    .dwattr $C$DW$56, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     731                    .dwattr $C$DW$56, DW_AT_decl_line(0x17f)
     732                    .dwattr $C$DW$56, DW_AT_decl_column(0x0e)
     733            
     734            $C$DW$57        .dwtag  DW_TAG_member
     735                    .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$21)
     736                    .dwattr $C$DW$57, DW_AT_name("compareOutputMode")
     737                    .dwattr $C$DW$57, DW_AT_TI_symbol_name("compareOutputMode")
     738                    .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     739                    .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     740                    .dwattr $C$DW$57, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     741                    .dwattr $C$DW$57, DW_AT_decl_line(0x18a)
     742                    .dwattr $C$DW$57, DW_AT_decl_column(0x0e)
     743            
     744            $C$DW$58        .dwtag  DW_TAG_member
     745                    .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$21)
     746                    .dwattr $C$DW$58, DW_AT_name("compareValue")
     747                    .dwattr $C$DW$58, DW_AT_TI_symbol_name("compareValue")
     748                    .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     749                    .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     750                    .dwattr $C$DW$58, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     751                    .dwattr $C$DW$58, DW_AT_decl_line(0x18c)
     752                    .dwattr $C$DW$58, DW_AT_decl_column(0x0e)
     753            
     754                    .dwattr $C$DW$T$32, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     755                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x16e)
     756                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
     757                    .dwendtag $C$DW$T$32
     758            
     759            $C$DW$T$65      .dwtag  DW_TAG_typedef
     760                    .dwattr $C$DW$T$65, DW_AT_name("Timer_A_initCompareModeParam")
     761                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$32)
     762                    .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
     763                    .dwattr $C$DW$T$65, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     764                    .dwattr $C$DW$T$65, DW_AT_decl_line(0x18d)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE   15

     765                    .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
     766            
     767            
     768            $C$DW$T$34      .dwtag  DW_TAG_structure_type
     769                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_initContinuousModeParam")
     770                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
     771            $C$DW$59        .dwtag  DW_TAG_member
     772                    .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$21)
     773                    .dwattr $C$DW$59, DW_AT_name("clockSource")
     774                    .dwattr $C$DW$59, DW_AT_TI_symbol_name("clockSource")
     775                    .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     776                    .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     777                    .dwattr $C$DW$59, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     778                    .dwattr $C$DW$59, DW_AT_decl_line(0x50)
     779                    .dwattr $C$DW$59, DW_AT_decl_column(0x0e)
     780            
     781            $C$DW$60        .dwtag  DW_TAG_member
     782                    .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$21)
     783                    .dwattr $C$DW$60, DW_AT_name("clockSourceDivider")
     784                    .dwattr $C$DW$60, DW_AT_TI_symbol_name("clockSourceDivider")
     785                    .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     786                    .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     787                    .dwattr $C$DW$60, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     788                    .dwattr $C$DW$60, DW_AT_decl_line(0x67)
     789                    .dwattr $C$DW$60, DW_AT_decl_column(0x0e)
     790            
     791            $C$DW$61        .dwtag  DW_TAG_member
     792                    .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$21)
     793                    .dwattr $C$DW$61, DW_AT_name("timerInterruptEnable_TAIE")
     794                    .dwattr $C$DW$61, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
     795                    .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     796                    .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     797                    .dwattr $C$DW$61, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     798                    .dwattr $C$DW$61, DW_AT_decl_line(0x6c)
     799                    .dwattr $C$DW$61, DW_AT_decl_column(0x0e)
     800            
     801            $C$DW$62        .dwtag  DW_TAG_member
     802                    .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$21)
     803                    .dwattr $C$DW$62, DW_AT_name("timerClear")
     804                    .dwattr $C$DW$62, DW_AT_TI_symbol_name("timerClear")
     805                    .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     806                    .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     807                    .dwattr $C$DW$62, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     808                    .dwattr $C$DW$62, DW_AT_decl_line(0x72)
     809                    .dwattr $C$DW$62, DW_AT_decl_column(0x0e)
     810            
     811            $C$DW$63        .dwtag  DW_TAG_member
     812                    .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$33)
     813                    .dwattr $C$DW$63, DW_AT_name("startTimer")
     814                    .dwattr $C$DW$63, DW_AT_TI_symbol_name("startTimer")
     815                    .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     816                    .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     817                    .dwattr $C$DW$63, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     818                    .dwattr $C$DW$63, DW_AT_decl_line(0x74)
     819                    .dwattr $C$DW$63, DW_AT_decl_column(0x0a)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE   16

     820            
     821                    .dwattr $C$DW$T$34, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     822                    .dwattr $C$DW$T$34, DW_AT_decl_line(0x48)
     823                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
     824                    .dwendtag $C$DW$T$34
     825            
     826            $C$DW$T$66      .dwtag  DW_TAG_typedef
     827                    .dwattr $C$DW$T$66, DW_AT_name("Timer_A_initContinuousModeParam")
     828                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$34)
     829                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
     830                    .dwattr $C$DW$T$66, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     831                    .dwattr $C$DW$T$66, DW_AT_decl_line(0x75)
     832                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
     833            
     834            
     835            $C$DW$T$35      .dwtag  DW_TAG_structure_type
     836                    .dwattr $C$DW$T$35, DW_AT_name("Timer_A_initUpDownModeParam")
     837                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x0e)
     838            $C$DW$64        .dwtag  DW_TAG_member
     839                    .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$21)
     840                    .dwattr $C$DW$64, DW_AT_name("clockSource")
     841                    .dwattr $C$DW$64, DW_AT_TI_symbol_name("clockSource")
     842                    .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     843                    .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     844                    .dwattr $C$DW$64, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     845                    .dwattr $C$DW$64, DW_AT_decl_line(0xbd)
     846                    .dwattr $C$DW$64, DW_AT_decl_column(0x0e)
     847            
     848            $C$DW$65        .dwtag  DW_TAG_member
     849                    .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$21)
     850                    .dwattr $C$DW$65, DW_AT_name("clockSourceDivider")
     851                    .dwattr $C$DW$65, DW_AT_TI_symbol_name("clockSourceDivider")
     852                    .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     853                    .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     854                    .dwattr $C$DW$65, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     855                    .dwattr $C$DW$65, DW_AT_decl_line(0xd4)
     856                    .dwattr $C$DW$65, DW_AT_decl_column(0x0e)
     857            
     858            $C$DW$66        .dwtag  DW_TAG_member
     859                    .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$21)
     860                    .dwattr $C$DW$66, DW_AT_name("timerPeriod")
     861                    .dwattr $C$DW$66, DW_AT_TI_symbol_name("timerPeriod")
     862                    .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     863                    .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     864                    .dwattr $C$DW$66, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     865                    .dwattr $C$DW$66, DW_AT_decl_line(0xd6)
     866                    .dwattr $C$DW$66, DW_AT_decl_column(0x0e)
     867            
     868            $C$DW$67        .dwtag  DW_TAG_member
     869                    .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$21)
     870                    .dwattr $C$DW$67, DW_AT_name("timerInterruptEnable_TAIE")
     871                    .dwattr $C$DW$67, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
     872                    .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     873                    .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     874                    .dwattr $C$DW$67, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE   17

     875                    .dwattr $C$DW$67, DW_AT_decl_line(0xdb)
     876                    .dwattr $C$DW$67, DW_AT_decl_column(0x0e)
     877            
     878            $C$DW$68        .dwtag  DW_TAG_member
     879                    .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$21)
     880                    .dwattr $C$DW$68, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
     881                    .dwattr $C$DW$68, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
     882                    .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     883                    .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     884                    .dwattr $C$DW$68, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     885                    .dwattr $C$DW$68, DW_AT_decl_line(0xe0)
     886                    .dwattr $C$DW$68, DW_AT_decl_column(0x0e)
     887            
     888            $C$DW$69        .dwtag  DW_TAG_member
     889                    .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$21)
     890                    .dwattr $C$DW$69, DW_AT_name("timerClear")
     891                    .dwattr $C$DW$69, DW_AT_TI_symbol_name("timerClear")
     892                    .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     893                    .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     894                    .dwattr $C$DW$69, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     895                    .dwattr $C$DW$69, DW_AT_decl_line(0xe6)
     896                    .dwattr $C$DW$69, DW_AT_decl_column(0x0e)
     897            
     898            $C$DW$70        .dwtag  DW_TAG_member
     899                    .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$33)
     900                    .dwattr $C$DW$70, DW_AT_name("startTimer")
     901                    .dwattr $C$DW$70, DW_AT_TI_symbol_name("startTimer")
     902                    .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     903                    .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     904                    .dwattr $C$DW$70, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     905                    .dwattr $C$DW$70, DW_AT_decl_line(0xe8)
     906                    .dwattr $C$DW$70, DW_AT_decl_column(0x0a)
     907            
     908                    .dwattr $C$DW$T$35, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     909                    .dwattr $C$DW$T$35, DW_AT_decl_line(0xb5)
     910                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
     911                    .dwendtag $C$DW$T$35
     912            
     913            $C$DW$T$67      .dwtag  DW_TAG_typedef
     914                    .dwattr $C$DW$T$67, DW_AT_name("Timer_A_initUpDownModeParam")
     915                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$35)
     916                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     917                    .dwattr $C$DW$T$67, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     918                    .dwattr $C$DW$T$67, DW_AT_decl_line(0xe9)
     919                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x03)
     920            
     921            
     922            $C$DW$T$36      .dwtag  DW_TAG_structure_type
     923                    .dwattr $C$DW$T$36, DW_AT_name("Timer_A_initUpModeParam")
     924                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x0e)
     925            $C$DW$71        .dwtag  DW_TAG_member
     926                    .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$21)
     927                    .dwattr $C$DW$71, DW_AT_name("clockSource")
     928                    .dwattr $C$DW$71, DW_AT_TI_symbol_name("clockSource")
     929                    .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE   18

     930                    .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     931                    .dwattr $C$DW$71, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     932                    .dwattr $C$DW$71, DW_AT_decl_line(0x139)
     933                    .dwattr $C$DW$71, DW_AT_decl_column(0x0e)
     934            
     935            $C$DW$72        .dwtag  DW_TAG_member
     936                    .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$21)
     937                    .dwattr $C$DW$72, DW_AT_name("clockSourceDivider")
     938                    .dwattr $C$DW$72, DW_AT_TI_symbol_name("clockSourceDivider")
     939                    .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     940                    .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     941                    .dwattr $C$DW$72, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     942                    .dwattr $C$DW$72, DW_AT_decl_line(0x150)
     943                    .dwattr $C$DW$72, DW_AT_decl_column(0x0e)
     944            
     945            $C$DW$73        .dwtag  DW_TAG_member
     946                    .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$21)
     947                    .dwattr $C$DW$73, DW_AT_name("timerPeriod")
     948                    .dwattr $C$DW$73, DW_AT_TI_symbol_name("timerPeriod")
     949                    .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     950                    .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     951                    .dwattr $C$DW$73, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     952                    .dwattr $C$DW$73, DW_AT_decl_line(0x153)
     953                    .dwattr $C$DW$73, DW_AT_decl_column(0x0e)
     954            
     955            $C$DW$74        .dwtag  DW_TAG_member
     956                    .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
     957                    .dwattr $C$DW$74, DW_AT_name("timerInterruptEnable_TAIE")
     958                    .dwattr $C$DW$74, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
     959                    .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     960                    .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     961                    .dwattr $C$DW$74, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     962                    .dwattr $C$DW$74, DW_AT_decl_line(0x158)
     963                    .dwattr $C$DW$74, DW_AT_decl_column(0x0e)
     964            
     965            $C$DW$75        .dwtag  DW_TAG_member
     966                    .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$21)
     967                    .dwattr $C$DW$75, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
     968                    .dwattr $C$DW$75, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
     969                    .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     970                    .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     971                    .dwattr $C$DW$75, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     972                    .dwattr $C$DW$75, DW_AT_decl_line(0x15d)
     973                    .dwattr $C$DW$75, DW_AT_decl_column(0x0e)
     974            
     975            $C$DW$76        .dwtag  DW_TAG_member
     976                    .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$21)
     977                    .dwattr $C$DW$76, DW_AT_name("timerClear")
     978                    .dwattr $C$DW$76, DW_AT_TI_symbol_name("timerClear")
     979                    .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     980                    .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     981                    .dwattr $C$DW$76, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     982                    .dwattr $C$DW$76, DW_AT_decl_line(0x163)
     983                    .dwattr $C$DW$76, DW_AT_decl_column(0x0e)
     984            
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE   19

     985            $C$DW$77        .dwtag  DW_TAG_member
     986                    .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$33)
     987                    .dwattr $C$DW$77, DW_AT_name("startTimer")
     988                    .dwattr $C$DW$77, DW_AT_TI_symbol_name("startTimer")
     989                    .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     990                    .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     991                    .dwattr $C$DW$77, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     992                    .dwattr $C$DW$77, DW_AT_decl_line(0x165)
     993                    .dwattr $C$DW$77, DW_AT_decl_column(0x0a)
     994            
     995                    .dwattr $C$DW$T$36, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
     996                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x131)
     997                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
     998                    .dwendtag $C$DW$T$36
     999            
    1000            $C$DW$T$68      .dwtag  DW_TAG_typedef
    1001                    .dwattr $C$DW$T$68, DW_AT_name("Timer_A_initUpModeParam")
    1002                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$36)
    1003                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1004                    .dwattr $C$DW$T$68, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1005                    .dwattr $C$DW$T$68, DW_AT_decl_line(0x166)
    1006                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    1007            
    1008            
    1009            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1010                    .dwattr $C$DW$T$37, DW_AT_name("Timer_A_outputPWMParam")
    1011                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x0c)
    1012            $C$DW$78        .dwtag  DW_TAG_member
    1013                    .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$21)
    1014                    .dwattr $C$DW$78, DW_AT_name("clockSource")
    1015                    .dwattr $C$DW$78, DW_AT_TI_symbol_name("clockSource")
    1016                    .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1017                    .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1018                    .dwattr $C$DW$78, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1019                    .dwattr $C$DW$78, DW_AT_decl_line(0xf8)
    1020                    .dwattr $C$DW$78, DW_AT_decl_column(0x0e)
    1021            
    1022            $C$DW$79        .dwtag  DW_TAG_member
    1023                    .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$21)
    1024                    .dwattr $C$DW$79, DW_AT_name("clockSourceDivider")
    1025                    .dwattr $C$DW$79, DW_AT_TI_symbol_name("clockSourceDivider")
    1026                    .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1027                    .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1028                    .dwattr $C$DW$79, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1029                    .dwattr $C$DW$79, DW_AT_decl_line(0x10f)
    1030                    .dwattr $C$DW$79, DW_AT_decl_column(0x0e)
    1031            
    1032            $C$DW$80        .dwtag  DW_TAG_member
    1033                    .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$21)
    1034                    .dwattr $C$DW$80, DW_AT_name("timerPeriod")
    1035                    .dwattr $C$DW$80, DW_AT_TI_symbol_name("timerPeriod")
    1036                    .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1037                    .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1038                    .dwattr $C$DW$80, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1039                    .dwattr $C$DW$80, DW_AT_decl_line(0x111)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE   20

    1040                    .dwattr $C$DW$80, DW_AT_decl_column(0x0e)
    1041            
    1042            $C$DW$81        .dwtag  DW_TAG_member
    1043                    .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$21)
    1044                    .dwattr $C$DW$81, DW_AT_name("compareRegister")
    1045                    .dwattr $C$DW$81, DW_AT_TI_symbol_name("compareRegister")
    1046                    .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1047                    .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1048                    .dwattr $C$DW$81, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1049                    .dwattr $C$DW$81, DW_AT_decl_line(0x11c)
    1050                    .dwattr $C$DW$81, DW_AT_decl_column(0x0e)
    1051            
    1052            $C$DW$82        .dwtag  DW_TAG_member
    1053                    .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$21)
    1054                    .dwattr $C$DW$82, DW_AT_name("compareOutputMode")
    1055                    .dwattr $C$DW$82, DW_AT_TI_symbol_name("compareOutputMode")
    1056                    .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1057                    .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1058                    .dwattr $C$DW$82, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1059                    .dwattr $C$DW$82, DW_AT_decl_line(0x127)
    1060                    .dwattr $C$DW$82, DW_AT_decl_column(0x0e)
    1061            
    1062            $C$DW$83        .dwtag  DW_TAG_member
    1063                    .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
    1064                    .dwattr $C$DW$83, DW_AT_name("dutyCycle")
    1065                    .dwattr $C$DW$83, DW_AT_TI_symbol_name("dutyCycle")
    1066                    .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1067                    .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1068                    .dwattr $C$DW$83, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1069                    .dwattr $C$DW$83, DW_AT_decl_line(0x129)
    1070                    .dwattr $C$DW$83, DW_AT_decl_column(0x0e)
    1071            
    1072                    .dwattr $C$DW$T$37, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1073                    .dwattr $C$DW$T$37, DW_AT_decl_line(0xf0)
    1074                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    1075                    .dwendtag $C$DW$T$37
    1076            
    1077            $C$DW$T$69      .dwtag  DW_TAG_typedef
    1078                    .dwattr $C$DW$T$69, DW_AT_name("Timer_A_outputPWMParam")
    1079                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$37)
    1080                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1081                    .dwattr $C$DW$T$69, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    1082                    .dwattr $C$DW$T$69, DW_AT_decl_line(0x12a)
    1083                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    1084            
    1085            
    1086            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1087                    .dwattr $C$DW$T$38, DW_AT_name("Timer_B_initCaptureModeParam")
    1088                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x0c)
    1089            $C$DW$84        .dwtag  DW_TAG_member
    1090                    .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    1091                    .dwattr $C$DW$84, DW_AT_name("captureRegister")
    1092                    .dwattr $C$DW$84, DW_AT_TI_symbol_name("captureRegister")
    1093                    .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1094                    .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE   21

    1095                    .dwattr $C$DW$84, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1096                    .dwattr $C$DW$84, DW_AT_decl_line(0xd1)
    1097                    .dwattr $C$DW$84, DW_AT_decl_column(0x0e)
    1098            
    1099            $C$DW$85        .dwtag  DW_TAG_member
    1100                    .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$21)
    1101                    .dwattr $C$DW$85, DW_AT_name("captureMode")
    1102                    .dwattr $C$DW$85, DW_AT_TI_symbol_name("captureMode")
    1103                    .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1104                    .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1105                    .dwattr $C$DW$85, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1106                    .dwattr $C$DW$85, DW_AT_decl_line(0xd8)
    1107                    .dwattr $C$DW$85, DW_AT_decl_column(0x0e)
    1108            
    1109            $C$DW$86        .dwtag  DW_TAG_member
    1110                    .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
    1111                    .dwattr $C$DW$86, DW_AT_name("captureInputSelect")
    1112                    .dwattr $C$DW$86, DW_AT_TI_symbol_name("captureInputSelect")
    1113                    .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1114                    .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1115                    .dwattr $C$DW$86, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1116                    .dwattr $C$DW$86, DW_AT_decl_line(0xdf)
    1117                    .dwattr $C$DW$86, DW_AT_decl_column(0x0e)
    1118            
    1119            $C$DW$87        .dwtag  DW_TAG_member
    1120                    .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$21)
    1121                    .dwattr $C$DW$87, DW_AT_name("synchronizeCaptureSource")
    1122                    .dwattr $C$DW$87, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    1123                    .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1124                    .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1125                    .dwattr $C$DW$87, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1126                    .dwattr $C$DW$87, DW_AT_decl_line(0xe4)
    1127                    .dwattr $C$DW$87, DW_AT_decl_column(0x0e)
    1128            
    1129            $C$DW$88        .dwtag  DW_TAG_member
    1130                    .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$21)
    1131                    .dwattr $C$DW$88, DW_AT_name("captureInterruptEnable")
    1132                    .dwattr $C$DW$88, DW_AT_TI_symbol_name("captureInterruptEnable")
    1133                    .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1134                    .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1135                    .dwattr $C$DW$88, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1136                    .dwattr $C$DW$88, DW_AT_decl_line(0xe9)
    1137                    .dwattr $C$DW$88, DW_AT_decl_column(0x0e)
    1138            
    1139            $C$DW$89        .dwtag  DW_TAG_member
    1140                    .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$21)
    1141                    .dwattr $C$DW$89, DW_AT_name("captureOutputMode")
    1142                    .dwattr $C$DW$89, DW_AT_TI_symbol_name("captureOutputMode")
    1143                    .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1144                    .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1145                    .dwattr $C$DW$89, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1146                    .dwattr $C$DW$89, DW_AT_decl_line(0xf4)
    1147                    .dwattr $C$DW$89, DW_AT_decl_column(0x0e)
    1148            
    1149                    .dwattr $C$DW$T$38, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE   22

    1150                    .dwattr $C$DW$T$38, DW_AT_decl_line(0xc5)
    1151                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    1152                    .dwendtag $C$DW$T$38
    1153            
    1154            $C$DW$T$70      .dwtag  DW_TAG_typedef
    1155                    .dwattr $C$DW$T$70, DW_AT_name("Timer_B_initCaptureModeParam")
    1156                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$38)
    1157                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1158                    .dwattr $C$DW$T$70, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1159                    .dwattr $C$DW$T$70, DW_AT_decl_line(0xf5)
    1160                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    1161            
    1162            
    1163            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1164                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initCompareModeParam")
    1165                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    1166            $C$DW$90        .dwtag  DW_TAG_member
    1167                    .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$21)
    1168                    .dwattr $C$DW$90, DW_AT_name("compareRegister")
    1169                    .dwattr $C$DW$90, DW_AT_TI_symbol_name("compareRegister")
    1170                    .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1171                    .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1172                    .dwattr $C$DW$90, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1173                    .dwattr $C$DW$90, DW_AT_decl_line(0x17a)
    1174                    .dwattr $C$DW$90, DW_AT_decl_column(0x0e)
    1175            
    1176            $C$DW$91        .dwtag  DW_TAG_member
    1177                    .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$21)
    1178                    .dwattr $C$DW$91, DW_AT_name("compareInterruptEnable")
    1179                    .dwattr $C$DW$91, DW_AT_TI_symbol_name("compareInterruptEnable")
    1180                    .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1181                    .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1182                    .dwattr $C$DW$91, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1183                    .dwattr $C$DW$91, DW_AT_decl_line(0x17f)
    1184                    .dwattr $C$DW$91, DW_AT_decl_column(0x0e)
    1185            
    1186            $C$DW$92        .dwtag  DW_TAG_member
    1187                    .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$21)
    1188                    .dwattr $C$DW$92, DW_AT_name("compareOutputMode")
    1189                    .dwattr $C$DW$92, DW_AT_TI_symbol_name("compareOutputMode")
    1190                    .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1191                    .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1192                    .dwattr $C$DW$92, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1193                    .dwattr $C$DW$92, DW_AT_decl_line(0x18a)
    1194                    .dwattr $C$DW$92, DW_AT_decl_column(0x0e)
    1195            
    1196            $C$DW$93        .dwtag  DW_TAG_member
    1197                    .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$21)
    1198                    .dwattr $C$DW$93, DW_AT_name("compareValue")
    1199                    .dwattr $C$DW$93, DW_AT_TI_symbol_name("compareValue")
    1200                    .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1201                    .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1202                    .dwattr $C$DW$93, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1203                    .dwattr $C$DW$93, DW_AT_decl_line(0x18c)
    1204                    .dwattr $C$DW$93, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE   23

    1205            
    1206                    .dwattr $C$DW$T$39, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1207                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x16e)
    1208                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    1209                    .dwendtag $C$DW$T$39
    1210            
    1211            $C$DW$T$71      .dwtag  DW_TAG_typedef
    1212                    .dwattr $C$DW$T$71, DW_AT_name("Timer_B_initCompareModeParam")
    1213                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$39)
    1214                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1215                    .dwattr $C$DW$T$71, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1216                    .dwattr $C$DW$T$71, DW_AT_decl_line(0x18d)
    1217                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    1218            
    1219            
    1220            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1221                    .dwattr $C$DW$T$40, DW_AT_name("Timer_B_initContinuousModeParam")
    1222                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
    1223            $C$DW$94        .dwtag  DW_TAG_member
    1224                    .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$21)
    1225                    .dwattr $C$DW$94, DW_AT_name("clockSource")
    1226                    .dwattr $C$DW$94, DW_AT_TI_symbol_name("clockSource")
    1227                    .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1228                    .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1229                    .dwattr $C$DW$94, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1230                    .dwattr $C$DW$94, DW_AT_decl_line(0x105)
    1231                    .dwattr $C$DW$94, DW_AT_decl_column(0x0e)
    1232            
    1233            $C$DW$95        .dwtag  DW_TAG_member
    1234                    .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$21)
    1235                    .dwattr $C$DW$95, DW_AT_name("clockSourceDivider")
    1236                    .dwattr $C$DW$95, DW_AT_TI_symbol_name("clockSourceDivider")
    1237                    .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1238                    .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1239                    .dwattr $C$DW$95, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1240                    .dwattr $C$DW$95, DW_AT_decl_line(0x11c)
    1241                    .dwattr $C$DW$95, DW_AT_decl_column(0x0e)
    1242            
    1243            $C$DW$96        .dwtag  DW_TAG_member
    1244                    .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$21)
    1245                    .dwattr $C$DW$96, DW_AT_name("timerInterruptEnable_TBIE")
    1246                    .dwattr $C$DW$96, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    1247                    .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1248                    .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1249                    .dwattr $C$DW$96, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1250                    .dwattr $C$DW$96, DW_AT_decl_line(0x121)
    1251                    .dwattr $C$DW$96, DW_AT_decl_column(0x0e)
    1252            
    1253            $C$DW$97        .dwtag  DW_TAG_member
    1254                    .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$21)
    1255                    .dwattr $C$DW$97, DW_AT_name("timerClear")
    1256                    .dwattr $C$DW$97, DW_AT_TI_symbol_name("timerClear")
    1257                    .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1258                    .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1259                    .dwattr $C$DW$97, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE   24

    1260                    .dwattr $C$DW$97, DW_AT_decl_line(0x127)
    1261                    .dwattr $C$DW$97, DW_AT_decl_column(0x0e)
    1262            
    1263            $C$DW$98        .dwtag  DW_TAG_member
    1264                    .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$33)
    1265                    .dwattr $C$DW$98, DW_AT_name("startTimer")
    1266                    .dwattr $C$DW$98, DW_AT_TI_symbol_name("startTimer")
    1267                    .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1268                    .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1269                    .dwattr $C$DW$98, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1270                    .dwattr $C$DW$98, DW_AT_decl_line(0x129)
    1271                    .dwattr $C$DW$98, DW_AT_decl_column(0x0a)
    1272            
    1273                    .dwattr $C$DW$T$40, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1274                    .dwattr $C$DW$T$40, DW_AT_decl_line(0xfd)
    1275                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    1276                    .dwendtag $C$DW$T$40
    1277            
    1278            $C$DW$T$72      .dwtag  DW_TAG_typedef
    1279                    .dwattr $C$DW$T$72, DW_AT_name("Timer_B_initContinuousModeParam")
    1280                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$40)
    1281                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1282                    .dwattr $C$DW$T$72, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1283                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x12a)
    1284                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    1285            
    1286            
    1287            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1288                    .dwattr $C$DW$T$41, DW_AT_name("Timer_B_initUpDownModeParam")
    1289                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0e)
    1290            $C$DW$99        .dwtag  DW_TAG_member
    1291                    .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$21)
    1292                    .dwattr $C$DW$99, DW_AT_name("clockSource")
    1293                    .dwattr $C$DW$99, DW_AT_TI_symbol_name("clockSource")
    1294                    .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1295                    .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1296                    .dwattr $C$DW$99, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1297                    .dwattr $C$DW$99, DW_AT_decl_line(0x13a)
    1298                    .dwattr $C$DW$99, DW_AT_decl_column(0x0e)
    1299            
    1300            $C$DW$100       .dwtag  DW_TAG_member
    1301                    .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$21)
    1302                    .dwattr $C$DW$100, DW_AT_name("clockSourceDivider")
    1303                    .dwattr $C$DW$100, DW_AT_TI_symbol_name("clockSourceDivider")
    1304                    .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1305                    .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1306                    .dwattr $C$DW$100, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1307                    .dwattr $C$DW$100, DW_AT_decl_line(0x151)
    1308                    .dwattr $C$DW$100, DW_AT_decl_column(0x0e)
    1309            
    1310            $C$DW$101       .dwtag  DW_TAG_member
    1311                    .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$21)
    1312                    .dwattr $C$DW$101, DW_AT_name("timerPeriod")
    1313                    .dwattr $C$DW$101, DW_AT_TI_symbol_name("timerPeriod")
    1314                    .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE   25

    1315                    .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1316                    .dwattr $C$DW$101, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1317                    .dwattr $C$DW$101, DW_AT_decl_line(0x153)
    1318                    .dwattr $C$DW$101, DW_AT_decl_column(0x0e)
    1319            
    1320            $C$DW$102       .dwtag  DW_TAG_member
    1321                    .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$21)
    1322                    .dwattr $C$DW$102, DW_AT_name("timerInterruptEnable_TBIE")
    1323                    .dwattr $C$DW$102, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    1324                    .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1325                    .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1326                    .dwattr $C$DW$102, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1327                    .dwattr $C$DW$102, DW_AT_decl_line(0x158)
    1328                    .dwattr $C$DW$102, DW_AT_decl_column(0x0e)
    1329            
    1330            $C$DW$103       .dwtag  DW_TAG_member
    1331                    .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$21)
    1332                    .dwattr $C$DW$103, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    1333                    .dwattr $C$DW$103, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    1334                    .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1335                    .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1336                    .dwattr $C$DW$103, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1337                    .dwattr $C$DW$103, DW_AT_decl_line(0x15d)
    1338                    .dwattr $C$DW$103, DW_AT_decl_column(0x0e)
    1339            
    1340            $C$DW$104       .dwtag  DW_TAG_member
    1341                    .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$21)
    1342                    .dwattr $C$DW$104, DW_AT_name("timerClear")
    1343                    .dwattr $C$DW$104, DW_AT_TI_symbol_name("timerClear")
    1344                    .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1345                    .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1346                    .dwattr $C$DW$104, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1347                    .dwattr $C$DW$104, DW_AT_decl_line(0x163)
    1348                    .dwattr $C$DW$104, DW_AT_decl_column(0x0e)
    1349            
    1350            $C$DW$105       .dwtag  DW_TAG_member
    1351                    .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$33)
    1352                    .dwattr $C$DW$105, DW_AT_name("startTimer")
    1353                    .dwattr $C$DW$105, DW_AT_TI_symbol_name("startTimer")
    1354                    .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1355                    .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1356                    .dwattr $C$DW$105, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1357                    .dwattr $C$DW$105, DW_AT_decl_line(0x165)
    1358                    .dwattr $C$DW$105, DW_AT_decl_column(0x0a)
    1359            
    1360                    .dwattr $C$DW$T$41, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1361                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x132)
    1362                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    1363                    .dwendtag $C$DW$T$41
    1364            
    1365            $C$DW$T$73      .dwtag  DW_TAG_typedef
    1366                    .dwattr $C$DW$T$73, DW_AT_name("Timer_B_initUpDownModeParam")
    1367                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$41)
    1368                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1369                    .dwattr $C$DW$T$73, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:00 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\017322                             PAGE   26

    1370                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x166)
    1371                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    1372            
    1373            
    1374            $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1375                    .dwattr $C$DW$T$42, DW_AT_name("Timer_B_initUpModeParam")
    1376                    .dwattr $C$DW$T$42, DW_AT_byte_size(0x0e)
    1377            $C$DW$106       .dwtag  DW_TAG_member
    1378                    .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$21)
    1379                    .dwattr $C$DW$106, DW_AT_name("clockSource")
    1380                    .dwattr $C$DW$106, DW_AT_TI_symbol_name("clockSource")
    1381                    .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1382                    .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1383                    .dwattr $C$DW$106, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1384                    .dwattr $C$DW$106, DW_AT_decl_line(0x90)
    1385                    .dwattr $C$DW$106, DW_AT_decl_column(0x0e)
    1386            
    1387            $C$DW$107       .dwtag  DW_TAG_member
    1388                    .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$21)
    1389                    .dwattr $C$DW$107, DW_AT_name("clockSourceDivider")
    1390                    .dwattr $C$DW$107, DW_AT_TI_symbol_name("clockSourceDivider")
    1391                    .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1392                    .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1393                    .dwattr $C$DW$107, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1394                    .dwattr $C$DW$107, DW_AT_decl_line(0xa7)
    1395                    .dwattr $C$DW$107, DW_AT_decl_column(0x0e)
    1396            
    1397            $C$DW$108       .dwtag  DW_TAG_member
    1398                    .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$21)
    1399                    .dwattr $C$DW$108, DW_AT_name("timerPeriod")
    1400                    .dwattr $C$DW$108, DW_AT_TI_symbol_name("timerPeriod")
    1401                    .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1402                    .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1403                    .dwattr $C$DW$108, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1404                    .dwattr $C$DW$108, DW_AT_decl_line(0xaa)
    1405                    .dwattr $C$DW$108, DW_AT_decl_column(0x0e)
    1406            
    1407            $C$DW$109       .dwtag  DW_TAG_member
    1408                    .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$21)
    1409                    .dwattr $C$DW$109, DW_AT_name("timerInterruptEnable_TBIE")
    1410                    .dwattr $C$DW$109, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    1411                    .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1412                    .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1413                    .dwattr $C$DW$109, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    1414                    .dwattr $C$DW$109, DW_AT_decl_line(0xaf)
    1415                    .dwattr $C$DW$109, DW_AT_decl_column(0x0e)
    1416            
    1417            $C$DW$110       .dwtag  DW_TAG_member
