MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:09 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\042802                             PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                       PC v15.12.3.LTS *
       3            ;* Date/Time created: Mon Oct 17 14:33:08 2016                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../MSP430F5xx_6xx/rtc_a.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 2003-2
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("D:\CodeComposerProj\CardReader001\src\Debug")
      12            ;       D:\ti\ccsv6\tools\compiler\msp430_15.12.3.LTS\bin\opt430.exe D:/CodeComposerProj/CardReader001
      13 000000               .sect   ".text:RTC_A_startClock"
      14                    .clink
      15                    .global RTC_A_startClock
      16            

    1936            $C$DW$128       .dwtag  DW_TAG_variable
    1937                    .dwattr $C$DW$128, DW_AT_name("interruptFlagMask")
    1938                    .dwattr $C$DW$128, DW_AT_TI_symbol_name("interruptFlagMask")
    1939                    .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1940                    .dwattr $C$DW$128, DW_AT_location[DW_OP_reg13]
    1941            
    1942                    .dwpsn  file "../MSP430F5xx_6xx/rtc_a.c",line 306,column 5,is_stmt,isa 0
    1943 000000 B07D          BIT.B     #112,r13              ; [] |306| 
         000002 0070 
    1944 000004 2408          JEQ       $C$L19                ; [] |306| 
    1945                                                      ; [] |306| 
    1946            ;* --------------------------------------------------------------------------*
    1947                    .dwpsn  file "../MSP430F5xx_6xx/rtc_a.c",line 311,column 9,is_stmt,isa 0
    1948 000006 4D4F          MOV.B     r13,r15               ; [] |311| 
    1949 000008 0F5F          RRUM.W    #4,r15                ; [] |311| 
    1950 00000a E07F          XOR.B     #7,r15                ; [] |311| 
         00000c 0007 
    1951 00000e D07F          OR.B      #248,r15              ; [] |311| 
         000010 00F8 
    1952 000012 FFCC          AND.B     r15,0(r12)            ; [] |311| 
         000014 0000 
    1953            ;* --------------------------------------------------------------------------*
    1954 000016       $C$L19:    
    1955                    .dwpsn  file "../MSP430F5xx_6xx/rtc_a.c",line 317,column 5,is_stmt,isa 0
    1956 000016 B36D          BIT.B     #2,r13                ; [] |317| 
    1957 000018 2405          JEQ       $C$L20                ; [] |317| 
    1958                                                      ; [] |317| 
    1959            ;* --------------------------------------------------------------------------*
    1960                    .dwpsn  file "../MSP430F5xx_6xx/rtc_a.c",line 319,column 9,is_stmt,isa 0
    1961 00001a 0CCF          MOVA      r12,r15               ; [] |319| 
    1962 00001c 523F          ADD.W     #8,r15                ; [] |319| 
    1963 00001e 4F0F          MOV.W     r15,r15               ; [] |319| 
    1964 000020 C3DF          BIC.B     #1,0(r15)             ; [] |319| 
         000022 0000 
    1965            ;* --------------------------------------------------------------------------*
    1966 000024       $C$L20:    
    1967                    .dwpsn  file "../MSP430F5xx_6xx/rtc_a.c",line 322,column 5,is_stmt,isa 0
    1968 000024 B35D          BIT.B     #1,r13                ; [] |322| 
    1969 000026 2405          JEQ       $C$L21                ; [] |322| 
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:09 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\042802                             PAGE   39

    1970                                                      ; [] |322| 
    1971            ;* --------------------------------------------------------------------------*
    1972                    .dwpsn  file "../MSP430F5xx_6xx/rtc_a.c",line 324,column 9,is_stmt,isa 0
    1973 000028 503C          ADD.W     #10,r12               ; [] |324| 
         00002a 000A 
    1974 00002c 4C0F          MOV.W     r12,r15               ; [] |324| 
    1975 00002e C3DF          BIC.B     #1,0(r15)             ; [] |324| 
         000030 0000 
    1976            ;* --------------------------------------------------------------------------*
    1977 000032       $C$L21:    
    1978                    .dwpsn  file "../MSP430F5xx_6xx/rtc_a.c",line 326,column 1,is_stmt,isa 0
    1979            $C$DW$129       .dwtag  DW_TAG_TI_branch
    1980                    .dwattr $C$DW$129, DW_AT_low_pc(0x00)
    1981                    .dwattr $C$DW$129, DW_AT_TI_return
    1982            
    1983 000032 0110          RETA      ; [] 
    1984                    ; [] 
    1985                    .dwattr $C$DW$124, DW_AT_TI_end_file("../MSP430F5xx_6xx/rtc_a.c")
    1986                    .dwattr $C$DW$124, DW_AT_TI_end_line(0x146)
    1987                    .dwattr $C$DW$124, DW_AT_TI_end_column(0x01)
    1988                    .dwendentry
    1989                    .dwendtag $C$DW$124
    1990            
    1991            
    1992            ;******************************************************************************
    1993            ;* BUILD ATTRIBUTES                                                           *
    1994            ;******************************************************************************
    1995                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
    1996                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000001111000000000
    1997                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
    1998                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
    1999                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
    2000                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
    2001            
    2002            ;******************************************************************************
    2003            ;* TYPE INFORMATION                                                           *
    2004            ;******************************************************************************
    2005            
    2006            $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2007                    .dwattr $C$DW$T$21, DW_AT_name("Calendar")
    2008                    .dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
    2009            $C$DW$130       .dwtag  DW_TAG_member
    2010                    .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2011                    .dwattr $C$DW$130, DW_AT_name("Seconds")
    2012                    .dwattr $C$DW$130, DW_AT_TI_symbol_name("Seconds")
    2013                    .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2014                    .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2015                    .dwattr $C$DW$130, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
    2016                    .dwattr $C$DW$130, DW_AT_decl_line(0x5c)
    2017                    .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    2018            
    2019            $C$DW$131       .dwtag  DW_TAG_member
    2020                    .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2021                    .dwattr $C$DW$131, DW_AT_name("Minutes")
    2022                    .dwattr $C$DW$131, DW_AT_TI_symbol_name("Minutes")
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:09 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\042802                             PAGE   40

    2023                    .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2024                    .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2025                    .dwattr $C$DW$131, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
    2026                    .dwattr $C$DW$131, DW_AT_decl_line(0x5e)
    2027                    .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    2028            
    2029            $C$DW$132       .dwtag  DW_TAG_member
    2030                    .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2031                    .dwattr $C$DW$132, DW_AT_name("Hours")
    2032                    .dwattr $C$DW$132, DW_AT_TI_symbol_name("Hours")
    2033                    .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2034                    .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2035                    .dwattr $C$DW$132, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
    2036                    .dwattr $C$DW$132, DW_AT_decl_line(0x60)
    2037                    .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    2038            
    2039            $C$DW$133       .dwtag  DW_TAG_member
    2040                    .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2041                    .dwattr $C$DW$133, DW_AT_name("DayOfWeek")
    2042                    .dwattr $C$DW$133, DW_AT_TI_symbol_name("DayOfWeek")
    2043                    .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2044                    .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2045                    .dwattr $C$DW$133, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
    2046                    .dwattr $C$DW$133, DW_AT_decl_line(0x62)
    2047                    .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    2048            
    2049            $C$DW$134       .dwtag  DW_TAG_member
    2050                    .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2051                    .dwattr $C$DW$134, DW_AT_name("DayOfMonth")
    2052                    .dwattr $C$DW$134, DW_AT_TI_symbol_name("DayOfMonth")
    2053                    .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2054                    .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2055                    .dwattr $C$DW$134, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
    2056                    .dwattr $C$DW$134, DW_AT_decl_line(0x64)
    2057                    .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    2058            
    2059            $C$DW$135       .dwtag  DW_TAG_member
    2060                    .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2061                    .dwattr $C$DW$135, DW_AT_name("Month")
    2062                    .dwattr $C$DW$135, DW_AT_TI_symbol_name("Month")
    2063                    .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2064                    .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2065                    .dwattr $C$DW$135, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
    2066                    .dwattr $C$DW$135, DW_AT_decl_line(0x66)
    2067                    .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    2068            
    2069            $C$DW$136       .dwtag  DW_TAG_member
    2070                    .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$20)
    2071                    .dwattr $C$DW$136, DW_AT_name("Year")
    2072                    .dwattr $C$DW$136, DW_AT_TI_symbol_name("Year")
    2073                    .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2074                    .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2075                    .dwattr $C$DW$136, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
    2076                    .dwattr $C$DW$136, DW_AT_decl_line(0x68)
    2077                    .dwattr $C$DW$136, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:09 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\042802                             PAGE   41

    2078            
    2079                    .dwattr $C$DW$T$21, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
    2080                    .dwattr $C$DW$T$21, DW_AT_decl_line(0x59)
    2081                    .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    2082                    .dwendtag $C$DW$T$21
    2083            
    2084            $C$DW$T$23      .dwtag  DW_TAG_typedef
    2085                    .dwattr $C$DW$T$23, DW_AT_name("Calendar")
    2086                    .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$21)
    2087                    .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    2088                    .dwattr $C$DW$T$23, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
    2089                    .dwattr $C$DW$T$23, DW_AT_decl_line(0x69)
    2090                    .dwattr $C$DW$T$23, DW_AT_decl_column(0x03)
    2091            
    2092            $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    2093                    .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    2094                    .dwattr $C$DW$T$24, DW_AT_address_class(0x14)
    2095            
    2096            
    2097            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2098                    .dwattr $C$DW$T$22, DW_AT_name("RTC_A_configureCalendarAlarmParam")
    2099                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    2100            $C$DW$137       .dwtag  DW_TAG_member
    2101                    .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2102                    .dwattr $C$DW$137, DW_AT_name("minutesAlarm")
    2103                    .dwattr $C$DW$137, DW_AT_TI_symbol_name("minutesAlarm")
    2104                    .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2105                    .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2106                    .dwattr $C$DW$137, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
    2107                    .dwattr $C$DW$137, DW_AT_decl_line(0x44)
    2108                    .dwattr $C$DW$137, DW_AT_decl_column(0x0d)
    2109            
    2110            $C$DW$138       .dwtag  DW_TAG_member
    2111                    .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2112                    .dwattr $C$DW$138, DW_AT_name("hoursAlarm")
    2113                    .dwattr $C$DW$138, DW_AT_TI_symbol_name("hoursAlarm")
    2114                    .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2115                    .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2116                    .dwattr $C$DW$138, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
    2117                    .dwattr $C$DW$138, DW_AT_decl_line(0x48)
    2118                    .dwattr $C$DW$138, DW_AT_decl_column(0x0d)
    2119            
    2120            $C$DW$139       .dwtag  DW_TAG_member
    2121                    .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2122                    .dwattr $C$DW$139, DW_AT_name("dayOfWeekAlarm")
    2123                    .dwattr $C$DW$139, DW_AT_TI_symbol_name("dayOfWeekAlarm")
    2124                    .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2125                    .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2126                    .dwattr $C$DW$139, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
    2127                    .dwattr $C$DW$139, DW_AT_decl_line(0x4c)
    2128                    .dwattr $C$DW$139, DW_AT_decl_column(0x0d)
    2129            
    2130            $C$DW$140       .dwtag  DW_TAG_member
    2131                    .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2132                    .dwattr $C$DW$140, DW_AT_name("dayOfMonthAlarm")
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:09 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\042802                             PAGE   42

    2133                    .dwattr $C$DW$140, DW_AT_TI_symbol_name("dayOfMonthAlarm")
    2134                    .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2135                    .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2136                    .dwattr $C$DW$140, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
    2137                    .dwattr $C$DW$140, DW_AT_decl_line(0x50)
    2138                    .dwattr $C$DW$140, DW_AT_decl_column(0x0d)
    2139            
    2140                    .dwattr $C$DW$T$22, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
    2141                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x3f)
    2142                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    2143                    .dwendtag $C$DW$T$22
    2144            
    2145            $C$DW$T$28      .dwtag  DW_TAG_typedef
    2146                    .dwattr $C$DW$T$28, DW_AT_name("RTC_A_configureCalendarAlarmParam")
    2147                    .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$22)
    2148                    .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    2149                    .dwattr $C$DW$T$28, DW_AT_decl_file("..\MSP430F5xx_6xx\rtc_a.h")
    2150                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x51)
    2151                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
    2152            
    2153            $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    2154                    .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    2155                    .dwattr $C$DW$T$29, DW_AT_address_class(0x14)
    2156            
    2157            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2158                    .dwattr $C$DW$T$2, DW_AT_name("void")
    2159            
    2160            
    2161            $C$DW$T$41      .dwtag  DW_TAG_subroutine_type
    2162                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2163                    .dwendtag $C$DW$T$41
    2164            
    2165            $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    2166                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    2167                    .dwattr $C$DW$T$42, DW_AT_address_class(0x14)
    2168            
    2169            $C$DW$T$43      .dwtag  DW_TAG_typedef
    2170                    .dwattr $C$DW$T$43, DW_AT_name("__SFR_FARPTR")
    2171                    .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2172                    .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2173                    .dwattr $C$DW$T$43, DW_AT_decl_file("D:\ti\ccsv6\ccs_base\msp430\include\msp430f5529.h")
    2174                    .dwattr $C$DW$T$43, DW_AT_decl_line(0x47)
    2175                    .dwattr $C$DW$T$43, DW_AT_decl_column(0x11)
    2176            
    2177            $C$DW$T$4       .dwtag  DW_TAG_base_type
    2178                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2179                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    2180                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2181            
    2182            $C$DW$T$5       .dwtag  DW_TAG_base_type
    2183                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2184                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2185                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2186            
    2187            $C$DW$T$44      .dwtag  DW_TAG_typedef
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:09 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\042802                             PAGE   43

    2188                    .dwattr $C$DW$T$44, DW_AT_name("int8_t")
    2189                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$5)
    2190                    .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2191                    .dwattr $C$DW$T$44, DW_AT_decl_file("D:/ti/ccsv6/tools/compiler/msp430_15.12.3.LTS/include/std
    2192                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x2a)
    2193                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x1e)
