MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:22 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\138882                            PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                       PC v15.12.3.LTS *
       3            ;* Date/Time created: Wed Oct 12 11:20:22 2016                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../MSP430F5xx_6xx/timer_b.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 2003-2
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Programmeerimine\Code Composer WS\CardReader\src\Debug")
      12            ;       D:\Program Files\TI CCSv6\ccsv6\tools\compiler\msp430_15.12.3.LTS\bin\opt430.exe D:/Programmee
      13 000000               .sect   ".text:Timer_B_startCounter"
      14                    .clink
      15                    .global Timer_B_startCounter

    2209            ;*   Regs Used         : SP,SR,r12,r13,r14,r15                               *
    2210            ;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
    2211            ;*****************************************************************************
    2212 000000       Timer_B_setOutputMode:
    2213            ;* --------------------------------------------------------------------------*
    2214                    .dwcfi  cfa_offset, 4
    2215                    .dwcfi  save_reg_to_mem, 16, -4
    2216            ;* r12   assigned to baseAddress
    2217            $C$DW$151       .dwtag  DW_TAG_variable
    2218                    .dwattr $C$DW$151, DW_AT_name("baseAddress")
    2219                    .dwattr $C$DW$151, DW_AT_TI_symbol_name("baseAddress")
    2220                    .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2221                    .dwattr $C$DW$151, DW_AT_location[DW_OP_reg12]
    2222            
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:22 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\138882                            PAGE   44

    2223            ;* r13   assigned to compareRegister
    2224            $C$DW$152       .dwtag  DW_TAG_variable
    2225                    .dwattr $C$DW$152, DW_AT_name("compareRegister")
    2226                    .dwattr $C$DW$152, DW_AT_TI_symbol_name("compareRegister")
    2227                    .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2228                    .dwattr $C$DW$152, DW_AT_location[DW_OP_reg13]
    2229            
    2230            ;* r15   assigned to compareOutputMode
    2231            $C$DW$153       .dwtag  DW_TAG_variable
    2232                    .dwattr $C$DW$153, DW_AT_name("compareOutputMode")
    2233                    .dwattr $C$DW$153, DW_AT_TI_symbol_name("compareOutputMode")
    2234                    .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2235                    .dwattr $C$DW$153, DW_AT_location[DW_OP_reg15]
    2236            
    2237            ;* r14   assigned to temp
    2238            $C$DW$154       .dwtag  DW_TAG_variable
    2239                    .dwattr $C$DW$154, DW_AT_name("temp")
    2240                    .dwattr $C$DW$154, DW_AT_TI_symbol_name("temp")
    2241                    .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2242                    .dwattr $C$DW$154, DW_AT_location[DW_OP_reg14]
    2243            
    2244 000000 0ECF          MOVA      r14,r15               ; [] |397| 
    2245                    .dwpsn  file "../MSP430F5xx_6xx/timer_b.c",line 398,column 19,is_stmt,isa 0
    2246 000002 0CCE          MOVA      r12,r14               ; [] |398| 
    2247 000004 5D0E          ADD.W     r13,r14               ; [] |398| 
    2248 000006 4E2E          MOV.W     @r14,r14              ; [] |398| 
    2249                    .dwpsn  file "../MSP430F5xx_6xx/timer_b.c",line 399,column 5,is_stmt,isa 0
    2250 000008 F03E          AND.W     #65311,r14            ; [] |399| 
         00000a FF1F 
    2251 00000c DF0E          OR.W      r15,r14               ; [] |399| 
    2252 00000e 5D0C          ADD.W     r13,r12               ; [] |399| 
    2253 000010 4E8C          MOV.W     r14,0(r12)            ; [] |399| 
         000012 0000 
    2254                    .dwpsn  file "../MSP430F5xx_6xx/timer_b.c",line 401,column 1,is_stmt,isa 0
    2255            $C$DW$155       .dwtag  DW_TAG_TI_branch
    2256                    .dwattr $C$DW$155, DW_AT_low_pc(0x00)
    2257                    .dwattr $C$DW$155, DW_AT_TI_return
    2258            
    2259 000014 0110          RETA      ; [] 
    2260                    ; [] 
    2261                    .dwattr $C$DW$147, DW_AT_TI_end_file("../MSP430F5xx_6xx/timer_b.c")
    2262                    .dwattr $C$DW$147, DW_AT_TI_end_line(0x191)
    2263                    .dwattr $C$DW$147, DW_AT_TI_end_column(0x01)
    2264                    .dwendentry
    2265                    .dwendtag $C$DW$147
    2266            
    2267            
    2268            ;******************************************************************************
    2269            ;* BUILD ATTRIBUTES                                                           *
    2270            ;******************************************************************************
    2271                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
    2272                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000001111000000000
    2273                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
    2274                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
    2275                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:22 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\138882                            PAGE   45

    2276                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
    2277            
    2278            ;******************************************************************************
    2279            ;* TYPE INFORMATION                                                           *
    2280            ;******************************************************************************
    2281            
    2282            $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2283                    .dwattr $C$DW$T$20, DW_AT_name("Timer_B_initCaptureModeParam")
    2284                    .dwattr $C$DW$T$20, DW_AT_byte_size(0x0c)
    2285            $C$DW$156       .dwtag  DW_TAG_member
    2286                    .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2287                    .dwattr $C$DW$156, DW_AT_name("captureRegister")
    2288                    .dwattr $C$DW$156, DW_AT_TI_symbol_name("captureRegister")
    2289                    .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2290                    .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2291                    .dwattr $C$DW$156, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2292                    .dwattr $C$DW$156, DW_AT_decl_line(0xd1)
    2293                    .dwattr $C$DW$156, DW_AT_decl_column(0x0e)
    2294            
    2295            $C$DW$157       .dwtag  DW_TAG_member
    2296                    .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2297                    .dwattr $C$DW$157, DW_AT_name("captureMode")
    2298                    .dwattr $C$DW$157, DW_AT_TI_symbol_name("captureMode")
    2299                    .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2300                    .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2301                    .dwattr $C$DW$157, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2302                    .dwattr $C$DW$157, DW_AT_decl_line(0xd8)
    2303                    .dwattr $C$DW$157, DW_AT_decl_column(0x0e)
    2304            
    2305            $C$DW$158       .dwtag  DW_TAG_member
    2306                    .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2307                    .dwattr $C$DW$158, DW_AT_name("captureInputSelect")
    2308                    .dwattr $C$DW$158, DW_AT_TI_symbol_name("captureInputSelect")
    2309                    .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2310                    .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2311                    .dwattr $C$DW$158, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2312                    .dwattr $C$DW$158, DW_AT_decl_line(0xdf)
    2313                    .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    2314            
    2315            $C$DW$159       .dwtag  DW_TAG_member
    2316                    .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2317                    .dwattr $C$DW$159, DW_AT_name("synchronizeCaptureSource")
    2318                    .dwattr $C$DW$159, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    2319                    .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2320                    .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2321                    .dwattr $C$DW$159, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2322                    .dwattr $C$DW$159, DW_AT_decl_line(0xe4)
    2323                    .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    2324            
    2325            $C$DW$160       .dwtag  DW_TAG_member
    2326                    .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2327                    .dwattr $C$DW$160, DW_AT_name("captureInterruptEnable")
    2328                    .dwattr $C$DW$160, DW_AT_TI_symbol_name("captureInterruptEnable")
    2329                    .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2330                    .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:22 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\138882                            PAGE   46

    2331                    .dwattr $C$DW$160, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2332                    .dwattr $C$DW$160, DW_AT_decl_line(0xe9)
    2333                    .dwattr $C$DW$160, DW_AT_decl_column(0x0e)
    2334            
    2335            $C$DW$161       .dwtag  DW_TAG_member
    2336                    .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2337                    .dwattr $C$DW$161, DW_AT_name("captureOutputMode")
    2338                    .dwattr $C$DW$161, DW_AT_TI_symbol_name("captureOutputMode")
    2339                    .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2340                    .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2341                    .dwattr $C$DW$161, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2342                    .dwattr $C$DW$161, DW_AT_decl_line(0xf4)
    2343                    .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    2344            
    2345                    .dwattr $C$DW$T$20, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2346                    .dwattr $C$DW$T$20, DW_AT_decl_line(0xc5)
    2347                    .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    2348                    .dwendtag $C$DW$T$20
    2349            
    2350            $C$DW$T$27      .dwtag  DW_TAG_typedef
    2351                    .dwattr $C$DW$T$27, DW_AT_name("Timer_B_initCaptureModeParam")
    2352                    .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$20)
    2353                    .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    2354                    .dwattr $C$DW$T$27, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2355                    .dwattr $C$DW$T$27, DW_AT_decl_line(0xf5)
    2356                    .dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
    2357            
    2358            $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    2359                    .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    2360                    .dwattr $C$DW$T$28, DW_AT_address_class(0x14)
    2361            
    2362            
    2363            $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2364                    .dwattr $C$DW$T$21, DW_AT_name("Timer_B_initCompareModeParam")
    2365                    .dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
    2366            $C$DW$162       .dwtag  DW_TAG_member
    2367                    .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2368                    .dwattr $C$DW$162, DW_AT_name("compareRegister")
    2369                    .dwattr $C$DW$162, DW_AT_TI_symbol_name("compareRegister")
    2370                    .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2371                    .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2372                    .dwattr $C$DW$162, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2373                    .dwattr $C$DW$162, DW_AT_decl_line(0x17a)
    2374                    .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    2375            
    2376            $C$DW$163       .dwtag  DW_TAG_member
    2377                    .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2378                    .dwattr $C$DW$163, DW_AT_name("compareInterruptEnable")
    2379                    .dwattr $C$DW$163, DW_AT_TI_symbol_name("compareInterruptEnable")
    2380                    .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2381                    .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2382                    .dwattr $C$DW$163, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2383                    .dwattr $C$DW$163, DW_AT_decl_line(0x17f)
    2384                    .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    2385            
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:22 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\138882                            PAGE   47

    2386            $C$DW$164       .dwtag  DW_TAG_member
    2387                    .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2388                    .dwattr $C$DW$164, DW_AT_name("compareOutputMode")
    2389                    .dwattr $C$DW$164, DW_AT_TI_symbol_name("compareOutputMode")
    2390                    .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2391                    .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2392                    .dwattr $C$DW$164, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2393                    .dwattr $C$DW$164, DW_AT_decl_line(0x18a)
    2394                    .dwattr $C$DW$164, DW_AT_decl_column(0x0e)
    2395            
    2396            $C$DW$165       .dwtag  DW_TAG_member
    2397                    .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2398                    .dwattr $C$DW$165, DW_AT_name("compareValue")
    2399                    .dwattr $C$DW$165, DW_AT_TI_symbol_name("compareValue")
    2400                    .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2401                    .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2402                    .dwattr $C$DW$165, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2403                    .dwattr $C$DW$165, DW_AT_decl_line(0x18c)
    2404                    .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    2405            
    2406                    .dwattr $C$DW$T$21, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2407                    .dwattr $C$DW$T$21, DW_AT_decl_line(0x16e)
    2408                    .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    2409                    .dwendtag $C$DW$T$21
    2410            
    2411            $C$DW$T$30      .dwtag  DW_TAG_typedef
    2412                    .dwattr $C$DW$T$30, DW_AT_name("Timer_B_initCompareModeParam")
    2413                    .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$21)
    2414                    .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2415                    .dwattr $C$DW$T$30, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2416                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x18d)
    2417                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
    2418            
    2419            $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    2420                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    2421                    .dwattr $C$DW$T$31, DW_AT_address_class(0x14)
    2422            
    2423            
    2424            $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2425                    .dwattr $C$DW$T$23, DW_AT_name("Timer_B_initContinuousModeParam")
    2426                    .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
    2427            $C$DW$166       .dwtag  DW_TAG_member
    2428                    .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2429                    .dwattr $C$DW$166, DW_AT_name("clockSource")
    2430                    .dwattr $C$DW$166, DW_AT_TI_symbol_name("clockSource")
    2431                    .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2432                    .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2433                    .dwattr $C$DW$166, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2434                    .dwattr $C$DW$166, DW_AT_decl_line(0x105)
    2435                    .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    2436            
    2437            $C$DW$167       .dwtag  DW_TAG_member
    2438                    .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2439                    .dwattr $C$DW$167, DW_AT_name("clockSourceDivider")
    2440                    .dwattr $C$DW$167, DW_AT_TI_symbol_name("clockSourceDivider")
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:22 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\138882                            PAGE   48

    2441                    .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2442                    .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2443                    .dwattr $C$DW$167, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2444                    .dwattr $C$DW$167, DW_AT_decl_line(0x11c)
    2445                    .dwattr $C$DW$167, DW_AT_decl_column(0x0e)
    2446            
    2447            $C$DW$168       .dwtag  DW_TAG_member
    2448                    .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2449                    .dwattr $C$DW$168, DW_AT_name("timerInterruptEnable_TBIE")
    2450                    .dwattr $C$DW$168, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    2451                    .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2452                    .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2453                    .dwattr $C$DW$168, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2454                    .dwattr $C$DW$168, DW_AT_decl_line(0x121)
    2455                    .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    2456            
    2457            $C$DW$169       .dwtag  DW_TAG_member
    2458                    .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2459                    .dwattr $C$DW$169, DW_AT_name("timerClear")
    2460                    .dwattr $C$DW$169, DW_AT_TI_symbol_name("timerClear")
    2461                    .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2462                    .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2463                    .dwattr $C$DW$169, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2464                    .dwattr $C$DW$169, DW_AT_decl_line(0x127)
    2465                    .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    2466            
    2467            $C$DW$170       .dwtag  DW_TAG_member
    2468                    .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
    2469                    .dwattr $C$DW$170, DW_AT_name("startTimer")
    2470                    .dwattr $C$DW$170, DW_AT_TI_symbol_name("startTimer")
    2471                    .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2472                    .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2473                    .dwattr $C$DW$170, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2474                    .dwattr $C$DW$170, DW_AT_decl_line(0x129)
    2475                    .dwattr $C$DW$170, DW_AT_decl_column(0x0a)
    2476            
    2477                    .dwattr $C$DW$T$23, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2478                    .dwattr $C$DW$T$23, DW_AT_decl_line(0xfd)
    2479                    .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    2480                    .dwendtag $C$DW$T$23
    2481            
    2482            $C$DW$T$33      .dwtag  DW_TAG_typedef
    2483                    .dwattr $C$DW$T$33, DW_AT_name("Timer_B_initContinuousModeParam")
    2484                    .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$23)
    2485                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2486                    .dwattr $C$DW$T$33, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2487                    .dwattr $C$DW$T$33, DW_AT_decl_line(0x12a)
    2488                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x03)
    2489            
    2490            $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    2491                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2492                    .dwattr $C$DW$T$34, DW_AT_address_class(0x14)
    2493            
    2494            
    2495            $C$DW$T$24      .dwtag  DW_TAG_structure_type
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:22 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\138882                            PAGE   49

    2496                    .dwattr $C$DW$T$24, DW_AT_name("Timer_B_initUpDownModeParam")
    2497                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x0e)
    2498            $C$DW$171       .dwtag  DW_TAG_member
    2499                    .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2500                    .dwattr $C$DW$171, DW_AT_name("clockSource")
    2501                    .dwattr $C$DW$171, DW_AT_TI_symbol_name("clockSource")
    2502                    .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2503                    .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2504                    .dwattr $C$DW$171, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2505                    .dwattr $C$DW$171, DW_AT_decl_line(0x13a)
    2506                    .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    2507            
    2508            $C$DW$172       .dwtag  DW_TAG_member
    2509                    .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2510                    .dwattr $C$DW$172, DW_AT_name("clockSourceDivider")
    2511                    .dwattr $C$DW$172, DW_AT_TI_symbol_name("clockSourceDivider")
    2512                    .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2513                    .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2514                    .dwattr $C$DW$172, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2515                    .dwattr $C$DW$172, DW_AT_decl_line(0x151)
    2516                    .dwattr $C$DW$172, DW_AT_decl_column(0x0e)
    2517            
    2518            $C$DW$173       .dwtag  DW_TAG_member
    2519                    .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2520                    .dwattr $C$DW$173, DW_AT_name("timerPeriod")
    2521                    .dwattr $C$DW$173, DW_AT_TI_symbol_name("timerPeriod")
    2522                    .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2523                    .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2524                    .dwattr $C$DW$173, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2525                    .dwattr $C$DW$173, DW_AT_decl_line(0x153)
    2526                    .dwattr $C$DW$173, DW_AT_decl_column(0x0e)
    2527            
    2528            $C$DW$174       .dwtag  DW_TAG_member
    2529                    .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2530                    .dwattr $C$DW$174, DW_AT_name("timerInterruptEnable_TBIE")
    2531                    .dwattr $C$DW$174, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    2532                    .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2533                    .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2534                    .dwattr $C$DW$174, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2535                    .dwattr $C$DW$174, DW_AT_decl_line(0x158)
    2536                    .dwattr $C$DW$174, DW_AT_decl_column(0x0e)
    2537            
    2538            $C$DW$175       .dwtag  DW_TAG_member
    2539                    .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2540                    .dwattr $C$DW$175, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    2541                    .dwattr $C$DW$175, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    2542                    .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2543                    .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2544                    .dwattr $C$DW$175, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2545                    .dwattr $C$DW$175, DW_AT_decl_line(0x15d)
    2546                    .dwattr $C$DW$175, DW_AT_decl_column(0x0e)
    2547            
    2548            $C$DW$176       .dwtag  DW_TAG_member
    2549                    .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2550                    .dwattr $C$DW$176, DW_AT_name("timerClear")
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:22 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\138882                            PAGE   50

    2551                    .dwattr $C$DW$176, DW_AT_TI_symbol_name("timerClear")
    2552                    .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2553                    .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2554                    .dwattr $C$DW$176, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2555                    .dwattr $C$DW$176, DW_AT_decl_line(0x163)
    2556                    .dwattr $C$DW$176, DW_AT_decl_column(0x0e)
    2557            
    2558            $C$DW$177       .dwtag  DW_TAG_member
    2559                    .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
    2560                    .dwattr $C$DW$177, DW_AT_name("startTimer")
    2561                    .dwattr $C$DW$177, DW_AT_TI_symbol_name("startTimer")
    2562                    .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2563                    .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2564                    .dwattr $C$DW$177, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2565                    .dwattr $C$DW$177, DW_AT_decl_line(0x165)
    2566                    .dwattr $C$DW$177, DW_AT_decl_column(0x0a)
    2567            
    2568                    .dwattr $C$DW$T$24, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2569                    .dwattr $C$DW$T$24, DW_AT_decl_line(0x132)
    2570                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    2571                    .dwendtag $C$DW$T$24
    2572            
    2573            $C$DW$T$36      .dwtag  DW_TAG_typedef
    2574                    .dwattr $C$DW$T$36, DW_AT_name("Timer_B_initUpDownModeParam")
    2575                    .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$24)
    2576                    .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    2577                    .dwattr $C$DW$T$36, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2578                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x166)
    2579                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x03)
    2580            
    2581            $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    2582                    .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2583                    .dwattr $C$DW$T$37, DW_AT_address_class(0x14)
    2584            
    2585            
    2586            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2587                    .dwattr $C$DW$T$25, DW_AT_name("Timer_B_initUpModeParam")
    2588                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
    2589            $C$DW$178       .dwtag  DW_TAG_member
    2590                    .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2591                    .dwattr $C$DW$178, DW_AT_name("clockSource")
    2592                    .dwattr $C$DW$178, DW_AT_TI_symbol_name("clockSource")
    2593                    .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2594                    .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2595                    .dwattr $C$DW$178, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2596                    .dwattr $C$DW$178, DW_AT_decl_line(0x90)
    2597                    .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    2598            
    2599            $C$DW$179       .dwtag  DW_TAG_member
    2600                    .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2601                    .dwattr $C$DW$179, DW_AT_name("clockSourceDivider")
    2602                    .dwattr $C$DW$179, DW_AT_TI_symbol_name("clockSourceDivider")
    2603                    .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2604                    .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2605                    .dwattr $C$DW$179, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:22 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\138882                            PAGE   51

    2606                    .dwattr $C$DW$179, DW_AT_decl_line(0xa7)
    2607                    .dwattr $C$DW$179, DW_AT_decl_column(0x0e)
    2608            
    2609            $C$DW$180       .dwtag  DW_TAG_member
    2610                    .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2611                    .dwattr $C$DW$180, DW_AT_name("timerPeriod")
    2612                    .dwattr $C$DW$180, DW_AT_TI_symbol_name("timerPeriod")
    2613                    .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2614                    .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2615                    .dwattr $C$DW$180, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2616                    .dwattr $C$DW$180, DW_AT_decl_line(0xaa)
    2617                    .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    2618            
    2619            $C$DW$181       .dwtag  DW_TAG_member
    2620                    .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2621                    .dwattr $C$DW$181, DW_AT_name("timerInterruptEnable_TBIE")
    2622                    .dwattr $C$DW$181, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    2623                    .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2624                    .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2625                    .dwattr $C$DW$181, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2626                    .dwattr $C$DW$181, DW_AT_decl_line(0xaf)
    2627                    .dwattr $C$DW$181, DW_AT_decl_column(0x0e)
    2628            
    2629            $C$DW$182       .dwtag  DW_TAG_member
    2630                    .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2631                    .dwattr $C$DW$182, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    2632                    .dwattr $C$DW$182, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    2633                    .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2634                    .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2635                    .dwattr $C$DW$182, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2636                    .dwattr $C$DW$182, DW_AT_decl_line(0xb4)
    2637                    .dwattr $C$DW$182, DW_AT_decl_column(0x0e)
    2638            
    2639            $C$DW$183       .dwtag  DW_TAG_member
    2640                    .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2641                    .dwattr $C$DW$183, DW_AT_name("timerClear")
    2642                    .dwattr $C$DW$183, DW_AT_TI_symbol_name("timerClear")
    2643                    .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2644                    .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2645                    .dwattr $C$DW$183, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2646                    .dwattr $C$DW$183, DW_AT_decl_line(0xba)
    2647                    .dwattr $C$DW$183, DW_AT_decl_column(0x0e)
    2648            
    2649            $C$DW$184       .dwtag  DW_TAG_member
    2650                    .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$22)
    2651                    .dwattr $C$DW$184, DW_AT_name("startTimer")
    2652                    .dwattr $C$DW$184, DW_AT_TI_symbol_name("startTimer")
    2653                    .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2654                    .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2655                    .dwattr $C$DW$184, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2656                    .dwattr $C$DW$184, DW_AT_decl_line(0xbc)
    2657                    .dwattr $C$DW$184, DW_AT_decl_column(0x0a)
    2658            
    2659                    .dwattr $C$DW$T$25, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2660                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x88)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:22 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\138882                            PAGE   52

    2661                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    2662                    .dwendtag $C$DW$T$25
    2663            
    2664            $C$DW$T$39      .dwtag  DW_TAG_typedef
    2665                    .dwattr $C$DW$T$39, DW_AT_name("Timer_B_initUpModeParam")
    2666                    .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$25)
    2667                    .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    2668                    .dwattr $C$DW$T$39, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2669                    .dwattr $C$DW$T$39, DW_AT_decl_line(0xbd)
    2670                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x03)
    2671            
    2672            $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    2673                    .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    2674                    .dwattr $C$DW$T$40, DW_AT_address_class(0x14)
    2675            
    2676            
    2677            $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2678                    .dwattr $C$DW$T$26, DW_AT_name("Timer_B_outputPWMParam")
    2679                    .dwattr $C$DW$T$26, DW_AT_byte_size(0x0c)
    2680            $C$DW$185       .dwtag  DW_TAG_member
    2681                    .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2682                    .dwattr $C$DW$185, DW_AT_name("clockSource")
    2683                    .dwattr $C$DW$185, DW_AT_TI_symbol_name("clockSource")
    2684                    .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2685                    .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2686                    .dwattr $C$DW$185, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2687                    .dwattr $C$DW$185, DW_AT_decl_line(0x4f)
    2688                    .dwattr $C$DW$185, DW_AT_decl_column(0x0e)
    2689            
    2690            $C$DW$186       .dwtag  DW_TAG_member
    2691                    .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2692                    .dwattr $C$DW$186, DW_AT_name("clockSourceDivider")
    2693                    .dwattr $C$DW$186, DW_AT_TI_symbol_name("clockSourceDivider")
    2694                    .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2695                    .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2696                    .dwattr $C$DW$186, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2697                    .dwattr $C$DW$186, DW_AT_decl_line(0x66)
    2698                    .dwattr $C$DW$186, DW_AT_decl_column(0x0e)
    2699            
    2700            $C$DW$187       .dwtag  DW_TAG_member
    2701                    .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2702                    .dwattr $C$DW$187, DW_AT_name("timerPeriod")
    2703                    .dwattr $C$DW$187, DW_AT_TI_symbol_name("timerPeriod")
    2704                    .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2705                    .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2706                    .dwattr $C$DW$187, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2707                    .dwattr $C$DW$187, DW_AT_decl_line(0x68)
    2708                    .dwattr $C$DW$187, DW_AT_decl_column(0x0e)
    2709            
    2710            $C$DW$188       .dwtag  DW_TAG_member
    2711                    .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2712                    .dwattr $C$DW$188, DW_AT_name("compareRegister")
    2713                    .dwattr $C$DW$188, DW_AT_TI_symbol_name("compareRegister")
    2714                    .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2715                    .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:22 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\138882                            PAGE   53

    2716                    .dwattr $C$DW$188, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2717                    .dwattr $C$DW$188, DW_AT_decl_line(0x73)
    2718                    .dwattr $C$DW$188, DW_AT_decl_column(0x0e)
    2719            
    2720            $C$DW$189       .dwtag  DW_TAG_member
    2721                    .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2722                    .dwattr $C$DW$189, DW_AT_name("compareOutputMode")
    2723                    .dwattr $C$DW$189, DW_AT_TI_symbol_name("compareOutputMode")
    2724                    .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2725                    .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2726                    .dwattr $C$DW$189, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2727                    .dwattr $C$DW$189, DW_AT_decl_line(0x7e)
    2728                    .dwattr $C$DW$189, DW_AT_decl_column(0x0e)
    2729            
    2730            $C$DW$190       .dwtag  DW_TAG_member
    2731                    .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2732                    .dwattr $C$DW$190, DW_AT_name("dutyCycle")
    2733                    .dwattr $C$DW$190, DW_AT_TI_symbol_name("dutyCycle")
    2734                    .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2735                    .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2736                    .dwattr $C$DW$190, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2737                    .dwattr $C$DW$190, DW_AT_decl_line(0x80)
    2738                    .dwattr $C$DW$190, DW_AT_decl_column(0x0e)
    2739            
    2740                    .dwattr $C$DW$T$26, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2741                    .dwattr $C$DW$T$26, DW_AT_decl_line(0x47)
    2742                    .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    2743                    .dwendtag $C$DW$T$26
    2744            
    2745            $C$DW$T$42      .dwtag  DW_TAG_typedef
    2746                    .dwattr $C$DW$T$42, DW_AT_name("Timer_B_outputPWMParam")
    2747                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$26)
    2748                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    2749                    .dwattr $C$DW$T$42, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_b.h")
    2750                    .dwattr $C$DW$T$42, DW_AT_decl_line(0x81)
    2751                    .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
    2752            
    2753            $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    2754                    .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2755                    .dwattr $C$DW$T$43, DW_AT_address_class(0x14)
    2756            
    2757            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2758                    .dwattr $C$DW$T$2, DW_AT_name("void")
    2759            
    2760            
    2761            $C$DW$T$56      .dwtag  DW_TAG_subroutine_type
    2762                    .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2763                    .dwendtag $C$DW$T$56
    2764            
    2765            $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    2766                    .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    2767                    .dwattr $C$DW$T$57, DW_AT_address_class(0x14)
    2768            
    2769            $C$DW$T$58      .dwtag  DW_TAG_typedef
    2770                    .dwattr $C$DW$T$58, DW_AT_name("__SFR_FARPTR")
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:22 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\138882                            PAGE   54

    2771                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2772                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2773                    .dwattr $C$DW$T$58, DW_AT_decl_file("D:\Program Files\TI CCSv6\ccsv6\ccs_base\msp430\include\m
    2774                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x47)
    2775                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x11)
    2776            
    2777            $C$DW$T$4       .dwtag  DW_TAG_base_type
    2778                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2779                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    2780                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2781            
    2782            $C$DW$T$5       .dwtag  DW_TAG_base_type
    2783                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2784                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2785                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2786            
    2787            $C$DW$T$59      .dwtag  DW_TAG_typedef
    2788                    .dwattr $C$DW$T$59, DW_AT_name("int8_t")
    2789                    .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$5)
    2790                    .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2791                    .dwattr $C$DW$T$59, DW_AT_decl_file("D:/Program Files/TI CCSv6/ccsv6/tools/compiler/msp430_15.
    2792                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x2a)
    2793                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x1e)
