MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:21 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\054042                            PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                       PC v15.12.3.LTS *
       3            ;* Date/Time created: Wed Oct 12 11:20:21 2016                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../MSP430F5xx_6xx/timer_a.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 2003-2
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Programmeerimine\Code Composer WS\CardReader\src\Debug")
      12            ;       D:\Program Files\TI CCSv6\ccsv6\tools\compiler\msp430_15.12.3.LTS\bin\opt430.exe D:/Programmee
      13 000000               .sect   ".text:Timer_A_startCounter"
      14                    .clink
      15                    .global Timer_A_startCounter

    1968            ;*   Loop closing brace source line  : 369
    1969            ;*   Known Minimum Trip Count        : 1
    1970            ;*   Known Maximum Trip Count        : 4294967295
    1971            ;*   Known Max Trip Count Factor     : 1
    1972            ;* --------------------------------------------------------------------------*
    1973 000008       $C$L11:    
    1974                    .dwpsn  file "../MSP430F5xx_6xx/timer_a.c",line 354,column 9,is_stmt,isa 0
    1975 000008 0FCE          MOVA      r15,r14               ; [] |354| 
    1976                    .dwpsn  file "../MSP430F5xx_6xx/timer_a.c",line 355,column 9,is_stmt,isa 0
    1977 00000a 0CCF          MOVA      r12,r15               ; [] |355| 
    1978 00000c 503F          ADD.W     #16,r15               ; [] |355| 
         00000e 0010 
    1979 000010 4F2F          MOV.W     @r15,r15              ; [] |355| 
    1980                    .dwpsn  file "../MSP430F5xx_6xx/timer_a.c",line 359,column 13,is_stmt,isa 0
    1981 000012 9F0E          CMP.W     r15,r14               ; [] |359| 
    1982 000014 2C03          JHS       $C$L12                ; [] |359| 
    1983                                                      ; [] |359| 
    1984            ;* --------------------------------------------------------------------------*
    1985 000016 0FCD          MOVA      r15,r13               ; [] |359| 
    1986 000018 8E0D          SUB.W     r14,r13               ; [] |359| 
    1987 00001a 3C06          JMP       $C$L14                ; [] |359| 
    1988                                                      ; [] |359| 
    1989            ;* --------------------------------------------------------------------------*
    1990 00001c       $C$L12:    
    1991 00001c 9E0F          CMP.W     r14,r15               ; [] |359| 
    1992 00001e 2C03          JHS       $C$L13                ; [] |359| 
    1993                                                      ; [] |359| 
    1994            ;* --------------------------------------------------------------------------*
    1995 000020 0ECD          MOVA      r14,r13               ; [] |359| 
    1996 000022 8F0D          SUB.W     r15,r13               ; [] |359| 
    1997 000024 3C01          JMP       $C$L14                ; [] |359| 
    1998                                                      ; [] |359| 
    1999            ;* --------------------------------------------------------------------------*
    2000 000026       $C$L13:    
    2001 000026 430D          MOV.W     #0,r13                ; [] |359| 
    2002            ;* --------------------------------------------------------------------------*
    2003 000028       $C$L14:    
    2004                    .dwpsn  file "../MSP430F5xx_6xx/timer_a.c",line 370,column 11,is_stmt,isa 0
    2005 000028 903D          CMP.W     #51,r13               ; [] |370| 
         00002a 0033 
    2006 00002c 2FED          JHS       $C$L11                ; [] |370| 
    2007                                                      ; [] |370| 
    2008            ;* --------------------------------------------------------------------------*
    2009                    .dwpsn  file "../MSP430F5xx_6xx/timer_a.c",line 372,column 5,is_stmt,isa 0
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:21 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\054042                            PAGE   40

    2010 00002e 0FCC          MOVA      r15,r12               ; [] |372| 
    2011                    .dwpsn  file "../MSP430F5xx_6xx/timer_a.c",line 373,column 1,is_stmt,isa 0
    2012            $C$DW$135       .dwtag  DW_TAG_TI_branch
    2013                    .dwattr $C$DW$135, DW_AT_low_pc(0x00)
    2014                    .dwattr $C$DW$135, DW_AT_TI_return
    2015            
    2016 000030 0110          RETA      ; [] 
    2017                    ; [] 
    2018                    .dwattr $C$DW$129, DW_AT_TI_end_file("../MSP430F5xx_6xx/timer_a.c")
    2019                    .dwattr $C$DW$129, DW_AT_TI_end_line(0x175)
    2020                    .dwattr $C$DW$129, DW_AT_TI_end_column(0x01)
    2021                    .dwendentry
    2022                    .dwendtag $C$DW$129
    2023            
    2024            
    2025            ;******************************************************************************
    2026            ;* BUILD ATTRIBUTES                                                           *
    2027            ;******************************************************************************
    2028                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
    2029                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000001111000000000
    2030                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
    2031                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
    2032                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
    2033                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
    2034            
    2035            ;******************************************************************************
    2036            ;* TYPE INFORMATION                                                           *
    2037            ;******************************************************************************
    2038            
    2039            $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2040                    .dwattr $C$DW$T$20, DW_AT_name("Timer_A_initCaptureModeParam")
    2041                    .dwattr $C$DW$T$20, DW_AT_byte_size(0x0c)
    2042            $C$DW$136       .dwtag  DW_TAG_member
    2043                    .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2044                    .dwattr $C$DW$136, DW_AT_name("captureRegister")
    2045                    .dwattr $C$DW$136, DW_AT_TI_symbol_name("captureRegister")
    2046                    .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2047                    .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2048                    .dwattr $C$DW$136, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2049                    .dwattr $C$DW$136, DW_AT_decl_line(0x89)
    2050                    .dwattr $C$DW$136, DW_AT_decl_column(0x0e)
    2051            
    2052            $C$DW$137       .dwtag  DW_TAG_member
    2053                    .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2054                    .dwattr $C$DW$137, DW_AT_name("captureMode")
    2055                    .dwattr $C$DW$137, DW_AT_TI_symbol_name("captureMode")
    2056                    .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2057                    .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2058                    .dwattr $C$DW$137, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2059                    .dwattr $C$DW$137, DW_AT_decl_line(0x90)
    2060                    .dwattr $C$DW$137, DW_AT_decl_column(0x0e)
    2061            
    2062            $C$DW$138       .dwtag  DW_TAG_member
    2063                    .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2064                    .dwattr $C$DW$138, DW_AT_name("captureInputSelect")
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:21 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\054042                            PAGE   41

    2065                    .dwattr $C$DW$138, DW_AT_TI_symbol_name("captureInputSelect")
    2066                    .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2067                    .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2068                    .dwattr $C$DW$138, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2069                    .dwattr $C$DW$138, DW_AT_decl_line(0x97)
    2070                    .dwattr $C$DW$138, DW_AT_decl_column(0x0e)
    2071            
    2072            $C$DW$139       .dwtag  DW_TAG_member
    2073                    .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2074                    .dwattr $C$DW$139, DW_AT_name("synchronizeCaptureSource")
    2075                    .dwattr $C$DW$139, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    2076                    .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2077                    .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2078                    .dwattr $C$DW$139, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2079                    .dwattr $C$DW$139, DW_AT_decl_line(0x9c)
    2080                    .dwattr $C$DW$139, DW_AT_decl_column(0x0e)
    2081            
    2082            $C$DW$140       .dwtag  DW_TAG_member
    2083                    .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2084                    .dwattr $C$DW$140, DW_AT_name("captureInterruptEnable")
    2085                    .dwattr $C$DW$140, DW_AT_TI_symbol_name("captureInterruptEnable")
    2086                    .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2087                    .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2088                    .dwattr $C$DW$140, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2089                    .dwattr $C$DW$140, DW_AT_decl_line(0xa1)
    2090                    .dwattr $C$DW$140, DW_AT_decl_column(0x0e)
    2091            
    2092            $C$DW$141       .dwtag  DW_TAG_member
    2093                    .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2094                    .dwattr $C$DW$141, DW_AT_name("captureOutputMode")
    2095                    .dwattr $C$DW$141, DW_AT_TI_symbol_name("captureOutputMode")
    2096                    .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2097                    .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2098                    .dwattr $C$DW$141, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2099                    .dwattr $C$DW$141, DW_AT_decl_line(0xac)
    2100                    .dwattr $C$DW$141, DW_AT_decl_column(0x0e)
    2101            
    2102                    .dwattr $C$DW$T$20, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2103                    .dwattr $C$DW$T$20, DW_AT_decl_line(0x7d)
    2104                    .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    2105                    .dwendtag $C$DW$T$20
    2106            
    2107            $C$DW$T$27      .dwtag  DW_TAG_typedef
    2108                    .dwattr $C$DW$T$27, DW_AT_name("Timer_A_initCaptureModeParam")
    2109                    .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$20)
    2110                    .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    2111                    .dwattr $C$DW$T$27, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2112                    .dwattr $C$DW$T$27, DW_AT_decl_line(0xad)
    2113                    .dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
    2114            
    2115            $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    2116                    .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    2117                    .dwattr $C$DW$T$28, DW_AT_address_class(0x14)
    2118            
    2119            
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:21 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\054042                            PAGE   42

    2120            $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2121                    .dwattr $C$DW$T$21, DW_AT_name("Timer_A_initCompareModeParam")
    2122                    .dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
    2123            $C$DW$142       .dwtag  DW_TAG_member
    2124                    .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2125                    .dwattr $C$DW$142, DW_AT_name("compareRegister")
    2126                    .dwattr $C$DW$142, DW_AT_TI_symbol_name("compareRegister")
    2127                    .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2128                    .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2129                    .dwattr $C$DW$142, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2130                    .dwattr $C$DW$142, DW_AT_decl_line(0x17a)
    2131                    .dwattr $C$DW$142, DW_AT_decl_column(0x0e)
    2132            
    2133            $C$DW$143       .dwtag  DW_TAG_member
    2134                    .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2135                    .dwattr $C$DW$143, DW_AT_name("compareInterruptEnable")
    2136                    .dwattr $C$DW$143, DW_AT_TI_symbol_name("compareInterruptEnable")
    2137                    .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2138                    .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2139                    .dwattr $C$DW$143, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2140                    .dwattr $C$DW$143, DW_AT_decl_line(0x17f)
    2141                    .dwattr $C$DW$143, DW_AT_decl_column(0x0e)
    2142            
    2143            $C$DW$144       .dwtag  DW_TAG_member
    2144                    .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2145                    .dwattr $C$DW$144, DW_AT_name("compareOutputMode")
    2146                    .dwattr $C$DW$144, DW_AT_TI_symbol_name("compareOutputMode")
    2147                    .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2148                    .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2149                    .dwattr $C$DW$144, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2150                    .dwattr $C$DW$144, DW_AT_decl_line(0x18a)
    2151                    .dwattr $C$DW$144, DW_AT_decl_column(0x0e)
    2152            
    2153            $C$DW$145       .dwtag  DW_TAG_member
    2154                    .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2155                    .dwattr $C$DW$145, DW_AT_name("compareValue")
    2156                    .dwattr $C$DW$145, DW_AT_TI_symbol_name("compareValue")
    2157                    .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2158                    .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2159                    .dwattr $C$DW$145, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2160                    .dwattr $C$DW$145, DW_AT_decl_line(0x18c)
    2161                    .dwattr $C$DW$145, DW_AT_decl_column(0x0e)
    2162            
    2163                    .dwattr $C$DW$T$21, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2164                    .dwattr $C$DW$T$21, DW_AT_decl_line(0x16e)
    2165                    .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    2166                    .dwendtag $C$DW$T$21
    2167            
    2168            $C$DW$T$30      .dwtag  DW_TAG_typedef
    2169                    .dwattr $C$DW$T$30, DW_AT_name("Timer_A_initCompareModeParam")
    2170                    .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$21)
    2171                    .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2172                    .dwattr $C$DW$T$30, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2173                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x18d)
    2174                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:21 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\054042                            PAGE   43

    2175            
    2176            $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    2177                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    2178                    .dwattr $C$DW$T$31, DW_AT_address_class(0x14)
    2179            
    2180            
    2181            $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2182                    .dwattr $C$DW$T$23, DW_AT_name("Timer_A_initContinuousModeParam")
    2183                    .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
    2184            $C$DW$146       .dwtag  DW_TAG_member
    2185                    .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2186                    .dwattr $C$DW$146, DW_AT_name("clockSource")
    2187                    .dwattr $C$DW$146, DW_AT_TI_symbol_name("clockSource")
    2188                    .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2189                    .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2190                    .dwattr $C$DW$146, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2191                    .dwattr $C$DW$146, DW_AT_decl_line(0x50)
    2192                    .dwattr $C$DW$146, DW_AT_decl_column(0x0e)
    2193            
    2194            $C$DW$147       .dwtag  DW_TAG_member
    2195                    .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2196                    .dwattr $C$DW$147, DW_AT_name("clockSourceDivider")
    2197                    .dwattr $C$DW$147, DW_AT_TI_symbol_name("clockSourceDivider")
    2198                    .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2199                    .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2200                    .dwattr $C$DW$147, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2201                    .dwattr $C$DW$147, DW_AT_decl_line(0x67)
    2202                    .dwattr $C$DW$147, DW_AT_decl_column(0x0e)
    2203            
    2204            $C$DW$148       .dwtag  DW_TAG_member
    2205                    .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2206                    .dwattr $C$DW$148, DW_AT_name("timerInterruptEnable_TAIE")
    2207                    .dwattr $C$DW$148, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    2208                    .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2209                    .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2210                    .dwattr $C$DW$148, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2211                    .dwattr $C$DW$148, DW_AT_decl_line(0x6c)
    2212                    .dwattr $C$DW$148, DW_AT_decl_column(0x0e)
    2213            
    2214            $C$DW$149       .dwtag  DW_TAG_member
    2215                    .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2216                    .dwattr $C$DW$149, DW_AT_name("timerClear")
    2217                    .dwattr $C$DW$149, DW_AT_TI_symbol_name("timerClear")
    2218                    .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2219                    .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2220                    .dwattr $C$DW$149, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2221                    .dwattr $C$DW$149, DW_AT_decl_line(0x72)
    2222                    .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    2223            
    2224            $C$DW$150       .dwtag  DW_TAG_member
    2225                    .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$22)
    2226                    .dwattr $C$DW$150, DW_AT_name("startTimer")
    2227                    .dwattr $C$DW$150, DW_AT_TI_symbol_name("startTimer")
    2228                    .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2229                    .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:21 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\054042                            PAGE   44

    2230                    .dwattr $C$DW$150, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2231                    .dwattr $C$DW$150, DW_AT_decl_line(0x74)
    2232                    .dwattr $C$DW$150, DW_AT_decl_column(0x0a)
    2233            
    2234                    .dwattr $C$DW$T$23, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2235                    .dwattr $C$DW$T$23, DW_AT_decl_line(0x48)
    2236                    .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    2237                    .dwendtag $C$DW$T$23
    2238            
    2239            $C$DW$T$33      .dwtag  DW_TAG_typedef
    2240                    .dwattr $C$DW$T$33, DW_AT_name("Timer_A_initContinuousModeParam")
    2241                    .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$23)
    2242                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2243                    .dwattr $C$DW$T$33, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2244                    .dwattr $C$DW$T$33, DW_AT_decl_line(0x75)
    2245                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x03)
    2246            
    2247            $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    2248                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2249                    .dwattr $C$DW$T$34, DW_AT_address_class(0x14)
    2250            
    2251            
    2252            $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2253                    .dwattr $C$DW$T$24, DW_AT_name("Timer_A_initUpDownModeParam")
    2254                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x0e)
    2255            $C$DW$151       .dwtag  DW_TAG_member
    2256                    .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2257                    .dwattr $C$DW$151, DW_AT_name("clockSource")
    2258                    .dwattr $C$DW$151, DW_AT_TI_symbol_name("clockSource")
    2259                    .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2260                    .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2261                    .dwattr $C$DW$151, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2262                    .dwattr $C$DW$151, DW_AT_decl_line(0xbd)
    2263                    .dwattr $C$DW$151, DW_AT_decl_column(0x0e)
    2264            
    2265            $C$DW$152       .dwtag  DW_TAG_member
    2266                    .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2267                    .dwattr $C$DW$152, DW_AT_name("clockSourceDivider")
    2268                    .dwattr $C$DW$152, DW_AT_TI_symbol_name("clockSourceDivider")
    2269                    .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2270                    .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2271                    .dwattr $C$DW$152, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2272                    .dwattr $C$DW$152, DW_AT_decl_line(0xd4)
    2273                    .dwattr $C$DW$152, DW_AT_decl_column(0x0e)
    2274            
    2275            $C$DW$153       .dwtag  DW_TAG_member
    2276                    .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2277                    .dwattr $C$DW$153, DW_AT_name("timerPeriod")
    2278                    .dwattr $C$DW$153, DW_AT_TI_symbol_name("timerPeriod")
    2279                    .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2280                    .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2281                    .dwattr $C$DW$153, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2282                    .dwattr $C$DW$153, DW_AT_decl_line(0xd6)
    2283                    .dwattr $C$DW$153, DW_AT_decl_column(0x0e)
    2284            
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:21 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\054042                            PAGE   45

    2285            $C$DW$154       .dwtag  DW_TAG_member
    2286                    .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2287                    .dwattr $C$DW$154, DW_AT_name("timerInterruptEnable_TAIE")
    2288                    .dwattr $C$DW$154, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    2289                    .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2290                    .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2291                    .dwattr $C$DW$154, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2292                    .dwattr $C$DW$154, DW_AT_decl_line(0xdb)
    2293                    .dwattr $C$DW$154, DW_AT_decl_column(0x0e)
    2294            
    2295            $C$DW$155       .dwtag  DW_TAG_member
    2296                    .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2297                    .dwattr $C$DW$155, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    2298                    .dwattr $C$DW$155, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    2299                    .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2300                    .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2301                    .dwattr $C$DW$155, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2302                    .dwattr $C$DW$155, DW_AT_decl_line(0xe0)
    2303                    .dwattr $C$DW$155, DW_AT_decl_column(0x0e)
    2304            
    2305            $C$DW$156       .dwtag  DW_TAG_member
    2306                    .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2307                    .dwattr $C$DW$156, DW_AT_name("timerClear")
    2308                    .dwattr $C$DW$156, DW_AT_TI_symbol_name("timerClear")
    2309                    .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2310                    .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2311                    .dwattr $C$DW$156, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2312                    .dwattr $C$DW$156, DW_AT_decl_line(0xe6)
    2313                    .dwattr $C$DW$156, DW_AT_decl_column(0x0e)
    2314            
    2315            $C$DW$157       .dwtag  DW_TAG_member
    2316                    .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$22)
    2317                    .dwattr $C$DW$157, DW_AT_name("startTimer")
    2318                    .dwattr $C$DW$157, DW_AT_TI_symbol_name("startTimer")
    2319                    .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2320                    .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2321                    .dwattr $C$DW$157, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2322                    .dwattr $C$DW$157, DW_AT_decl_line(0xe8)
    2323                    .dwattr $C$DW$157, DW_AT_decl_column(0x0a)
    2324            
    2325                    .dwattr $C$DW$T$24, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2326                    .dwattr $C$DW$T$24, DW_AT_decl_line(0xb5)
    2327                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    2328                    .dwendtag $C$DW$T$24
    2329            
    2330            $C$DW$T$36      .dwtag  DW_TAG_typedef
    2331                    .dwattr $C$DW$T$36, DW_AT_name("Timer_A_initUpDownModeParam")
    2332                    .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$24)
    2333                    .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    2334                    .dwattr $C$DW$T$36, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2335                    .dwattr $C$DW$T$36, DW_AT_decl_line(0xe9)
    2336                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x03)
    2337            
    2338            $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    2339                    .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:21 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\054042                            PAGE   46

    2340                    .dwattr $C$DW$T$37, DW_AT_address_class(0x14)
    2341            
    2342            
    2343            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2344                    .dwattr $C$DW$T$25, DW_AT_name("Timer_A_initUpModeParam")
    2345                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
    2346            $C$DW$158       .dwtag  DW_TAG_member
    2347                    .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2348                    .dwattr $C$DW$158, DW_AT_name("clockSource")
    2349                    .dwattr $C$DW$158, DW_AT_TI_symbol_name("clockSource")
    2350                    .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2351                    .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2352                    .dwattr $C$DW$158, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2353                    .dwattr $C$DW$158, DW_AT_decl_line(0x139)
    2354                    .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    2355            
    2356            $C$DW$159       .dwtag  DW_TAG_member
    2357                    .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2358                    .dwattr $C$DW$159, DW_AT_name("clockSourceDivider")
    2359                    .dwattr $C$DW$159, DW_AT_TI_symbol_name("clockSourceDivider")
    2360                    .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2361                    .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2362                    .dwattr $C$DW$159, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2363                    .dwattr $C$DW$159, DW_AT_decl_line(0x150)
    2364                    .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    2365            
    2366            $C$DW$160       .dwtag  DW_TAG_member
    2367                    .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2368                    .dwattr $C$DW$160, DW_AT_name("timerPeriod")
    2369                    .dwattr $C$DW$160, DW_AT_TI_symbol_name("timerPeriod")
    2370                    .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2371                    .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2372                    .dwattr $C$DW$160, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2373                    .dwattr $C$DW$160, DW_AT_decl_line(0x153)
    2374                    .dwattr $C$DW$160, DW_AT_decl_column(0x0e)
    2375            
    2376            $C$DW$161       .dwtag  DW_TAG_member
    2377                    .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2378                    .dwattr $C$DW$161, DW_AT_name("timerInterruptEnable_TAIE")
    2379                    .dwattr $C$DW$161, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    2380                    .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2381                    .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2382                    .dwattr $C$DW$161, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2383                    .dwattr $C$DW$161, DW_AT_decl_line(0x158)
    2384                    .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    2385            
    2386            $C$DW$162       .dwtag  DW_TAG_member
    2387                    .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2388                    .dwattr $C$DW$162, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    2389                    .dwattr $C$DW$162, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    2390                    .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2391                    .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2392                    .dwattr $C$DW$162, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2393                    .dwattr $C$DW$162, DW_AT_decl_line(0x15d)
    2394                    .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:21 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\054042                            PAGE   47

    2395            
    2396            $C$DW$163       .dwtag  DW_TAG_member
    2397                    .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2398                    .dwattr $C$DW$163, DW_AT_name("timerClear")
    2399                    .dwattr $C$DW$163, DW_AT_TI_symbol_name("timerClear")
    2400                    .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2401                    .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2402                    .dwattr $C$DW$163, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2403                    .dwattr $C$DW$163, DW_AT_decl_line(0x163)
    2404                    .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    2405            
    2406            $C$DW$164       .dwtag  DW_TAG_member
    2407                    .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$22)
    2408                    .dwattr $C$DW$164, DW_AT_name("startTimer")
    2409                    .dwattr $C$DW$164, DW_AT_TI_symbol_name("startTimer")
    2410                    .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2411                    .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2412                    .dwattr $C$DW$164, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2413                    .dwattr $C$DW$164, DW_AT_decl_line(0x165)
    2414                    .dwattr $C$DW$164, DW_AT_decl_column(0x0a)
    2415            
    2416                    .dwattr $C$DW$T$25, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2417                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x131)
    2418                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    2419                    .dwendtag $C$DW$T$25
    2420            
    2421            $C$DW$T$39      .dwtag  DW_TAG_typedef
    2422                    .dwattr $C$DW$T$39, DW_AT_name("Timer_A_initUpModeParam")
    2423                    .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$25)
    2424                    .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    2425                    .dwattr $C$DW$T$39, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2426                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x166)
    2427                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x03)
    2428            
    2429            $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    2430                    .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    2431                    .dwattr $C$DW$T$40, DW_AT_address_class(0x14)
    2432            
    2433            
    2434            $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2435                    .dwattr $C$DW$T$26, DW_AT_name("Timer_A_outputPWMParam")
    2436                    .dwattr $C$DW$T$26, DW_AT_byte_size(0x0c)
    2437            $C$DW$165       .dwtag  DW_TAG_member
    2438                    .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2439                    .dwattr $C$DW$165, DW_AT_name("clockSource")
    2440                    .dwattr $C$DW$165, DW_AT_TI_symbol_name("clockSource")
    2441                    .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2442                    .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2443                    .dwattr $C$DW$165, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2444                    .dwattr $C$DW$165, DW_AT_decl_line(0xf8)
    2445                    .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    2446            
    2447            $C$DW$166       .dwtag  DW_TAG_member
    2448                    .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2449                    .dwattr $C$DW$166, DW_AT_name("clockSourceDivider")
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:21 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\054042                            PAGE   48

    2450                    .dwattr $C$DW$166, DW_AT_TI_symbol_name("clockSourceDivider")
    2451                    .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2452                    .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2453                    .dwattr $C$DW$166, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2454                    .dwattr $C$DW$166, DW_AT_decl_line(0x10f)
    2455                    .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    2456            
    2457            $C$DW$167       .dwtag  DW_TAG_member
    2458                    .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2459                    .dwattr $C$DW$167, DW_AT_name("timerPeriod")
    2460                    .dwattr $C$DW$167, DW_AT_TI_symbol_name("timerPeriod")
    2461                    .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2462                    .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2463                    .dwattr $C$DW$167, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2464                    .dwattr $C$DW$167, DW_AT_decl_line(0x111)
    2465                    .dwattr $C$DW$167, DW_AT_decl_column(0x0e)
    2466            
    2467            $C$DW$168       .dwtag  DW_TAG_member
    2468                    .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2469                    .dwattr $C$DW$168, DW_AT_name("compareRegister")
    2470                    .dwattr $C$DW$168, DW_AT_TI_symbol_name("compareRegister")
    2471                    .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2472                    .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2473                    .dwattr $C$DW$168, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2474                    .dwattr $C$DW$168, DW_AT_decl_line(0x11c)
    2475                    .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    2476            
    2477            $C$DW$169       .dwtag  DW_TAG_member
    2478                    .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2479                    .dwattr $C$DW$169, DW_AT_name("compareOutputMode")
    2480                    .dwattr $C$DW$169, DW_AT_TI_symbol_name("compareOutputMode")
    2481                    .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2482                    .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2483                    .dwattr $C$DW$169, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2484                    .dwattr $C$DW$169, DW_AT_decl_line(0x127)
    2485                    .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    2486            
    2487            $C$DW$170       .dwtag  DW_TAG_member
    2488                    .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2489                    .dwattr $C$DW$170, DW_AT_name("dutyCycle")
    2490                    .dwattr $C$DW$170, DW_AT_TI_symbol_name("dutyCycle")
    2491                    .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2492                    .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2493                    .dwattr $C$DW$170, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2494                    .dwattr $C$DW$170, DW_AT_decl_line(0x129)
    2495                    .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    2496            
    2497                    .dwattr $C$DW$T$26, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2498                    .dwattr $C$DW$T$26, DW_AT_decl_line(0xf0)
    2499                    .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    2500                    .dwendtag $C$DW$T$26
    2501            
    2502            $C$DW$T$42      .dwtag  DW_TAG_typedef
    2503                    .dwattr $C$DW$T$42, DW_AT_name("Timer_A_outputPWMParam")
    2504                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$26)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:20:21 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\054042                            PAGE   49

    2505                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    2506                    .dwattr $C$DW$T$42, DW_AT_decl_file("..\MSP430F5xx_6xx\timer_a.h")
    2507                    .dwattr $C$DW$T$42, DW_AT_decl_line(0x12a)
    2508                    .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
    2509            
    2510            $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    2511                    .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2512                    .dwattr $C$DW$T$43, DW_AT_address_class(0x14)
    2513            
    2514            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2515                    .dwattr $C$DW$T$2, DW_AT_name("void")
    2516            
    2517            
    2518            $C$DW$T$56      .dwtag  DW_TAG_subroutine_type
    2519                    .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2520                    .dwendtag $C$DW$T$56
    2521            
    2522            $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    2523                    .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    2524                    .dwattr $C$DW$T$57, DW_AT_address_class(0x14)
    2525            
    2526            $C$DW$T$58      .dwtag  DW_TAG_typedef
    2527                    .dwattr $C$DW$T$58, DW_AT_name("__SFR_FARPTR")
    2528                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2529                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2530                    .dwattr $C$DW$T$58, DW_AT_decl_file("D:\Program Files\TI CCSv6\ccsv6\ccs_base\msp430\include\m
    2531                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x47)
    2532                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x11)
    2533            
    2534            $C$DW$T$4       .dwtag  DW_TAG_base_type
    2535                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2536                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    2537                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2538            
    2539            $C$DW$T$5       .dwtag  DW_TAG_base_type
    2540                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2541                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2542                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2543            
    2544            $C$DW$T$59      .dwtag  DW_TAG_typedef
    2545                    .dwattr $C$DW$T$59, DW_AT_name("int8_t")
    2546                    .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$5)
    2547                    .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2548                    .dwattr $C$DW$T$59, DW_AT_decl_file("D:/Program Files/TI CCSv6/ccsv6/tools/compiler/msp430_15.
    2549                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x2a)
    2550                    .dwattr $C$DW$T$59, DW_AT_decl_column(0x1e)
