MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:12 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\057002                             PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                       PC v15.12.3.LTS *
       3            ;* Date/Time created: Mon Oct 17 14:33:12 2016                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../MSP430F5xx_6xx/tlv.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 2003-2
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("D:\CodeComposerProj\CardReader001\src\Debug")
      12            ;       D:\ti\ccsv6\tools\compiler\msp430_15.12.3.LTS\bin\opt430.exe D:/CodeComposerProj/CardReader001
      13 000000               .sect   ".text:TLV_getInfo"
      14                    .clink
      15                    .global TLV_getInfo
      16            

    1123                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    1124                    .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    1125                    .dwattr $C$DW$T$66, DW_AT_decl_file("D:/ti/ccsv6/tools/compiler/msp430_15.12.3.LTS/include/std
    1126                    .dwattr $C$DW$T$66, DW_AT_decl_line(0x4e)
    1127                    .dwattr $C$DW$T$66, DW_AT_decl_column(0x17)
    1128            
    1129            $C$DW$T$67      .dwtag  DW_TAG_typedef
    1130                    .dwattr $C$DW$T$67, DW_AT_name("int_least64_t")
    1131                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$65)
    1132                    .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    1133                    .dwattr $C$DW$T$67, DW_AT_decl_file("D:/ti/ccsv6/tools/compiler/msp430_15.12.3.LTS/include/std
    1134                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x40)
    1135                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x17)
    1136            
    1137            $C$DW$T$68      .dwtag  DW_TAG_typedef
    1138                    .dwattr $C$DW$T$68, DW_AT_name("intmax_t")
    1139                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$14)
    1140                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1141                    .dwattr $C$DW$T$68, DW_AT_decl_file("D:/ti/ccsv6/tools/compiler/msp430_15.12.3.LTS/include/std
    1142                    .dwattr $C$DW$T$68, DW_AT_decl_line(0x5d)
    1143                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x20)
    1144            
    1145            $C$DW$T$15      .dwtag  DW_TAG_base_type
    1146                    .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1147                    .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1148                    .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    1149            
    1150            $C$DW$T$69      .dwtag  DW_TAG_typedef
    1151                    .dwattr $C$DW$T$69, DW_AT_name("uint64_t")
    1152                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$15)
    1153                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1154                    .dwattr $C$DW$T$69, DW_AT_decl_file("D:/ti/ccsv6/tools/compiler/msp430_15.12.3.LTS/include/std
    1155                    .dwattr $C$DW$T$69, DW_AT_decl_line(0x33)
    1156                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x20)
    1157            
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:12 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\057002                             PAGE   23

    1158            $C$DW$T$70      .dwtag  DW_TAG_typedef
    1159                    .dwattr $C$DW$T$70, DW_AT_name("uint_fast64_t")
    1160                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    1161                    .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1162                    .dwattr $C$DW$T$70, DW_AT_decl_file("D:/ti/ccsv6/tools/compiler/msp430_15.12.3.LTS/include/std
    1163                    .dwattr $C$DW$T$70, DW_AT_decl_line(0x4f)
    1164                    .dwattr $C$DW$T$70, DW_AT_decl_column(0x16)
    1165            
    1166            $C$DW$T$71      .dwtag  DW_TAG_typedef
    1167                    .dwattr $C$DW$T$71, DW_AT_name("uint_least64_t")
    1168                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$69)
    1169                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1170                    .dwattr $C$DW$T$71, DW_AT_decl_file("D:/ti/ccsv6/tools/compiler/msp430_15.12.3.LTS/include/std
    1171                    .dwattr $C$DW$T$71, DW_AT_decl_line(0x41)
    1172                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x16)
    1173            
    1174            $C$DW$T$72      .dwtag  DW_TAG_typedef
    1175                    .dwattr $C$DW$T$72, DW_AT_name("uintmax_t")
    1176                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$15)
    1177                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1178                    .dwattr $C$DW$T$72, DW_AT_decl_file("D:/ti/ccsv6/tools/compiler/msp430_15.12.3.LTS/include/std
    1179                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x5e)
    1180                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x20)
    1181            
    1182            $C$DW$T$16      .dwtag  DW_TAG_base_type
    1183                    .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1184                    .dwattr $C$DW$T$16, DW_AT_name("float")
    1185                    .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    1186            
    1187            $C$DW$T$17      .dwtag  DW_TAG_base_type
    1188                    .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1189                    .dwattr $C$DW$T$17, DW_AT_name("double")
    1190                    .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    1191            
    1192            $C$DW$T$18      .dwtag  DW_TAG_base_type
    1193                    .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1194                    .dwattr $C$DW$T$18, DW_AT_name("long double")
    1195                    .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    1196            
    1197            $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    1198                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$6)
    1199                    .dwattr $C$DW$T$74, DW_AT_address_class(0x14)
    1200            
    1201            
    1202            $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1203                    .dwattr $C$DW$T$20, DW_AT_name("s_Peripheral_Memory_Data")
    1204                    .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
    1205            $C$DW$45        .dwtag  DW_TAG_member
    1206                    .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
    1207                    .dwattr $C$DW$45, DW_AT_name("memory_1")
    1208                    .dwattr $C$DW$45, DW_AT_TI_symbol_name("memory_1")
    1209                    .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1210                    .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1211                    .dwattr $C$DW$45, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1212                    .dwattr $C$DW$45, DW_AT_decl_line(0x63)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:12 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\057002                             PAGE   24

    1213                    .dwattr $C$DW$45, DW_AT_decl_column(0x0e)
    1214            
    1215            $C$DW$46        .dwtag  DW_TAG_member
    1216                    .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
    1217                    .dwattr $C$DW$46, DW_AT_name("memory_2")
    1218                    .dwattr $C$DW$46, DW_AT_TI_symbol_name("memory_2")
    1219                    .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1220                    .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1221                    .dwattr $C$DW$46, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1222                    .dwattr $C$DW$46, DW_AT_decl_line(0x64)
    1223                    .dwattr $C$DW$46, DW_AT_decl_column(0x0e)
    1224            
    1225            $C$DW$47        .dwtag  DW_TAG_member
    1226                    .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
    1227                    .dwattr $C$DW$47, DW_AT_name("memory_3")
    1228                    .dwattr $C$DW$47, DW_AT_TI_symbol_name("memory_3")
    1229                    .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1230                    .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1231                    .dwattr $C$DW$47, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1232                    .dwattr $C$DW$47, DW_AT_decl_line(0x65)
    1233                    .dwattr $C$DW$47, DW_AT_decl_column(0x0e)
    1234            
    1235            $C$DW$48        .dwtag  DW_TAG_member
    1236                    .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
    1237                    .dwattr $C$DW$48, DW_AT_name("memory_4")
    1238                    .dwattr $C$DW$48, DW_AT_TI_symbol_name("memory_4")
    1239                    .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1240                    .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1241                    .dwattr $C$DW$48, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1242                    .dwattr $C$DW$48, DW_AT_decl_line(0x66)
    1243                    .dwattr $C$DW$48, DW_AT_decl_column(0x0e)
    1244            
    1245                    .dwattr $C$DW$T$20, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1246                    .dwattr $C$DW$T$20, DW_AT_decl_line(0x61)
    1247                    .dwattr $C$DW$T$20, DW_AT_decl_column(0x08)
    1248                    .dwendtag $C$DW$T$20
    1249            
    1250            
    1251            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1252                    .dwattr $C$DW$T$22, DW_AT_name("s_TLV_ADC_Cal_Data")
    1253                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    1254            $C$DW$49        .dwtag  DW_TAG_member
    1255                    .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
    1256                    .dwattr $C$DW$49, DW_AT_name("adc_gain_factor")
    1257                    .dwattr $C$DW$49, DW_AT_TI_symbol_name("adc_gain_factor")
    1258                    .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1259                    .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1260                    .dwattr $C$DW$49, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1261                    .dwattr $C$DW$49, DW_AT_decl_line(0x48)
    1262                    .dwattr $C$DW$49, DW_AT_decl_column(0x0e)
    1263            
    1264            $C$DW$50        .dwtag  DW_TAG_member
    1265                    .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$21)
    1266                    .dwattr $C$DW$50, DW_AT_name("adc_offset")
    1267                    .dwattr $C$DW$50, DW_AT_TI_symbol_name("adc_offset")
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:12 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\057002                             PAGE   25

    1268                    .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1269                    .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1270                    .dwattr $C$DW$50, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1271                    .dwattr $C$DW$50, DW_AT_decl_line(0x49)
    1272                    .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
    1273            
    1274            $C$DW$51        .dwtag  DW_TAG_member
    1275                    .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
    1276                    .dwattr $C$DW$51, DW_AT_name("adc_ref15_30_temp")
    1277                    .dwattr $C$DW$51, DW_AT_TI_symbol_name("adc_ref15_30_temp")
    1278                    .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1279                    .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1280                    .dwattr $C$DW$51, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1281                    .dwattr $C$DW$51, DW_AT_decl_line(0x4a)
    1282                    .dwattr $C$DW$51, DW_AT_decl_column(0x0e)
    1283            
    1284            $C$DW$52        .dwtag  DW_TAG_member
    1285                    .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
    1286                    .dwattr $C$DW$52, DW_AT_name("adc_ref15_85_temp")
    1287                    .dwattr $C$DW$52, DW_AT_TI_symbol_name("adc_ref15_85_temp")
    1288                    .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1289                    .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1290                    .dwattr $C$DW$52, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1291                    .dwattr $C$DW$52, DW_AT_decl_line(0x4b)
    1292                    .dwattr $C$DW$52, DW_AT_decl_column(0x0e)
    1293            
    1294            $C$DW$53        .dwtag  DW_TAG_member
    1295                    .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
    1296                    .dwattr $C$DW$53, DW_AT_name("adc_ref20_30_temp")
    1297                    .dwattr $C$DW$53, DW_AT_TI_symbol_name("adc_ref20_30_temp")
    1298                    .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1299                    .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1300                    .dwattr $C$DW$53, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1301                    .dwattr $C$DW$53, DW_AT_decl_line(0x4c)
    1302                    .dwattr $C$DW$53, DW_AT_decl_column(0x0e)
    1303            
    1304            $C$DW$54        .dwtag  DW_TAG_member
    1305                    .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
    1306                    .dwattr $C$DW$54, DW_AT_name("adc_ref20_85_temp")
    1307                    .dwattr $C$DW$54, DW_AT_TI_symbol_name("adc_ref20_85_temp")
    1308                    .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1309                    .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1310                    .dwattr $C$DW$54, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1311                    .dwattr $C$DW$54, DW_AT_decl_line(0x4d)
    1312                    .dwattr $C$DW$54, DW_AT_decl_column(0x0e)
    1313            
    1314            $C$DW$55        .dwtag  DW_TAG_member
    1315                    .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
    1316                    .dwattr $C$DW$55, DW_AT_name("adc_ref25_30_temp")
    1317                    .dwattr $C$DW$55, DW_AT_TI_symbol_name("adc_ref25_30_temp")
    1318                    .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1319                    .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1320                    .dwattr $C$DW$55, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1321                    .dwattr $C$DW$55, DW_AT_decl_line(0x4e)
    1322                    .dwattr $C$DW$55, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:12 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\057002                             PAGE   26

    1323            
    1324            $C$DW$56        .dwtag  DW_TAG_member
    1325                    .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
    1326                    .dwattr $C$DW$56, DW_AT_name("adc_ref25_85_temp")
    1327                    .dwattr $C$DW$56, DW_AT_TI_symbol_name("adc_ref25_85_temp")
    1328                    .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1329                    .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1330                    .dwattr $C$DW$56, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1331                    .dwattr $C$DW$56, DW_AT_decl_line(0x4f)
    1332                    .dwattr $C$DW$56, DW_AT_decl_column(0x0e)
    1333            
    1334                    .dwattr $C$DW$T$22, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1335                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x46)
    1336                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x08)
    1337                    .dwendtag $C$DW$T$22
    1338            
    1339            
    1340            $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1341                    .dwattr $C$DW$T$24, DW_AT_name("s_TLV_Die_Record")
    1342                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
    1343            $C$DW$57        .dwtag  DW_TAG_member
    1344                    .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$23)
    1345                    .dwattr $C$DW$57, DW_AT_name("wafer_id")
    1346                    .dwattr $C$DW$57, DW_AT_TI_symbol_name("wafer_id")
    1347                    .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1348                    .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1349                    .dwattr $C$DW$57, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1350                    .dwattr $C$DW$57, DW_AT_decl_line(0x40)
    1351                    .dwattr $C$DW$57, DW_AT_decl_column(0x0e)
    1352            
    1353            $C$DW$58        .dwtag  DW_TAG_member
    1354                    .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
    1355                    .dwattr $C$DW$58, DW_AT_name("die_x_position")
    1356                    .dwattr $C$DW$58, DW_AT_TI_symbol_name("die_x_position")
    1357                    .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1358                    .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1359                    .dwattr $C$DW$58, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1360                    .dwattr $C$DW$58, DW_AT_decl_line(0x41)
    1361                    .dwattr $C$DW$58, DW_AT_decl_column(0x0e)
    1362            
    1363            $C$DW$59        .dwtag  DW_TAG_member
    1364                    .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
    1365                    .dwattr $C$DW$59, DW_AT_name("die_y_position")
    1366                    .dwattr $C$DW$59, DW_AT_TI_symbol_name("die_y_position")
    1367                    .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1368                    .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1369                    .dwattr $C$DW$59, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1370                    .dwattr $C$DW$59, DW_AT_decl_line(0x42)
    1371                    .dwattr $C$DW$59, DW_AT_decl_column(0x0e)
    1372            
    1373            $C$DW$60        .dwtag  DW_TAG_member
    1374                    .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1375                    .dwattr $C$DW$60, DW_AT_name("test_results")
    1376                    .dwattr $C$DW$60, DW_AT_TI_symbol_name("test_results")
    1377                    .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:12 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\057002                             PAGE   27

    1378                    .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1379                    .dwattr $C$DW$60, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1380                    .dwattr $C$DW$60, DW_AT_decl_line(0x43)
    1381                    .dwattr $C$DW$60, DW_AT_decl_column(0x0e)
    1382            
    1383                    .dwattr $C$DW$T$24, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1384                    .dwattr $C$DW$T$24, DW_AT_decl_line(0x3e)
    1385                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x08)
    1386                    .dwendtag $C$DW$T$24
    1387            
    1388            
    1389            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1390                    .dwattr $C$DW$T$25, DW_AT_name("s_TLV_REF_Cal_Data")
    1391                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x06)
    1392            $C$DW$61        .dwtag  DW_TAG_member
    1393                    .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1394                    .dwattr $C$DW$61, DW_AT_name("ref_ref15")
    1395                    .dwattr $C$DW$61, DW_AT_TI_symbol_name("ref_ref15")
    1396                    .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1397                    .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1398                    .dwattr $C$DW$61, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1399                    .dwattr $C$DW$61, DW_AT_decl_line(0x5c)
    1400                    .dwattr $C$DW$61, DW_AT_decl_column(0x0e)
    1401            
    1402            $C$DW$62        .dwtag  DW_TAG_member
    1403                    .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1404                    .dwattr $C$DW$62, DW_AT_name("ref_ref20")
    1405                    .dwattr $C$DW$62, DW_AT_TI_symbol_name("ref_ref20")
    1406                    .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1407                    .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1408                    .dwattr $C$DW$62, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1409                    .dwattr $C$DW$62, DW_AT_decl_line(0x5d)
    1410                    .dwattr $C$DW$62, DW_AT_decl_column(0x0e)
    1411            
    1412            $C$DW$63        .dwtag  DW_TAG_member
    1413                    .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1414                    .dwattr $C$DW$63, DW_AT_name("ref_ref25")
    1415                    .dwattr $C$DW$63, DW_AT_TI_symbol_name("ref_ref25")
    1416                    .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1417                    .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1418                    .dwattr $C$DW$63, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1419                    .dwattr $C$DW$63, DW_AT_decl_line(0x5e)
    1420                    .dwattr $C$DW$63, DW_AT_decl_column(0x0e)
    1421            
    1422                    .dwattr $C$DW$T$25, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1423                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x5a)
    1424                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x08)
    1425                    .dwendtag $C$DW$T$25
    1426            
    1427            
    1428            $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1429                    .dwattr $C$DW$T$26, DW_AT_name("s_TLV_Timer_D_Cal_Data")
    1430                    .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    1431            $C$DW$64        .dwtag  DW_TAG_member
    1432                    .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:12 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\057002                             PAGE   28

    1433                    .dwattr $C$DW$64, DW_AT_name("TDH0CTL1_64")
    1434                    .dwattr $C$DW$64, DW_AT_TI_symbol_name("TDH0CTL1_64")
    1435                    .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1436                    .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1437                    .dwattr $C$DW$64, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1438                    .dwattr $C$DW$64, DW_AT_decl_line(0x54)
    1439                    .dwattr $C$DW$64, DW_AT_decl_column(0x0e)
    1440            
    1441            $C$DW$65        .dwtag  DW_TAG_member
    1442                    .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1443                    .dwattr $C$DW$65, DW_AT_name("TDH0CTL1_128")
    1444                    .dwattr $C$DW$65, DW_AT_TI_symbol_name("TDH0CTL1_128")
    1445                    .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1446                    .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1447                    .dwattr $C$DW$65, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1448                    .dwattr $C$DW$65, DW_AT_decl_line(0x55)
    1449                    .dwattr $C$DW$65, DW_AT_decl_column(0x0e)
    1450            
    1451            $C$DW$66        .dwtag  DW_TAG_member
    1452                    .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1453                    .dwattr $C$DW$66, DW_AT_name("TDH0CTL1_200")
    1454                    .dwattr $C$DW$66, DW_AT_TI_symbol_name("TDH0CTL1_200")
    1455                    .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1456                    .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1457                    .dwattr $C$DW$66, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1458                    .dwattr $C$DW$66, DW_AT_decl_line(0x56)
    1459                    .dwattr $C$DW$66, DW_AT_decl_column(0x0e)
    1460            
    1461            $C$DW$67        .dwtag  DW_TAG_member
    1462                    .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1463                    .dwattr $C$DW$67, DW_AT_name("TDH0CTL1_256")
    1464                    .dwattr $C$DW$67, DW_AT_TI_symbol_name("TDH0CTL1_256")
    1465                    .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1466                    .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1467                    .dwattr $C$DW$67, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1468                    .dwattr $C$DW$67, DW_AT_decl_line(0x57)
    1469                    .dwattr $C$DW$67, DW_AT_decl_column(0x0e)
    1470            
    1471                    .dwattr $C$DW$T$26, DW_AT_decl_file("..\MSP430F5xx_6xx\tlv.h")
    1472                    .dwattr $C$DW$T$26, DW_AT_decl_line(0x52)
    1473                    .dwattr $C$DW$T$26, DW_AT_decl_column(0x08)
    1474                    .dwendtag $C$DW$T$26
    1475            
    1476                    .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1477            
    1478            ;***************************************************************
    1479            ;* DWARF CIE ENTRIES                                           *
    1480            ;***************************************************************
    1481            
    1482            $C$DW$CIE       .dwcie 16
    1483                    .dwcfi  cfa_register, 1
    1484                    .dwcfi  cfa_offset, 0
    1485                    .dwcfi  same_value, 0
    1486                    .dwcfi  same_value, 1
    1487                    .dwcfi  undefined, 2
MSP430 Assembler PC v15.12.3 Mon Oct 17 14:33:12 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\madis\AppData\Local\Temp\057002                             PAGE   29

    1488                    .dwcfi  same_value, 3
    1489                    .dwcfi  same_value, 4
    1490                    .dwcfi  same_value, 5
    1491                    .dwcfi  same_value, 6
    1492                    .dwcfi  same_value, 7
    1493                    .dwcfi  same_value, 8
    1494                    .dwcfi  same_value, 9
    1495                    .dwcfi  same_value, 10
    1496                    .dwcfi  undefined, 11
    1497                    .dwcfi  undefined, 12
    1498                    .dwcfi  undefined, 13
    1499                    .dwcfi  undefined, 14
    1500                    .dwcfi  undefined, 15
    1501                    .dwcfi  undefined, 16
    1502                    .dwendentry
    1503            
    1504            ;***************************************************************
    1505            ;* DWARF REGISTER MAP                                          *
    1506            ;***************************************************************
    1507            
    1508            $C$DW$68        .dwtag  DW_TAG_TI_assign_register
    1509                    .dwattr $C$DW$68, DW_AT_name("PC")
    1510                    .dwattr $C$DW$68, DW_AT_location[DW_OP_reg0]
    1511            
    1512            $C$DW$69        .dwtag  DW_TAG_TI_assign_register
    1513                    .dwattr $C$DW$69, DW_AT_name("SP")
    1514                    .dwattr $C$DW$69, DW_AT_location[DW_OP_reg1]
    1515            
    1516            $C$DW$70        .dwtag  DW_TAG_TI_assign_register
    1517                    .dwattr $C$DW$70, DW_AT_name("SR")
    1518                    .dwattr $C$DW$70, DW_AT_location[DW_OP_reg2]
    1519            
    1520            $C$DW$71        .dwtag  DW_TAG_TI_assign_register
    1521                    .dwattr $C$DW$71, DW_AT_name("CG")
    1522                    .dwattr $C$DW$71, DW_AT_location[DW_OP_reg3]
    1523            
    1524            $C$DW$72        .dwtag  DW_TAG_TI_assign_register
    1525                    .dwattr $C$DW$72, DW_AT_name("r4")
    1526                    .dwattr $C$DW$72, DW_AT_location[DW_OP_reg4]
    1527            
    1528            $C$DW$73        .dwtag  DW_TAG_TI_assign_register
    1529                    .dwattr $C$DW$73, DW_AT_name("r5")
    1530                    .dwattr $C$DW$73, DW_AT_location[DW_OP_reg5]
    1531            
