MSP430 Assembler PC v15.12.3 Wed Oct 12 11:22:58 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\105202                            PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                       PC v15.12.3.LTS *
       3            ;* Date/Time created: Wed Oct 12 11:22:58 2016                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../MSP430F5xx_6xx/usci_a_uart.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 C/C++ Codegen PC v15.12.3.LTS Copyright (c) 2003-2
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Programmeerimine\Code Composer WS\CardReader\src\Debug")
      12            ;       D:\Program Files\TI CCSv6\ccsv6\tools\compiler\msp430_15.12.3.LTS\bin\opt430.exe D:/Programmee
      13 000000               .sect   ".text:USCI_A_UART_init"
      14                    .clink
      15                    .global USCI_A_UART_init

    1260                    .dwendentry
    1261                    .dwendtag $C$DW$73
    1262            
    1263 000000               .sect   ".text:USCI_A_UART_getTransmitBufferAddressForDMA"
    1264                    .clink
    1265                    .global USCI_A_UART_getTransmitBufferAddressForDMA
    1266            
    1267            $C$DW$76        .dwtag  DW_TAG_subprogram
    1268                    .dwattr $C$DW$76, DW_AT_name("USCI_A_UART_getTransmitBufferAddressForDMA")
    1269                    .dwattr $C$DW$76, DW_AT_low_pc(USCI_A_UART_getTransmitBufferAddressForDMA)
    1270                    .dwattr $C$DW$76, DW_AT_high_pc(0x00)
    1271                    .dwattr $C$DW$76, DW_AT_TI_symbol_name("USCI_A_UART_getTransmitBufferAddressForDMA")
    1272                    .dwattr $C$DW$76, DW_AT_external
    1273                    .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$54)
    1274                    .dwattr $C$DW$76, DW_AT_TI_begin_file("../MSP430F5xx_6xx/usci_a_uart.c")
    1275                    .dwattr $C$DW$76, DW_AT_TI_begin_line(0x105)
    1276                    .dwattr $C$DW$76, DW_AT_TI_begin_column(0x0a)
    1277                    .dwattr $C$DW$76, DW_AT_decl_file("../MSP430F5xx_6xx/usci_a_uart.c")
    1278                    .dwattr $C$DW$76, DW_AT_decl_line(0x105)
    1279                    .dwattr $C$DW$76, DW_AT_decl_column(0x0a)
    1280                    .dwattr $C$DW$76, DW_AT_TI_max_frame_size(0x04)
    1281                    .dwpsn  file "../MSP430F5xx_6xx/usci_a_uart.c",line 262,column 1,is_stmt,address USCI_A_UART_g
    1282            
    1283                    .dwfde $C$DW$CIE, USCI_A_UART_getTransmitBufferAddressForDMA
    1284            $C$DW$77        .dwtag  DW_TAG_formal_parameter
    1285                    .dwattr $C$DW$77, DW_AT_name("baseAddress")
    1286                    .dwattr $C$DW$77, DW_AT_TI_symbol_name("baseAddress")
    1287                    .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$20)
    1288                    .dwattr $C$DW$77, DW_AT_location[DW_OP_reg12]
    1289            
    1290            
    1291            ;*****************************************************************************
    1292            ;* FUNCTION NAME: USCI_A_UART_getTransmitBufferAddressForDMA                 *
    1293            ;*                                                                           *
    1294            ;*   Regs Modified     : SP,SR,r12,r13                                       *
    1295            ;*   Regs Used         : SP,SR,r12,r13                                       *
    1296            ;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
    1297            ;*****************************************************************************
    1298 000000       USCI_A_UART_getTransmitBufferAddressForDMA:
    1299            ;* --------------------------------------------------------------------------*
    1300                    .dwcfi  cfa_offset, 4
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:22:58 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\105202                            PAGE   26

    1301                    .dwcfi  save_reg_to_mem, 16, -4
    1302                    .dwpsn  file "../MSP430F5xx_6xx/usci_a_uart.c",line 263,column 5,is_stmt,isa 0
    1303 000000 503C          ADD.W     #14,r12               ; [] |263| 
         000002 000E 
    1304 000004 430D          MOV.W     #0,r13                ; [] |263| 
    1305                    .dwpsn  file "../MSP430F5xx_6xx/usci_a_uart.c",line 264,column 1,is_stmt,isa 0
    1306            $C$DW$78        .dwtag  DW_TAG_TI_branch
    1307                    .dwattr $C$DW$78, DW_AT_low_pc(0x00)
    1308                    .dwattr $C$DW$78, DW_AT_TI_return
    1309            
    1310 000006 0110          RETA      ; [] 
    1311                    ; [] 
    1312                    .dwattr $C$DW$76, DW_AT_TI_end_file("../MSP430F5xx_6xx/usci_a_uart.c")
    1313                    .dwattr $C$DW$76, DW_AT_TI_end_line(0x108)
    1314                    .dwattr $C$DW$76, DW_AT_TI_end_column(0x01)
    1315                    .dwendentry
    1316                    .dwendtag $C$DW$76
    1317            
    1318            
    1319            ;******************************************************************************
    1320            ;* BUILD ATTRIBUTES                                                           *
    1321            ;******************************************************************************
    1322                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
    1323                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000001111000000000
    1324                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
    1325                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
    1326                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
    1327                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
    1328            
    1329            ;******************************************************************************
    1330            ;* TYPE INFORMATION                                                           *
    1331            ;******************************************************************************
    1332            
    1333            $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1334                    .dwattr $C$DW$T$21, DW_AT_name("USCI_A_UART_initParam")
    1335                    .dwattr $C$DW$T$21, DW_AT_byte_size(0x0c)
    1336            $C$DW$79        .dwtag  DW_TAG_member
    1337                    .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1338                    .dwattr $C$DW$79, DW_AT_name("selectClockSource")
    1339                    .dwattr $C$DW$79, DW_AT_TI_symbol_name("selectClockSource")
    1340                    .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1341                    .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1342                    .dwattr $C$DW$79, DW_AT_decl_file("..\MSP430F5xx_6xx\usci_a_uart.h")
    1343                    .dwattr $C$DW$79, DW_AT_decl_line(0x4c)
    1344                    .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1345            
    1346            $C$DW$80        .dwtag  DW_TAG_member
    1347                    .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
    1348                    .dwattr $C$DW$80, DW_AT_name("clockPrescalar")
    1349                    .dwattr $C$DW$80, DW_AT_TI_symbol_name("clockPrescalar")
    1350                    .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1351                    .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1352                    .dwattr $C$DW$80, DW_AT_decl_file("..\MSP430F5xx_6xx\usci_a_uart.h")
    1353                    .dwattr $C$DW$80, DW_AT_decl_line(0x4e)
    1354                    .dwattr $C$DW$80, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:22:58 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\105202                            PAGE   27

    1355            
    1356            $C$DW$81        .dwtag  DW_TAG_member
    1357                    .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1358                    .dwattr $C$DW$81, DW_AT_name("firstModReg")
    1359                    .dwattr $C$DW$81, DW_AT_TI_symbol_name("firstModReg")
    1360                    .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1361                    .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1362                    .dwattr $C$DW$81, DW_AT_decl_file("..\MSP430F5xx_6xx\usci_a_uart.h")
    1363                    .dwattr $C$DW$81, DW_AT_decl_line(0x52)
    1364                    .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1365            
    1366            $C$DW$82        .dwtag  DW_TAG_member
    1367                    .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1368                    .dwattr $C$DW$82, DW_AT_name("secondModReg")
    1369                    .dwattr $C$DW$82, DW_AT_TI_symbol_name("secondModReg")
    1370                    .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1371                    .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1372                    .dwattr $C$DW$82, DW_AT_decl_file("..\MSP430F5xx_6xx\usci_a_uart.h")
    1373                    .dwattr $C$DW$82, DW_AT_decl_line(0x56)
    1374                    .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1375            
    1376            $C$DW$83        .dwtag  DW_TAG_member
    1377                    .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1378                    .dwattr $C$DW$83, DW_AT_name("parity")
    1379                    .dwattr $C$DW$83, DW_AT_TI_symbol_name("parity")
    1380                    .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1381                    .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1382                    .dwattr $C$DW$83, DW_AT_decl_file("..\MSP430F5xx_6xx\usci_a_uart.h")
    1383                    .dwattr $C$DW$83, DW_AT_decl_line(0x5c)
    1384                    .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1385            
    1386            $C$DW$84        .dwtag  DW_TAG_member
    1387                    .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1388                    .dwattr $C$DW$84, DW_AT_name("msborLsbFirst")
    1389                    .dwattr $C$DW$84, DW_AT_TI_symbol_name("msborLsbFirst")
    1390                    .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1391                    .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1392                    .dwattr $C$DW$84, DW_AT_decl_file("..\MSP430F5xx_6xx\usci_a_uart.h")
    1393                    .dwattr $C$DW$84, DW_AT_decl_line(0x61)
    1394                    .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1395            
    1396            $C$DW$85        .dwtag  DW_TAG_member
    1397                    .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1398                    .dwattr $C$DW$85, DW_AT_name("numberofStopBits")
    1399                    .dwattr $C$DW$85, DW_AT_TI_symbol_name("numberofStopBits")
    1400                    .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1401                    .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1402                    .dwattr $C$DW$85, DW_AT_decl_file("..\MSP430F5xx_6xx\usci_a_uart.h")
    1403                    .dwattr $C$DW$85, DW_AT_decl_line(0x66)
    1404                    .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1405            
    1406            $C$DW$86        .dwtag  DW_TAG_member
    1407                    .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1408                    .dwattr $C$DW$86, DW_AT_name("uartMode")
    1409                    .dwattr $C$DW$86, DW_AT_TI_symbol_name("uartMode")
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:22:58 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\105202                            PAGE   28

    1410                    .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1411                    .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1412                    .dwattr $C$DW$86, DW_AT_decl_file("..\MSP430F5xx_6xx\usci_a_uart.h")
    1413                    .dwattr $C$DW$86, DW_AT_decl_line(0x6d)
    1414                    .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1415            
    1416            $C$DW$87        .dwtag  DW_TAG_member
    1417                    .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1418                    .dwattr $C$DW$87, DW_AT_name("overSampling")
    1419                    .dwattr $C$DW$87, DW_AT_TI_symbol_name("overSampling")
    1420                    .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1421                    .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1422                    .dwattr $C$DW$87, DW_AT_decl_file("..\MSP430F5xx_6xx\usci_a_uart.h")
    1423                    .dwattr $C$DW$87, DW_AT_decl_line(0x72)
    1424                    .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1425            
    1426                    .dwattr $C$DW$T$21, DW_AT_decl_file("..\MSP430F5xx_6xx\usci_a_uart.h")
    1427                    .dwattr $C$DW$T$21, DW_AT_decl_line(0x46)
    1428                    .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    1429                    .dwendtag $C$DW$T$21
    1430            
    1431            $C$DW$T$22      .dwtag  DW_TAG_typedef
    1432                    .dwattr $C$DW$T$22, DW_AT_name("USCI_A_UART_initParam")
    1433                    .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    1434                    .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    1435                    .dwattr $C$DW$T$22, DW_AT_decl_file("..\MSP430F5xx_6xx\usci_a_uart.h")
    1436                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x73)
    1437                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x03)
    1438            
    1439            $C$DW$T$23      .dwtag  DW_TAG_pointer_type
    1440                    .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    1441                    .dwattr $C$DW$T$23, DW_AT_address_class(0x14)
    1442            
    1443            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1444                    .dwattr $C$DW$T$2, DW_AT_name("void")
    1445            
    1446            
    1447            $C$DW$T$27      .dwtag  DW_TAG_subroutine_type
    1448                    .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1449                    .dwendtag $C$DW$T$27
    1450            
    1451            $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    1452                    .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    1453                    .dwattr $C$DW$T$28, DW_AT_address_class(0x14)
    1454            
    1455            $C$DW$T$29      .dwtag  DW_TAG_typedef
    1456                    .dwattr $C$DW$T$29, DW_AT_name("__SFR_FARPTR")
    1457                    .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    1458                    .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1459                    .dwattr $C$DW$T$29, DW_AT_decl_file("D:\Program Files\TI CCSv6\ccsv6\ccs_base\msp430\include\m
    1460                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x47)
    1461                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x11)
    1462            
    1463            $C$DW$T$4       .dwtag  DW_TAG_base_type
    1464                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
MSP430 Assembler PC v15.12.3 Wed Oct 12 11:22:58 2016

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
C:\Users\LokBok\AppData\Local\Temp\105202                            PAGE   29

    1465                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    1466                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1467            
    1468            $C$DW$T$5       .dwtag  DW_TAG_base_type
    1469                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1470                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1471                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1472            
    1473            $C$DW$T$30      .dwtag  DW_TAG_typedef
    1474                    .dwattr $C$DW$T$30, DW_AT_name("int8_t")
    1475                    .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$5)
    1476                    .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1477                    .dwattr $C$DW$T$30, DW_AT_decl_file("D:/Program Files/TI CCSv6/ccsv6/tools/compiler/msp430_15.
    1478                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x2a)
